[
  {
    "name": "4160 Tuesdays - Perfume Making with Sarah McCartney",
    "location": "Acton",
    "moods": [
      "sensory",
      "nostalgic"
    ],
    "genres": [
      "perfume blending",
      "fragrance design"
    ],
    "url": "https://www.4160tuesdays.com",
    "blurb": "In a scent-laced studio in Acton, the perfumer Sarah McCartney invites you into her fragrant world. Blend citrus with memory, amber with desire, and leave with a vial stitched from story. This is scent as self-expression, distilled and stirred - an olfactory adventure for the curious nose.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "58 and Co - Gin School Experience",
    "location": "Haggerston (E8)",
    "moods": [
      "craft & making",
      "adult play",
      "epicurean"
    ],
    "genres": [
      "gin distilling and tasting"
    ],
    "url": "https://58gin.com/pages/gin-school-experience",
    "blurb": "In a copper-lit haven in Haggerston, the botanicals wait. Juniper, cardamom, citrus peel - each a memory, each a promise. At 58 and Co, you craft not just gin, but story: choosing your blend, distilling on gleaming stills, sealing your own bottle with wax and wonder. There's laughter in the air and cocktail on the tongue - a heady blend of chemistry, history, and the quiet art of becoming spirit.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "5Rhythms 'FIVE London' Workshop",
    "location": "St Luke's Church, Hillmarton Road, London N7 9RE",
    "moods": [
      "fluid",
      "transformative",
      "meditative",
      "expressive"
    ],
    "genres": [
      "5Rhythms (flowing, staccato, chaos, lyrical, stillness)"
    ],
    "url": "https://www.5rhythms.com/workshops/FIVELondon-295203",
    "blurb": "Three days. Five rhythms. One unfolding wave. In the sacred space of St Luke's, dancers ride the arc of flow and stillness, chaos and grace. It's less a class, more a rite - where movement becomes mirror and the body remembers what it means to be free.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "5Rhythms Dance – We Dance with Nikki Ashley",
    "location": "Balham",
    "moods": [
      "fluid",
      "transformative"
    ],
    "genres": [
      "5Rhythms",
      "movement meditation"
    ],
    "url": "https://bookwhen.com/unboundmovingarts#focus=ev-s4lo-20251217191000",
    "blurb": "Movement here is map and mystery. On the worn wooden floor of St Peter's Church Hall, bodies unspool into rhythm: flowing, staccato, chaos, lyrical, stillness. You're not learning to dance — you're remembering how to listen, how to move through the storm and into the centre of your own breath.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Ace Cafe London",
    "location": "North West London",
    "moods": [
      "rebellious",
      "nostalgic"
    ],
    "genres": [
      "rock n roll",
      "live music"
    ],
    "url": "https://london.acecafe.com/",
    "blurb": "The world's most famous motor café, where petrol-fumed heritage meets rock 'n' roll nights, ride-outs, and rebellious spirit since 1938.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "ActOne Cinema",
    "location": "Acton",
    "moods": [
      "thoughtful",
      "nostalgic"
    ],
    "genres": [
      "independent film",
      "mainstream"
    ],
    "url": "https://actonecinema.co.uk",
    "blurb": "A community-run cinema in a former library, co-run by Rio Cinema, championing independent films and filmmaker events.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "After-Work Foraging Sessions - Charlotte Gordon Urban Forager",
    "location": "The Story Garden, King's Cross",
    "moods": [
      "curious",
      "wild",
      "urban explorer"
    ],
    "genres": [
      "foraging",
      "plant identification"
    ],
    "url": "https://www.charlottegordonforager.com/events",
    "blurb": "Beneath King's Cross's glass towers, The Story Garden blooms in quiet rebellion. Charlotte Gordon guides dusk-hour wanderers through herbs, edible weeds, and fragrant finds. These twilight sessions are more than botanical lessons - they're a return to knowing what grows beneath your feet, even in the heart of the city.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Akila Pole Studio",
    "location": "Brixton",
    "moods": [
      "empowering",
      "community-focused",
      "expressive"
    ],
    "genres": [
      "pole dance",
      "spin",
      "choreography"
    ],
    "url": "https://www.akilapolestudio.com/",
    "blurb": "In Brixton's warm-lit studio, poles become partners in flight and strength. Akila Pole Studio welcomes every body - each spin a reclaiming, each climb a celebration. This isn't performance for others, but presence for the self. Here, sensuality is carved in sweat and joy, held in community arms.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Arcadia Games",
    "location": "The Strand",
    "moods": [
      "collaborative",
      "story-rich",
      "inclusive"
    ],
    "genres": [
      "Dungeons & Dragons",
      "indie TTRPGs",
      "Blood on the Clocktower",
      "coworking"
    ],
    "url": "https://www.arcadiagames.co.uk/",
    "blurb": "By day, a coworking space for laptop warriors. By night, a realm of hosted campaigns and skilled Games Masters. Arcadia — founded and run by women — offers sound-proofed rooms, themed tables, and a Safety Charter that centers neurodiversity and consent. Here, the dice are kind and the storytelling fierce. A haven for London's tabletop faithful, where D&D is sacrament and community is code.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Art Play London - Paper-Making Craft Class",
    "location": "Shoreditch",
    "moods": [
      "craft & making",
      "nostalgic"
    ],
    "genres": [
      "papermaking",
      "recycling",
      "botanical embellishment"
    ],
    "url": "https://artplaylondon.com",
    "blurb": "At Art Play London, torn pages and yesterday's stories find new life. In studios scented with dried lavender and pulp, hands plunge into petals and pigments. Paper is born anew - rough-edged, flower-flecked, tender as memory. It's recycling as ritual, the alchemy of old into beauty again.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "ArtHouse Crouch End",
    "location": "Crouch End",
    "moods": [
      "curious",
      "playful"
    ],
    "genres": [
      "film",
      "live music",
      "theatre"
    ],
    "url": "https://www.arthousecrouchend.co.uk",
    "blurb": "A former Salvation Army hall mixing film, fine art, live music, and theatre, tearing down perceived walls between genres to celebrate diversity.",
    "last_verified": "2025-11-17"
  },
  {
    "name": "artsdepot",
    "location": "Finchley",
    "moods": [
      "tender",
      "curious"
    ],
    "genres": [
      "exhibitions",
      "community classes",
      "theatre"
    ],
    "url": "https://www.artsdepot.co.uk/",
    "last_verified": "2025-11-17",
    "blurb": "Tucked into the heart of Finchley, artsdepot is a gentle gathering ground where theatre, art, and community meet under one wide roof. You might wander through a sunlit gallery, stumble upon a local choir in rehearsal, or settle into a show that stirs thought more than spectacle. It's a place that welcomes all kinds — the quiet observer, the curious learner, the after-school dreamer. A soft landing for North London souls seeking creativity without pretence."
  },
  {
    "name": "Asylum Chapel",
    "location": "Peckham",
    "moods": [
      "melancholy",
      "candlelit",
      "sacred"
    ],
    "genres": [
      "private hire",
      "events",
      "weddings"
    ],
    "url": "https://asylumchapel.co.uk/",
    "notes": "Primarily private hire, not regular public events",
    "last_verified": "2025-11-17",
    "blurb": "Once a bombed-out sanctuary, now a sacred shell of stone and light — Asylum Chapel holds a rare, melancholic beauty. Cracked walls and stained glass catch candlelight like memory, casting a hush over weddings, vigils, and intimate events. It isn't a space that performs; it listens. Ideal for those seeking a setting not just atmospheric, but aching — where the veil thins, and time lingers in the silence."
  },
  {
    "name": "Authentic Movement Workshops – Katsura Isobe",
    "location": "Chisenhale Dance Space",
    "moods": [
      "introspective",
      "witnessed"
    ],
    "genres": [
      "authentic movement",
      "somatic",
      "writing"
    ],
    "url": "https://katsuraisobe.net/workshops/authentic-movement/",
    "blurb": "Held in sacred silence, these workshops are a devotion to the unseen. One body moves, eyes closed; another witnesses, holding space like still water. After, marks are made on paper — the echo of movement, felt and remembered. It is not therapy, but something older, something soft and bone-deep.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Autograph",
    "location": "Rivington Place",
    "moods": [
      "activist",
      "awe",
      "global"
    ],
    "genres": [
      "photography",
      "identity",
      "social justice"
    ],
    "url": "https://autograph.org.uk",
    "last_verified": "2025-11-17",
    "blurb": "At Rivington Place, Autograph curates photography that doesn't just speak — it challenges, honours, and remembers. Centring global histories of identity, resistance, and belonging, the exhibitions here illuminate lives too often marginalised, with a lens that is both tender and unflinching. Come if you're seeking art as reckoning, as mirror, as invocation. This is a space where stories rise into light and stay."
  },
  {
    "name": "Bad Moon Café",
    "location": "Elephant & Castle",
    "moods": [
      "tactical",
      "nerdy",
      "inclusive"
    ],
    "genres": [
      "Warhammer",
      "miniature wargaming",
      "board games",
      "TTRPG"
    ],
    "url": "https://www.badmooncafe.co.uk/",
    "blurb": "Wargaming wonderlands carved from foam and fire — this café sculpts epic from every skirmish, serving strategy with a shot of espresso and the scent of fresh terrain.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Battersea Arts Centre",
    "location": "Battersea",
    "moods": [
      "curious",
      "playful"
    ],
    "genres": [
      "experimental theatre",
      "boundary-pushing"
    ],
    "url": "https://bac.org.uk",
    "blurb": "The go-to place for boundary-pushing theatre, harnessing art and collective imagination to build a more inclusive, sustainable future.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "BAW Dance",
    "location": "Farringdon",
    "moods": [
      "playful",
      "supportive",
      "community-centred"
    ],
    "genres": [
      "burlesque",
      "belly dance",
      "heels floorwork"
    ],
    "url": "https://www.bawdance.com/book-online",
    "blurb": "In mirrored rooms across the city, hips sway and laughter spills. BAW Dance welcomes women and non-binary folk to twirl, shimmy, and ground themselves in sensual joy. With floorwork, belly dance, and burlesque, it's a gathering of softness and strength - movement as reclamation, community, and play.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Bernie Grant Arts Centre",
    "location": "Tottenham",
    "moods": [
      "rebellious",
      "ritual"
    ],
    "genres": [
      "Black-led arts",
      "theatre",
      "dance",
      "visual arts"
    ],
    "url": "https://www.berniegrantcentre.co.uk",
    "blurb": "A Black, female, and queer-led multi-artform venue giving Black-led work space and status to thrive, committed to intersectional practice and community engagement.",
    "last_verified": "2025-11-17"
  },
  {
    "name": "Bethnal Green Working Men's Club",
    "location": "Bethnal Green",
    "moods": [
      "rebellious",
      "queer"
    ],
    "genres": [
      "cabaret",
      "drag",
      "dance"
    ],
    "url": "https://www.workersplaytime.net",
    "blurb": "An East End institution hosting wild, unhinged nights from racy cabaret to drag shows, a vital community hub with a safe-space policy.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Bill Murray",
    "location": "Islington",
    "moods": [
      "comic",
      "playful"
    ],
    "genres": [
      "stand-up comedy"
    ],
    "url": "https://www.angelcomedy.co.uk/our-venues/the-bill-murray/",
    "last_verified": "2025-11-17",
    "blurb": "A beloved misfit of the Islington comedy scene, The Bill Murray is part pub, part playground for the sharp, the strange, and the up-too-late. Run by Angel Comedy, it hosts everything from chaotic work-in-progress nights to polished stand-up with cult favourites. Expect sweat, snorts, and the occasional existential crisis with your pint. For the petal who likes their laughter with a side of weird."
  },
  {
    "name": "Blue Elephant Theatre",
    "location": "Camberwell",
    "moods": [
      "curious",
      "playful",
      "poetic"
    ],
    "genres": [
      "physical theatre",
      "dance",
      "new writing"
    ],
    "url": "https://blueelephanttheatre.co.uk",
    "blurb": "A quirky oasis nurturing experimental work and emerging artists, where movement and story intertwine in intimate, risk-taking performances.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Blythe Hill Tavern",
    "location": "Catford",
    "moods": [
      "folk",
      "tender"
    ],
    "genres": [
      "Irish music",
      "folk"
    ],
    "url": "https://www.blythehilltavern.org.uk",
    "blurb": "A CAMRA award-winning Victorian corner pub where Thursday nights bloom with traditional Irish music, roaring fires, and real ale.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Body Love Sketch Club",
    "location": "New Cross",
    "moods": [
      "gentle",
      "celebratory",
      "inclusive",
      "playful"
    ],
    "genres": [
      "life drawing",
      "figure drawing",
      "body painting"
    ],
    "url": "https://www.bodylovesketchclub.com/",
    "blurb": "At Body Love Sketch Club, bodies bloom across paper like laughter - bold, soft, joyful. In a room where every curve is sacred and consent is the cornerstone, you can pose or draw, clothed or not, free of shame. It's life drawing as liberation - with glitter, wit, and warmth.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Boneyard London - Introduction to Blacksmithing",
    "location": "Tottenham",
    "moods": [
      "rustic",
      "adventurous"
    ],
    "genres": [
      "introductory forging"
    ],
    "url": "https://boneyardlondon.com",
    "blurb": "The forge flares in Tottenham Hale, where steel sings under the hammer's rhythm. At Boneyard, beginners are guided through sparks and soot to forge hooks and bottle openers with their own heat and hands. This is metal as muscle, fire as teacher - a raw, glorious introduction to the craft.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "BookBar",
    "location": "Highbury",
    "moods": [
      "convivial",
      "literary",
      "sociable"
    ],
    "genres": [
      "author talks",
      "salons",
      "book-club nights",
      "singalongs"
    ],
    "url": "bookbaruk.com/events",
    "blurb": "BookBar is where books flirt and glasses clink. Shelves curve into laughter, and authors share stories like secrets over red wine. From Read Dating to festive salons, each event feels like a literary soirée where strangers become plot twists in each other's tales. Come for the prose, stay for the conversation that spills into night.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "BrewBox London - Home Brewing Workshop",
    "location": "Walthamstow (E17)",
    "moods": [
      "craft & making",
      "curious",
      "community"
    ],
    "genres": [
      "beer",
      "homebrewing"
    ],
    "url": "https://brewbox.london/pages/workshops",
    "blurb": "Tucked in Walthamstow's backstreets, BrewBox brews more than beer - it brews kinship. In this homebrewing workshop, malt and mash become metaphors, hops are history, and every bottle carries a whisper of the brewer's hands. It's science stirred with folklore, and a fizz of belonging you won't find on supermarket shelves.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "BrewDog Outpost Tower Hill - Beer School",
    "location": "Tower Hill (EC3)",
    "moods": [
      "epicurean",
      "curious",
      "adult play"
    ],
    "genres": [
      "beer",
      "craft brewing"
    ],
    "url": "https://www.brewdog.com/uk/locations/outpost-tower-hill",
    "blurb": "In the heart of Tower Hill, beneath the glint of steel and stone, BrewDog's Outpost opens its doors to seekers of hops and stories. Beer School here is no dry lecture - it's frothy lore, malty memory, and the quiet thrill of brewing science shared over pints and laughter. Come for the learning, stay for the layered pours and rising cheer.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Brompton Bats - Twilight Bat Survey Walk",
    "location": "Kensington",
    "moods": [
      "night wanderer",
      "wild",
      "curious"
    ],
    "genres": [
      "bat walk",
      "cemetery tour",
      "nature survey"
    ],
    "url": "https://www.royalparks.org.uk/whats-on/brompton-bats-surveying-walk-autumn-Sept-2025",
    "blurb": "As dusk folds into the stone paths of Brompton Cemetery, the air pricks with inaudible echoes. Bat detectors pulse with hidden life as pipistrelles swoop between headstones. The living and the long-gone share space here - beneath yew, under stars - in this quiet communion of wing and watch.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Brutalist Tour - Evening Architectural Walk (Architectour Guide)",
    "location": "Hampstead",
    "moods": [
      "urban explorer",
      "curious",
      "night wanderer"
    ],
    "genres": [
      "brutalist architecture walk"
    ],
    "url": "https://architectourguide.com/products/brutalist-tour",
    "blurb": "Concrete glows beneath amber streetlight on this moody meander through London's Brutalist bones. From the monolith of the National Theatre to Trellick Tower's proud defiance, this tour speaks in right angles and raw material. It's a pilgrimage for lovers of line and shadow, of honesty and heft.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Bush Hall",
    "location": "Shepherd's Bush",
    "moods": [
      "nostalgic",
      "awe",
      "ecstatic"
    ],
    "genres": [
      "indie music",
      "comedy",
      "cabaret"
    ],
    "url": "https://bushhallmusic.co.uk/",
    "blurb": "A restored Edwardian ballroom where chandeliers still remember 1904, hosting rising musicians and comedians beneath high ceilings that make every note linger.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Bush Theatre",
    "location": "Shepherd's Bush",
    "moods": [
      "rant",
      "rebellious",
      "activist"
    ],
    "genres": [
      "new plays",
      "emerging playwrights"
    ],
    "url": "https://www.bushtheatre.co.uk/",
    "blurb": "An internationally renowned champion of playwrights, where new writing crackles with activist spirit and salon-style conversation.",
    "last_verified": "2025-11-15",
    "features": [
      "salon"
    ]
  },
  {
    "name": "Café OTO",
    "location": "Dalston (Hackney)",
    "moods": [
      "avant-garde",
      "intimate",
      "listening"
    ],
    "genres": [
      "free-jazz",
      "improvisation",
      "experimental sound",
      "world music"
    ],
    "url": "https://cafeoto.co.uk",
    "blurb": "Café OTO lives in the pause between one note and the next. A soft-lit refuge for the sonically strange, it offers sanctuary to sounds no one else dares cradle — free-jazz, drone, improvised everything. You might sip tea in a hush of reverence, or share glances over dark beer and starlit discord. Dalston's breath grows quiet here, listening.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Camden Art Centre - Natural Dyes Workshop",
    "location": "271 Dale Avenue, London NW3 6DG",
    "moods": [
      "craft & making",
      "sustainable"
    ],
    "genres": [
      "natural dyeing using kitchen waste",
      "plant dye extraction"
    ],
    "url": "https://camdenartscentre.org",
    "blurb": "In a sunlit room above Camden, onion skins and tea leaves bloom into colour. Guided by the gentle hand of the artist, this workshop leads you into the alchemy of kitchen waste turned into wearable art. It's the slow science of hue, a celebration of compost and cotton and care.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Camden People's Theatre",
    "location": "Camden",
    "moods": [
      "curious",
      "rebellious"
    ],
    "genres": [
      "contemporary performance",
      "emerging artists"
    ],
    "url": "https://cptheatre.co.uk/",
    "blurb": "A small, independent venue championing emerging artists and boundary-pushing contemporary performance, making space for tomorrow's theatre-makers.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Cecil Sharp House",
    "location": "Camden",
    "moods": [
      "folk",
      "tender"
    ],
    "genres": [
      "folk music",
      "folk dance"
    ],
    "url": "https://www.efdss.org/",
    "blurb": "The world-class folk arts centre, home to the English Folk Dance and Song Society, championing folk heritage since 1930.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Chats Palace",
    "location": "Homerton (Hackney)",
    "moods": [
      "inclusive",
      "radical",
      "celebratory"
    ],
    "genres": [
      "music",
      "cabaret",
      "drag",
      "folk",
      "community festivals"
    ],
    "url": "chatspalace.com",
    "blurb": "In the bones of an old library, revolution still hums. Chats Palace is where East London gathers to dance, dream, and defy. Drag cabaret collides with Balkan brass, children twirl at matinees, and the ghosts of squatters smile from the balcony. The bar spills onto a terrace lit with laughter. This isn't just a venue — it's a living archive of joy.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Chickenshed Theatre",
    "location": "Southgate",
    "moods": [
      "activist",
      "tender",
      "community"
    ],
    "genres": [
      "inclusive theatre",
      "community productions"
    ],
    "url": "https://www.chickenshed.org.uk",
    "last_verified": "2025-11-17",
    "blurb": "At Chickenshed, inclusion isn't a tagline — it's the beating heart. This Southgate theatre creates work with and for people of all backgrounds and abilities, offering community-driven productions that are raw, joyful, and fiercely human. Whether it's a children's show or a full-scale musical, every performance pulses with purpose. Come if you believe theatre should belong to everyone."
  },
  {
    "name": "Circle of Trees – Environmental Arts Therapy UK",
    "location": "Queens Wood, Highgate",
    "moods": [
      "ritual",
      "wild"
    ],
    "genres": [
      "environmental arts therapy",
      "nature connection"
    ],
    "url": "https://www.environmentalartstherapyuk.co.uk/",
    "blurb": "Out in the woods, beneath ash and elder, circles form. Here the land becomes your mirror. With rituals, seasonal rites, and deep imaginal play, you're invited to meet yourself through tree, stone, and story. A wild, grounded space for healing in kinship with the more-than-human world.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "CLF Art Café",
    "location": "Peckham",
    "moods": [
      "ecstatic",
      "wild"
    ],
    "genres": [
      "house",
      "electro",
      "drum & bass",
      "techno",
      "funk",
      "soul"
    ],
    "url": "https://www.clfartcafe.org",
    "blurb": "A multi-floor creative arts centre hosting everything from Bestival parties to South London Soul Train, spanning house, funk, jazz, and beyond.",
    "last_verified": "2025-11-17"
  },
  {
    "name": "CLF Art Lounge & Pop-Up",
    "location": "Peckham (Southwark)",
    "moods": [
      "tropical",
      "improvised",
      "community-minded"
    ],
    "genres": [
      "funk",
      "soul",
      "DJ sessions",
      "live bands",
      "open-mic jams"
    ],
    "url": "clfartlounge.com/event‑list",
    "blurb": "CLF is a pulse in human form — improvising, adapting, always playing. In its pop-up incarnation, the Lounge still throws the best kind of chaos: DJ decks spun till midnight, Latin bands blazing on a weeknight, and open mic nights where poets and drummers share the same stage. It smells like citrus and sweat. It tastes like rhythm.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "CLF Art Lounge & Roof Garden",
    "location": "Peckham",
    "moods": [
      "curious",
      "playful"
    ],
    "genres": [
      "jazz",
      "spoken word",
      "comedy",
      "film"
    ],
    "url": "https://www.clfartlounge.com",
    "blurb": "A rooftop dreamscape above Peckham, where jazz floats through the night air and the city unfolds beneath fairy lights.",
    "notes": "Currently running ground-floor pop-up while roof garden renovates (reopening spring 2026)",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Colour Factory",
    "location": "Hackney Wick",
    "moods": [
      "big night out",
      "queer",
      "rebellious"
    ],
    "genres": [
      "club nights",
      "live music"
    ],
    "url": "https://colourfactory.com",
    "last_verified": "2025-11-17",
    "blurb": "Tucked in a Hackney Wick warehouse, Colour Factory throws the kind of nights you'll feel in your chest for days. Queer-led and bass-heavy, it's a home for dancefloor communion — whether under strobes or sky. Expect genre-bending live acts, all-night club sets, and a crowd that knows how to move. Come for the rebellion, stay for the release."
  },
  {
    "name": "Colour House Theatre",
    "location": "Merton",
    "moods": [
      "family-friendly",
      "playful"
    ],
    "genres": [
      "children's theatre",
      "blues"
    ],
    "url": "https://www.colourhouseblues.co.uk/",
    "blurb": "A Grade II-listed building hosting weekend children's shows and monthly blues club nights, a small-scale community arts hub.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Conway Hall",
    "location": "Holborn",
    "moods": [
      "word",
      "sacred"
    ],
    "genres": [
      "talks",
      "concerts",
      "courses"
    ],
    "url": "https://conwayhall.org.uk",
    "blurb": "A Grade II listed hall from 1929 housing the largest humanist research library, curating talks and concerts promoting ethical living.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Cordon Bleu London - Culinary Short Courses",
    "location": "Marylebone (W1)",
    "moods": [
      "craft & making",
      "epicurean",
      "refined"
    ],
    "genres": [
      "cooking",
      "pastry",
      "culinary skills"
    ],
    "url": "https://www.cordonbleu.edu/london/short-courses/en",
    "blurb": "In a historic townhouse off Marylebone Lane, Cordon Bleu's short courses unfold with ceremony and steel. Here, the chop of blade and hush of butter on heat are acts of reverence. Classic sauces, delicate pastries, French precision - it's culinary ballet in white coats and quiet fire. For those who hunger not just to eat, but to *know*.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Corner New Cross",
    "location": "New Cross",
    "moods": [
      "queer",
      "playful"
    ],
    "genres": [
      "coffee",
      "art gallery",
      "cocktails"
    ],
    "url": "https://www.cornernewcross.com/",
    "blurb": "An LGBTQIA+-led neighbourhood coffee shop, cocktail bar, and art gallery where inclusive ethos meets rotating artwork and community warmth.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Cubitt Artists",
    "location": "Islington (Angel Mews)",
    "moods": [
      "experimental",
      "community-driven",
      "queer-affirming"
    ],
    "genres": [
      "contemporary art",
      "book launches",
      "discussions",
      "printmaking"
    ],
    "url": "cubittartists.org.uk",
    "blurb": "Cubitt is a stitched-together constellation — studios, gallery, gathering ground. Here, artists teach each other how to live. Zines are made beside prints, queer anthologies are launched with reverence, and every wall is a question. It is both quiet and defiant, tender and revolutionary. Art here is less object than encounter — a shared breath in Angel Mews.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Culinary Anthropologist - Charcuterie Masterclass",
    "location": "Highbury (N5)",
    "moods": [
      "craft & making",
      "epicurean",
      "curious"
    ],
    "genres": [
      "charcuterie",
      "butchery"
    ],
    "url": "https://www.culinaryanthropologist.org/classes/charcuterie-masterclass/",
    "blurb": "In a North London kitchen kissed by spice and study, the Culinary Anthropologist teaches preservation like poetry. Pork becomes prosciutto, time is measured in cure and air, and salt holds centuries of secrets. This is meatcraft as memoir, a masterclass in transformation, where knife and knowledge meet with reverence.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Dino Snores for Grown Ups - Natural History Museum Sleepover",
    "location": "Kensington",
    "moods": [
      "night wanderer",
      "curious",
      "playful"
    ],
    "genres": [
      "museum sleepover",
      "dark experience"
    ],
    "url": "https://www.nhm.ac.uk/events/dino-snores-for-grown-ups.html",
    "blurb": "The whale looms above your sleeping bag, vast and serene. At Dino Snores, adults take over the museum: dinner beneath dinosaur bones, science shows, silent disco, a movie marathon, and sleep among ancient beasts. The building hushes at midnight, and in that hush - wonder stirs.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Draughts – Board Game Café",
    "location": "Hackney",
    "moods": [
      "playful",
      "welcoming",
      "strategic"
    ],
    "genres": [
      "board games",
      "community",
      "analogue"
    ],
    "url": "https://www.draughtslondon.com/",
    "blurb": "A game-slick hideaway where minds meet over meeples and the candlelight of strategy. From the roar of Waterloo to Hackney's hum, the tables are alive with laughter, rules, and rebellion.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Dusty Knuckle Bakery - Fermentation Workshop",
    "location": "Dalston",
    "moods": [
      "craft & making",
      "curious",
      "adult play"
    ],
    "genres": [
      "fermentation",
      "kimchi",
      "sauerkraut",
      "pickles"
    ],
    "url": "https://www.eventbrite.co.uk/e/fermentation-workshop-tickets-1111627410509",
    "blurb": "Dalston's Dusty Knuckle, all flour-dust and firelight, opens its arms to the fermentation faithful. Here, Clare teaches the old art with modern laughter - kimchi that kicks, lemons softened by salt, jars cradled like secrets. Bread is broken, beers are poured, and the sour tang of learning lingers sweetly on the tongue. A place where bacteria bloom and strangers bond.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "EartH",
    "location": "Dalston",
    "moods": [
      "ecstatic",
      "curious"
    ],
    "genres": [
      "experimental",
      "cutting-edge"
    ],
    "url": "https://earthackney.co.uk",
    "blurb": "A refurbished 1930s cinema with three spaces hosting eclectic, vibrant programming from leading and emerging artists.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "East London Strippers Collective Life Drawing",
    "location": "Shoreditch",
    "moods": [
      "rebellious",
      "celebratory",
      "destigmatising"
    ],
    "genres": [
      "life drawing",
      "pole art",
      "erotic art"
    ],
    "url": "https://www.outsavvy.com/event/29977/life-drawing-with-the-east-london-strippers-collective",
    "blurb": "Here, the pole is both pedestal and paintbrush. Strippers pose in motion, limbs inked in shadow and steel. You sketch with reverence and riot alike - celebrating sex work as art, as performance, as power. The East London Strippers Collective turns life drawing into a love letter to autonomy.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Eco-Somatic Movement Workshops – Katsura Isobe",
    "location": "Chisenhale Dance Space",
    "moods": [
      "seasonal",
      "earthy"
    ],
    "genres": [
      "eco-somatic",
      "movement",
      "ritual"
    ],
    "url": "https://katsuraisobe.net/workshops/ecosomatic-movement/",
    "blurb": "This is movement born of leaf and sky. Guided by the cycles of the land, these sessions weave body, breath, and season. You'll stretch like willow, root like oak, listen like rain. Eco-somatics here is not performance — it's a quiet returning to the wisdom beneath your skin.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Ecstatic Dance London - The Ritual",
    "location": "Various London venues (often community halls and studios)",
    "moods": [
      "ecstatic",
      "spiritual",
      "connected",
      "transformative"
    ],
    "genres": [
      "ecstatic dance",
      "tantric trance",
      "conscious connections"
    ],
    "url": "https://www.eventbrite.co.uk/e/the-ritual-tantric-trance-dance-conscious-connections-ecstatic-dance-tickets-1835087669619",
    "blurb": "No talking. No shoes. No spectators. The Ritual is a full-day immersion where cacao kisses lips, rhythms unspool into trance, and touch is offered with reverence. Held with sacred clarity, this is dance as prayer, as truth, as freedom - a sanctuary for the raw, the open, the becoming.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Ecstatic Dance UK - Sunday Sessions",
    "location": "Hackney Wick",
    "moods": [
      "mindful",
      "inclusive"
    ],
    "genres": [
      "ecstatic dance",
      "conscious dance",
      "cacao ceremony"
    ],
    "url": "https://ecstaticdance.org/dance/ecstatic-dance-uk/",
    "blurb": "Sunday mornings stretch open at The Baths, where cacao warms the heart and silence wraps the dance floor. No talking. No judgement. Just bodies in motion, following rhythm like a river. Here, movement is medicine and joy is sacred - a weekly breath for the spirit through beat and stillness.",
    "last_verified": "2025-11-23",
    "features": [
      "free-spirited"
    ]
  },
  {
    "name": "Ecstatic Dance UK – Sun·day Dance",
    "location": "Hackney Wick",
    "moods": [
      "liberated",
      "grounded"
    ],
    "genres": [
      "ecstatic dance",
      "conscious movement"
    ],
    "url": "https://ecstaticdance.org/dance/ecstatic-dance-uk/",
    "blurb": "Barefoot, boundless, and bathed in bass. This isn't clubbing — it's communion. Held in a West London dance sanctuary, these Sunday mornings move from stillness to sweat to surrender. You'll find yourself in the music — raw, luminous, unshamed — moving in a field of joy and deep collective rhythm.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Finborough Theatre",
    "location": "Earl's Court",
    "moods": [
      "curious",
      "activist"
    ],
    "genres": [
      "new writing",
      "rediscovered works"
    ],
    "url": "https://finboroughtheatre.co.uk/",
    "blurb": "A pocket-sized powerhouse above a pub, presenting thought-provoking new writing and neglected masterpieces in a fiercely intimate 50-seat space.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Forage London - Wild Food & Nature Walk (Tower Hamlets Cemetery Park)",
    "location": "Tower Hamlets",
    "moods": [
      "wild",
      "curious",
      "urban explorer"
    ],
    "genres": [
      "foraging",
      "plant identification",
      "cemetery tour"
    ],
    "url": "https://www.foragelondon.co.uk/events/tower-hamlets-cemetery-park-dec-2025",
    "blurb": "In the hush of a Victorian cemetery, nettles and mushrooms reclaim the ground with quiet confidence. Led by forager Ken Greenway, this walk teaches the secrets of wild plants that hide in plain sight. Past ivy-draped headstones, you'll meet flavours, folklore, and a green magic thriving among the gravestones.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Forage London - Wild Food and Nature Walk (E3)",
    "location": "Tower Hamlets",
    "moods": [
      "curious",
      "nature-connected",
      "craft & making"
    ],
    "genres": [
      "foraging",
      "urban wild foods"
    ],
    "url": "https://foragelondon.co.uk",
    "blurb": "In the hush of Tower Hamlets Cemetery Park, nature reclaims her place with soft insistence. Here, with Ken Greenway as guide, ivy tangles with knowledge and nettles become teachers. You'll taste the city's wild fringe: bitter leaves, fragrant blooms, mushrooms like secrets. Each step is a slow remembering - of hunger, of belonging, of the green abundance beneath the grit.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Four Quarters",
    "location": "Hackney Wick",
    "moods": [
      "nostalgic",
      "social"
    ],
    "genres": [
      "retro arcade",
      "multiplayer",
      "console",
      "cocktail bar"
    ],
    "url": "https://www.fourquarters.bar/",
    "blurb": "Arcade alchemy in three boroughs — where laughter loops through coin-drop echoes, and the neon hum of nostalgia sings beneath every pint.",
    "last_verified": "2025-11-23",
    "features": [
      "boozy"
    ]
  },
  {
    "name": "Fox & Firkin",
    "location": "Lewisham",
    "moods": [
      "rebellious",
      "playful",
      "wild",
      "earthy"
    ],
    "genres": [
      "reggae",
      "jazz",
      "rock",
      "DJ sets"
    ],
    "url": "https://foxfirkin.com",
    "blurb": "A sprawling garden hides a restored 1950s train carriage and stages for outdoor revelry, where live music pulses and the night stretches wild.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Freeweaver Studio",
    "location": "Cordwainers Pop-Up, London Fields (E8)",
    "moods": [
      "meditative",
      "curious"
    ],
    "genres": [
      "creative weaving",
      "Japanese floor loom weaving",
      "sustainable materials"
    ],
    "url": "https://freeweaver.co.uk",
    "blurb": "A quiet reverence weaves through Freeweaver Studio. Nestled in London Fields, looms stand ready for thread to sing its slow song. Japanese tools, soft yarns, and deep silence make each session feel like a temple of motion. The weave becomes thought, the shuttle a brush of calm across the loom.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Friends of Nunhead Cemetery - Guided Tours & Bat Sighting Walks",
    "location": "Nunhead",
    "moods": [
      "haunted",
      "wild"
    ],
    "genres": [
      "cemetery tour",
      "bat walk"
    ],
    "url": "https://www.fonc.org.uk/events",
    "blurb": "The ivy knows these names. At Nunhead, the cemetery breathes history and woodland both. By sunset, bats arc above Victorian crypts, their shadows mingling with that of ancient grief. These volunteer-led walks are full of memory and mystery - a perfect pairing of nature's wild return and the city's silent past.",
    "last_verified": "2025-11-23",
    "features": [
      "historical"
    ]
  },
  {
    "name": "Gate Theatre",
    "location": "Camden",
    "moods": [
      "global",
      "curious"
    ],
    "genres": [
      "international theatre",
      "new voices"
    ],
    "url": "https://www.gatetheatre.co.uk/",
    "blurb": "New voices telling international stories, bringing world-changing theatre to London from a Camden base that champions bold, boundary-crossing work.",
    "notes": "Moved from Notting Hill to Camden in July 2022",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Gather Glass - Glassblowing Classes",
    "location": "Woolwich",
    "moods": [
      "fiery",
      "mesmerising"
    ],
    "genres": [
      "bauble blowing",
      "tumbler making",
      "half-day and full-day glassblowing"
    ],
    "url": "https://gather.glass",
    "blurb": "The heat of the furnace draws you in at Gather Glass, where breath and flame shape molten beauty. Blow your own bauble, twist a tumbler into being, or spend the day dancing with fire. This is glass not as ornament but as transformation - glowing, spinning, alive in your hands.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Genesis Cinema",
    "location": "Bethnal Green",
    "moods": [
      "playful",
      "wild"
    ],
    "genres": [
      "indie film",
      "horror marathons",
      "cult classics"
    ],
    "url": "https://www.genesiscinema.co.uk",
    "blurb": "A community-focused cultural hub offering horror marathons, kung-fu nights, feminist zine gatherings, and cult classics on comfy sofas with cocktails.",
    "last_verified": "2025-11-17"
  },
  {
    "name": "George IV Boston Room",
    "location": "Chiswick",
    "moods": [
      "nostalgic",
      "poetic"
    ],
    "genres": [
      "jazz"
    ],
    "url": "https://www.chiswickcalendar.co.uk/george-iv-pub/",
    "blurb": "Monthly jazz nights in an intimate pub room, where high-calibre musicians and regulars gather for Trio Manouche and Jazz Mondays.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Ghosts of the Old City - Eldritch, Tenebrous London (London Walks)",
    "location": "City of London",
    "moods": [
      "night wanderer",
      "haunted",
      "curious"
    ],
    "genres": [
      "ghost walk",
      "historical night walk"
    ],
    "url": "https://www.walks.com/walks/ghosts-of-the-old-city/",
    "blurb": "Beneath the hum of modern London, shadows curl through alleyways and stories breathe behind the stones. Guided by actors under lamplight, this walk slips through plague pits and lost courtyards, tracing the haunted spine of the Old City. Every whispered tale leaves the air a little colder, the night a little deeper.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Gia Como - Bespoke Candle Making Workshop",
    "location": "Shoreditch",
    "moods": [
      "creative",
      "aromatic"
    ],
    "genres": [
      "scent blending",
      "soy-wax candle making"
    ],
    "url": "https://www.craftcourses.com/courses/candle-making-workshop-create-your-own-signature-scent-with-gia-como",
    "blurb": "In a fragrant pocket of Shoreditch, Gia Como lights the wick of your imagination. Blend essential oils into something uniquely yours, pour slow wax into glass, and christen your creation with a name that lingers. Each flame becomes a fingerprint - a quiet glow with your story inside.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Graeae Theatre Company",
    "location": "Dalston",
    "moods": [
      "activist",
      "voice",
      "movement"
    ],
    "genres": [
      "Deaf and disabled-led theatre"
    ],
    "url": "https://graeae.org",
    "notes": "Active company, but no public performances scheduled for late 2025 at time of verification",
    "last_verified": "2025-11-17",
    "blurb": "Graeae doesn't just put disabled artists on stage — it reshapes the stage itself. Based in Dalston, this pioneering company leads with access, defiance, and undeniable artistry. Their productions are bold in form, rich in movement, and unapologetically political, often integrating BSL, captioning, and audio description as core elements of the work. For those who believe theatre should break barriers, not build them."
  },
  {
    "name": "Grand Junction Arms",
    "location": "North West London",
    "moods": [
      "seasonal",
      "group energy"
    ],
    "genres": [
      "pub events"
    ],
    "url": "https://www.grandjunctionarmsnw10.co.uk",
    "blurb": "A vibrant canal-side pub claiming the biggest beer garden in north London, with seasonal menus and a busy events calendar.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Grimoire Crafting with Hallowed Hollow",
    "location": "South East London",
    "moods": [
      "craft-based",
      "esoteric",
      "personal"
    ],
    "genres": [
      "grimoire making",
      "bookbinding",
      "magical record-keeping"
    ],
    "url": "https://hallowedhollow.com/grimoire",
    "blurb": "In a quiet studio, parchment meets purpose. Hallowed Hollow's grimoire workshops invite you to bind your magic by hand - stitching leather, ink, and lore into something wholly yours. It's not just a book. It's a spell held in pages.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Grove Farm Bat Walk - Ealing Wildlife Group",
    "location": "Grove Farm Nature Reserve, Sudbury Hill (meeting point outside Sudbury Hill Tube)",
    "moods": [
      "night wanderer",
      "wild",
      "curious"
    ],
    "genres": [
      "bat walk",
      "nature walk"
    ],
    "url": "https://www.ealingwildlifegroup.com/post/grove-farm-bat-walk-2025",
    "blurb": "Far from the lights of the high street, Grove Farm breathes with quiet wildness. On this twilight walk, bats flicker like shadows between trees, their calls turned audible through detector magic. A torchlight glances off wings, a hush falls, and for a moment, you are entirely within the dusk.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Hackney Empire",
    "location": "Hackney",
    "moods": [
      "nostalgic",
      "wonder"
    ],
    "genres": [
      "variety",
      "comedy",
      "opera",
      "hip-hop theatre"
    ],
    "url": "https://hackneyempire.co.uk/",
    "blurb": "A historic variety theatre from 1901 with ornate Victorian architecture, leading eclectic programming from stand-up to opera.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Hackney Herbal - Herbal Wellbeing Masterclasses & Remedies Workshops",
    "location": "Hackney",
    "moods": [
      "gentle",
      "botanical"
    ],
    "genres": [
      "lip-balm making",
      "herbal teabags",
      "aromatherapy sprays",
      "warming hand/body oils"
    ],
    "url": "https://www.hackneyherbal.com",
    "blurb": "In the plant-laced quiet of Well Street, Hackney Herbal tends the body and spirit alike. Calendula blooms in oil, lip balms stir with lavender, and sprays carry calm in each mist. These sessions are as soft as they are skilled - herbalism not just taught, but lived, gently and well.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Half Moon Theatre",
    "location": "Limehouse",
    "moods": [
      "family-friendly",
      "tender",
      "thoughtful"
    ],
    "genres": [
      "children's theatre",
      "youth programmes"
    ],
    "url": "https://halfmoon.org.uk",
    "last_verified": "2025-11-17",
    "blurb": "In Limehouse, Half Moon crafts theatre that meets young audiences with care and imagination. Specialising in work for babies through to teens, their shows are thoughtful without condescension — often poetic, always rooted in respect. Beyond the stage, their youth programmes nurture voices still finding their shape. A place where stories grow alongside the children who hear them."
  },
  {
    "name": "Hampstead Observatory Public Nights",
    "location": "Hampstead",
    "moods": [
      "night wanderer",
      "curious",
      "dark sky"
    ],
    "genres": [
      "astronomy walk",
      "stargazing"
    ],
    "url": "https://gostargazing.co.uk/venues/hampstead-observatory/",
    "blurb": "At the edge of Hampstead Heath, past rustling leaves and pond-dark stillness, an old telescope tilts toward Saturn. Every Friday and Saturday, stargazers gather in this city-side observatory, watching planets gleam through Victorian glass. It's a quiet, cosmic devotion - London looking out, far beyond herself.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Heaven",
    "location": "Westminster",
    "moods": [
      "ecstatic",
      "queer"
    ],
    "genres": [
      "club nights",
      "live music"
    ],
    "url": "https://heaven-live.co.uk",
    "blurb": "Central London's only 1,000-capacity gay club, the focal point of London's gay scene since 1979, hosting G-A-Y and big-name live acts.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Hen Corner - Introduction to Cheese Making",
    "location": "Brentford (TW8)",
    "moods": [
      "craft & making",
      "curious",
      "homely"
    ],
    "genres": [
      "cheese making (mozzarella, feta, camembert)"
    ],
    "url": "https://hencorner.com/product/cheesemaking/",
    "blurb": "Tucked in Brentford's gentle sprawl, Sara Ward's garden sings with bees, hens, and the quiet clink of curds forming. At Hen Corner, cheese making is homely magic - mozzarella stretched warm, camembert blooming in mould-soft hush. The day is generous: garden tours, homemade lunch, laughter over milk and culture. You'll leave with hands scented of whey, and heart full of old ways made new.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Hidden London Tours - London Transport Museum",
    "location": "Clapham",
    "moods": [
      "urban explorer",
      "curious",
      "mysterious"
    ],
    "genres": [
      "hidden London tour",
      "railway/infrastructure history"
    ],
    "url": "https://www.ltmuseum.co.uk/whats-on/hidden-london",
    "blurb": "Beneath the London you know lies a city preserved in dust and echoes. Hidden London Tours descend into Tube stations long forgotten - Aldwych's tiled hush, Charing Cross's stillness behind locked gates. Here, the past hasn't moved. Your footsteps join those of wartime sleepers, ghost commuters, and soot-streaked engineers.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Highgate Cemetery After-Hours Tour (SAVE Britain's Heritage)",
    "location": "Highgate",
    "moods": [
      "haunted",
      "curious"
    ],
    "genres": [
      "cemetery tour",
      "architectural heritage"
    ],
    "url": "https://www.savebritainsheritage.org/events/an-evening-at-highgate-cemetery-out-of-hours-walking-tour-for-save-supporters",
    "blurb": "Beyond the iron gates, ivy and angels cradle the stones. By twilight, Highgate's West Side is opened to a privileged few - led past crypts and moss-soft chapels by torchlight and tales. Here, Victorian grief becomes grandeur, and architecture mourns in marble. An after-hours reverence for the gothic sublime.",
    "last_verified": "2025-11-23",
    "features": [
      "historical"
    ]
  },
  {
    "name": "Hiver Beers - Cider Making Workshop",
    "location": "Bermondsey",
    "moods": [
      "craft & making",
      "curious",
      "epicurean"
    ],
    "genres": [
      "cider brewing"
    ],
    "url": "https://hiverbeers.com/pages/workshops",
    "blurb": "In Bermondsey's amber archways, apples become alchemy. At Hiver's taproom, you'll chop, crush, and press - turning crisp fruit into golden promise. Two bottles of your own cider leave with you, still whispering their slow-fermenting spell. The space hums with warmth, honey, and sticky joy. This is fermentation with fingerprints - autumn in a bottle, and a little wildness to keep.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Holotropic Breathwork – Experiential Weekend",
    "location": "Colet House",
    "moods": [
      "intense",
      "transformative"
    ],
    "genres": [
      "holotropic breathwork",
      "integration"
    ],
    "url": "https://dandelion.events/e/r6zie",
    "blurb": "This is not breathwork, it's descent. Over a weekend held in sacred structure, you will breathe into altered states — eyes closed, music loud, the body leading where language ends. It's intense, profound, alchemical. Held by trained facilitators, the container is strong enough to hold whatever emerges.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Hootananny Brixton",
    "location": "Brixton",
    "moods": [
      "ecstatic",
      "earthy"
    ],
    "genres": [
      "reggae",
      "jungle",
      "disco",
      "electronic"
    ],
    "url": "https://hootanannybrixton.co.uk",
    "last_verified": "2025-11-15",
    "blurb": "A Brixton institution with soil under its nails and rhythm in its bones, Hootananny is where dance meets roots, and nights stretch long into sweat and laughter. From reggae to jungle, disco to dub, the sound is always full-bodied, the crowd always alive. Outdoor courtyard, indoor thrum — this is joy with a pulse and a pint."
  },
  {
    "name": "Horniman Museum and Gardens",
    "location": "Forest Hill",
    "moods": [
      "wonder",
      "family-friendly",
      "curious"
    ],
    "genres": [
      "museum",
      "gardens",
      "family events"
    ],
    "url": "https://www.horniman.ac.uk",
    "last_verified": "2025-11-17",
    "blurb": "Perched on a hill with views across London, Horniman is part museum, part magical garden — a place where families wander from natural history halls to music galleries, from butterfly house to bandstand lawn. There's a Victorian charm to it all, but also a quiet curiosity that keeps things alive. Bring a flask, bring a question. Stay for the walrus."
  },
  {
    "name": "House of Burlesque Academy",
    "location": "Covent Garden",
    "moods": [
      "empowering",
      "playful",
      "body-confident"
    ],
    "genres": [
      "burlesque",
      "fan dancing",
      "costume & act creation"
    ],
    "url": "https://www.houseofburlesque.co.uk/academy-home",
    "blurb": "Feathers flare, heels click, and something ancient wakes. At House of Burlesque, you learn more than steps - you learn to occupy your body with flair, pride, and glittered joy. Taught by showgirls and stars, this is an academy of unapology: a sequinned homecoming to the stage within.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Hundred Years Gallery",
    "location": "Hoxton",
    "moods": [
      "wild",
      "curious",
      "wonder"
    ],
    "genres": [
      "experimental art",
      "improvised music"
    ],
    "url": "http://hundredyearsgallery.co.uk",
    "last_verified": "2025-11-17",
    "blurb": "Tucked in a quiet Hoxton side street, Hundred Years Gallery hums with the strange and the sublime. It's a space for the brave — hosting experimental art, improvised soundscapes, and happenings that feel half-dreamed. One night might bring a cello bowed through static; another, a sculptor mid-transformation. For wanderers who long to be slightly unmoored."
  },
  {
    "name": "IKLECTIK Art Lab",
    "location": "Peckham",
    "moods": [
      "witchy",
      "rebellious"
    ],
    "genres": [
      "experimental sound",
      "performance rituals"
    ],
    "url": "https://iklectik.org",
    "blurb": "A grassroots Art Lab dedicated to experimental sound and socially engaged practices, holding care, experimentation, and resistance at its core.",
    "last_verified": "2025-11-17"
  },
  {
    "name": "Institute of Making (UCL) - Papermaking Course",
    "location": "Stratford",
    "moods": [
      "craft & making",
      "curious"
    ],
    "genres": [
      "Japanese paper",
      "recycled paper",
      "fibre preparation"
    ],
    "url": "https://www.instituteofmaking.org.uk",
    "blurb": "In Stratford's academic heart, fibres are softened, coaxed, transformed. The Institute of Making offers a slow dive into the ancient and experimental: paper made not only by hand, but by thought. Japanese techniques mix with modern invention. It's method and meditation - a six-week whisper from fibre to form.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Jacksons Lane",
    "location": "Highgate",
    "moods": [
      "playful",
      "curious"
    ],
    "genres": [
      "circus",
      "contemporary performance"
    ],
    "url": "https://www.jacksonslane.org.uk/",
    "blurb": "Haringey's flagship arts venue for 45+ years, empowering diverse communities through circus, contemporary performance, and creative participation.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Jazz Café POSK",
    "location": "Hammersmith",
    "moods": [
      "melancholy",
      "global"
    ],
    "genres": [
      "jazz",
      "world music"
    ],
    "url": "https://jazzcafeposk.org/",
    "blurb": "A Polish community jazz club where red curtains frame international improvisation and melancholic beauty meets global rhythms.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Jazzlive at the Crypt",
    "location": "Camberwell",
    "moods": [
      "melancholy",
      "candlelit"
    ],
    "genres": [
      "improvised jazz"
    ],
    "url": "https://www.jazzlive.co.uk",
    "blurb": "Beneath St Giles Church, Friday nights dissolve into improvised jazz and candlelight, where every note echoes off stone older than memory.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Kanpai London - Sake Tasting & DIY Sake Brewing",
    "location": "Peckham",
    "moods": [
      "curious",
      "craft & making",
      "epicurean"
    ],
    "genres": [
      "sake tasting",
      "brewing"
    ],
    "url": "https://kanpailondon.com",
    "blurb": "Beneath Peckham's arches, sake breathes. Kanpai - London's first sake brewery - pulses with rice and reverence. In the taproom, tastings unfold like poetry: crisp, umami-laced, each sip a glimpse into Japan's soul. For the devoted, there's more - a full-day ritual of brewing your own batch. Koji spores, polished grains, steam, and stillness. This is not quick consumption - it is a ceremony in yeast and patience.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Kelechnekoff Pole Dance Studio",
    "location": "Peckham",
    "moods": [
      "fierce",
      "sensual",
      "empowering"
    ],
    "genres": [
      "pole dance",
      "spinning pole",
      "sexy heels choreography"
    ],
    "url": "https://www.kelechnekoff.com/timetable",
    "blurb": "Founded by Kelechi Okafor, this Peckham studio is fire wrapped in velvet. From the grind of spinning pole to the strut of heels, each class is a space of sensual reclamation. This is where bodies roar, pleasure is political, and every drop of sweat spells power and play.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "King's Head Theatre",
    "location": "Islington",
    "moods": [
      "queer",
      "punchy"
    ],
    "genres": [
      "theatre",
      "cabaret",
      "drag"
    ],
    "url": "https://www.kingsheadtheatre.com/",
    "blurb": "London's longest-running pub theatre, now in a purpose-built space celebrating the LGBTQ+ community through plays, cabaret, and drag.",
    "notes": "Moved to new purpose-built theatre in January 2024",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Kitchen Witchery at Made in Hackney",
    "location": "Hackney",
    "moods": [
      "earthy",
      "practical",
      "nourishing",
      "witchy"
    ],
    "genres": [
      "herbalism",
      "kitchen magic",
      "seasonal food"
    ],
    "url": "https://www.madeinhackney.org/whats-on",
    "blurb": "Here, the spell is a soup. In this warm Clapton kitchen, herbs are chopped with intention, roots stirred with reverence. Made in Hackney offers plant-based classes where food becomes ritual - nourishing body and spirit alike. It's everyday magic, honest and edible.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Library Pot",
    "location": "Richmond",
    "moods": [
      "intimate",
      "slow-paced"
    ],
    "genres": [
      "board games",
      "mahjong leagues",
      "strategy games"
    ],
    "url": "https://librarypot.uk/",
    "blurb": "Tucked along Kew Road, Library Pot is a licensed café where 700 games wait like old friends. Here, Thai green curry shares the table with Catan, kimchi noodles with cooperative quests. The pace is languid, the company warm, and the mahjong leagues fierce with quiet devotion. Sessions stretch long into the evening, fuelled by craft ales and the gentle click of tiles on wood.",
    "last_verified": "2025-11-23",
    "features": [
      "foodie-friendly"
    ]
  },
  {
    "name": "Liminal 11 - Tarot & Mysticism Events",
    "location": "Various venues across London",
    "moods": [
      "playful",
      "mystical",
      "creative"
    ],
    "genres": [
      "tarot",
      "oracle cards",
      "creative mysticism"
    ],
    "url": "https://liminal11.com/events/",
    "blurb": "From the artists of the Modern Witch tarot comes a rotating carousel of pop-up magic - tarot salons, deck releases, live readings. Liminal 11 blends art with archetype, inviting you to draw a card, spark a vision, and play with the symbols that shape the soul.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Loading Bar",
    "location": "Stoke Newington",
    "moods": [
      "retro",
      "fun",
      "community"
    ],
    "genres": [
      "board games",
      "console gaming",
      "arcade",
      "indie games"
    ],
    "url": "https://www.loading.bar/",
    "blurb": "A glow-lit lounge of glitch and glee — consoles buzz, dice tumble, and cocktails kiss the dusk in this retro refuge for grown-up play.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "London Calligraphy",
    "location": "Various venues across London (often central hotels and studios)",
    "moods": [
      "refined",
      "contemplative"
    ],
    "genres": [
      "pointed pen calligraphy",
      "brush lettering"
    ],
    "url": "https://londoncalligraphy.com",
    "blurb": "In the hush of hotel parlours and sunlit studios, London Calligraphy offers a pause in ink. Here, copperplate curves emerge beneath your fingers, guided by the delicate touch of tradition. It's a space for stillness, for letters born of breath - where a pen becomes an instrument of grace.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "London Centre for Book Arts (LCBA)",
    "location": "Fish Island",
    "moods": [
      "craft & making",
      "curious"
    ],
    "genres": [
      "introduction to bookbinding",
      "letterpress printing",
      "risograph printing",
      "portfolio/box making"
    ],
    "url": "https://londonbookarts.org",
    "blurb": "On the industrial edge of Fish Island, LCBA hums with the rhythm of ink and old machines. Here, the press breathes life into paper, each print a quiet thunder of expression. From risograph bursts to the elegance of letterpress, this is where type and touch meet - and leave you marked, hands inked, heart stirred.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "London Cheese Board - Cheese & Wine Pairing Evenings",
    "location": "Elephant & Castle (SE1)",
    "moods": [
      "epicurean",
      "curious",
      "community"
    ],
    "genres": [
      "cheese",
      "wine"
    ],
    "url": "https://www.thelondoncheeseboard.com/",
    "blurb": "In a modest nook near Elephant, the London Cheese Board lays a velvet map of milk and grape. Cheddar's tang meets a Burgundy hush, and Stilton dances with Port's dark murmur. These pairing evenings are part flirtation, part ritual - and entirely delicious. Come with questions, leave with a larder of new longings.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "London Night Photography Tour - London Streets Photography",
    "location": "Central London landmarks (meeting point arranged with guide)",
    "moods": [
      "urban explorer",
      "creative",
      "curious"
    ],
    "genres": [
      "night photography walk"
    ],
    "url": "https://londonstreetsphotography.co.uk/project/london-night-photography-tour/",
    "blurb": "The Thames gleams under bridge-light and moon. This night tour slips through London's iconic sights - St Paul's dome, the shimmer of the Eye - teaching your lens to breathe in low light. With a tripod and a bit of patience, you'll catch the city mid-exhale, luminous and alive.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "London Smoke & Cure - Salami Sessions",
    "location": "Bermondsey",
    "moods": [
      "craft & making",
      "epicurean",
      "curious"
    ],
    "genres": [
      "salami/charcuterie"
    ],
    "url": "https://londonsmokeandcure.co.uk/products/salami-sessions-workshop",
    "blurb": "Charcuterie here is no afterthought - it is the whole slow gospel. At London Smoke & Cure, in a purpose-built Bermondsey studio, you'll grind, cure, season, and fill - hand-making salami that sings of time and salt. The air smells of pepper and promise. You'll sit down to a shared tasting, then leave with your own handmade links, cradled like treasure. Fermentation becomes faith. The meat, a memory.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Love & Loss – Grief Tending Rituals",
    "location": "Various London locations",
    "moods": [
      "grief-held",
      "mythic"
    ],
    "genres": [
      "grief rituals",
      "communal healing"
    ],
    "url": "https://www.loveandloss.co.uk/loss/grief-tending-events/",
    "blurb": "Grief is not a problem to be solved, but a river to be met. In this sacred circle, held by experienced guides, you'll share song, story, silence, and lament. There are altars. There are tears. There is relief in the presence of others who will not look away.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Luna London - Full Moon Gatherings & Workshops",
    "location": "Hackney",
    "moods": [
      "ritual",
      "feminine",
      "gentle",
      "community"
    ],
    "genres": [
      "moon rituals",
      "crystal healing",
      "womenâ€™s circles",
      "intention setting"
    ],
    "url": "https://www.lunalondon.co.uk/workshops",
    "blurb": "At every full moon, Luna London lights a soft fire - sometimes with crystals, sometimes cacao, always with care. These women-led circles call in clarity, release, and rooted presence. The magic here is intimate, less thunder than tide - a rhythm you can live by.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Made in Hackney - Preserving & Pickling Workshops",
    "location": "Hackney (E8)",
    "moods": [
      "craft & making",
      "earthy",
      "community"
    ],
    "genres": [
      "pickling",
      "fermentation",
      "preserves"
    ],
    "url": "https://www.madeinhackney.org/whats-on",
    "blurb": "At Made in Hackney, preservation becomes praxis. In these pickling and fermenting classes, cucumber becomes protest, jam becomes joy, and vinegar sharpens more than just flavour. It's slow food for fast times - radical, rooted, and deliciously real. Come with an apron; leave with a pantry revolution.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Mash Paddle Brewery - Brew Your Own Beer",
    "location": "Bermondsey",
    "moods": [
      "craft & making",
      "adult play",
      "curious"
    ],
    "genres": [
      "beer brewing"
    ],
    "url": "https://mashpaddlebrewery.com",
    "blurb": "Down on the Bermondsey Beer Mile, a railway arch hums with malted intention. Mash Paddle hands you the grains, the paddle, the process - and says: go. You'll choose the style, stir the mash, watch the wort boil and bubble. It's earthy, heady, and satisfyingly real. Weeks later, you'll crack open your own cans - 24 of them - each one fizzing with your name, your labour, your laugh.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Matchstick Piehouse",
    "location": "Deptford",
    "moods": [
      "rebellious",
      "queer"
    ],
    "genres": [
      "theatre",
      "cabaret",
      "live music"
    ],
    "url": "https://matchsticktheatre.com",
    "blurb": "Resurrected by artists as a worker-run co-op, this railway arch pulses with radical theatre, cabaret, and community-powered joy.",
    "notes": "Now operating as Piehouse Co-op (reopened early 2025)",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Miller's Way Project – Pay It Forward Sound Therapy",
    "location": "Shepherd's Bush",
    "moods": [
      "restorative",
      "healing",
      "gentle"
    ],
    "genres": [
      "sound healing",
      "community care"
    ],
    "url": "https://www.millerswayproject.com/",
    "blurb": "In a converted garage on a quiet West London street, healing hums in bowls and breath. This pay-it-forward project offers somatic journeys and soundbaths — held not as products, but as gifts. It's a sanctuary for those whose nervous systems are still learning how to feel safe.",
    "last_verified": "2025-11-23",
    "features": [
      "accessible"
    ]
  },
  {
    "name": "Music Tree Circles – Circle Singing",
    "location": "Barnsbury, Islington",
    "moods": [
      "communal",
      "spontaneous"
    ],
    "genres": [
      "circle singing",
      "body music",
      "vocal improvisation"
    ],
    "url": "https://musictreeuk.com/circlemusic/",
    "blurb": "Voices weave like vines in the Music Tree Circles. No sheet music, no judgment — only call and echo, layer and loop. Led by a skilled improviser, the circle grows a living song, made of all who enter it. Harmony here is not perfection — it's communion.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Mysteries of the Tarot with Richard Abbot",
    "location": "Camden",
    "moods": [
      "introspective",
      "symbolic",
      "intellectual"
    ],
    "genres": [
      "tarot",
      "archetypal study",
      "personal insight"
    ],
    "url": "https://www.thehamblintrust.org.uk/richard-abbot",
    "blurb": "Richard Abbot teaches tarot not as fortune-telling but as soul-language. In person or online, he maps the major arcana as a journey of becoming - each card a mirror, each spread a slow unfolding. These aren't classes. They're pilgrimages, layered with depth and nuance.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Neon Naked Life Drawing",
    "location": "Peckham",
    "moods": [
      "vibrant",
      "playful",
      "rebellious",
      "experimental"
    ],
    "genres": [
      "life drawing",
      "UV art",
      "body painting"
    ],
    "url": "https://www.eventbrite.co.uk/o/neon-naked-life-drawing-12148068361",
    "blurb": "Under blacklight, bodies become living canvases. At Neon Naked, models glow in UV paint while participants sketch with luminous pastels. It's playful, trippy, and gently anarchic - a space where traditional art rules melt, and creativity dances radiant across the page.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "New River Studios",
    "location": "Manor House",
    "moods": [
      "community",
      "experimental",
      "group energy"
    ],
    "genres": [
      "experimental music",
      "community arts"
    ],
    "url": "https://newriverstudios.com",
    "last_verified": "2025-11-17",
    "blurb": "In a repurposed warehouse near Manor House, New River Studios thrums with DIY spirit. It's a rehearsal space, a venue, a café — and above all, a community hub for the experimentally inclined. Expect noise gigs, film nights, zine fairs, and the kind of collaborative chaos that births new forms. Come with open ears and maybe earplugs."
  },
  {
    "name": "Night Street Art Photography Workshop - Shoreditch Street Art Tours",
    "location": "Shoreditch",
    "moods": [
      "urban explorer",
      "curious",
      "creative"
    ],
    "genres": [
      "street-art walk",
      "night photography"
    ],
    "url": "https://www.shoreditchstreetarttours.co.uk/night-photography-tours/",
    "blurb": "In Shoreditch after dark, murals take on a second life - one of haloes and headlights, shadows and neon. Led by a photographer with a streetwise eye, this workshop invites you to dance with your camera among the graffiti. Light trails sketch magic; the city grins back in colour.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Old Bexley Soap & Candle Co. - Candle & Soap Courses",
    "location": "The Strand",
    "moods": [
      "cosy",
      "sensory"
    ],
    "genres": [
      "natural soy-wax candle making",
      "cold-process soap making"
    ],
    "url": "https://www.oldbexleysoap.co.uk",
    "blurb": "Down a quiet court near the Strand, flames flicker and scents rise in a workshop scented with rosemary and rose. At Old Bexley, the craft of clean and candle is taught by hand - wax poured slow, soap stirred with care. The result? Bars and tapers infused with warmth and wonder.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Orange Tree Theatre",
    "location": "Richmond",
    "moods": [
      "curious",
      "intimate"
    ],
    "genres": [
      "new plays",
      "classics",
      "theatre in the round"
    ],
    "url": "https://orangetreetheatre.co.uk/",
    "last_verified": "2025-11-17",
    "blurb": "Nestled just off Richmond Green, Orange Tree Theatre invites you into its round — a space where actors are close enough to touch, and every glance lands. Their repertoire weaves bold new writing with reimagined classics, all staged with clarity and care. It's theatre without distance, for minds that like to lean in."
  },
  {
    "name": "Oslo Hackney",
    "location": "Hackney",
    "moods": [
      "ecstatic",
      "playful"
    ],
    "genres": [
      "indie",
      "dance",
      "pop",
      "R&B"
    ],
    "url": "https://oslohackney.com",
    "blurb": "A 375-capacity venue in a redeveloped railway station with Nordic aesthetic, hosting indie bands and club nights with an excellent sound system.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Otter Chaos",
    "location": "Brixton",
    "moods": [
      "cosy",
      "sociable",
      "eclectic"
    ],
    "genres": [
      "board games",
      "D&D sessions",
      "social mixer nights"
    ],
    "url": "https://www.designmynight.com/london/event-space/brixton/otter-chaos",
    "blurb": "Beneath Brixton station, Otter Chaos glows warm and colourful, lined with 500 games and humming with laughter. Sourdough pizzas emerge from the oven as Catan settlements rise and D&D campaigns unfold in hushed corners. The atmosphere buzzes without pressing — a hideaway for first-timers and veterans alike, where craft cocktails and cooperative play make every evening feel like an accidental festival.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Park Theatre",
    "location": "Finsbury Park",
    "moods": [
      "thoughtful",
      "contemplative",
      "The Thoughtful Stage"
    ],
    "genres": [
      "new writing",
      "modern revivals"
    ],
    "url": "https://parktheatre.co.uk/",
    "blurb": "A neighbourhood theatre with global ambition, delivering world-class theatre through accessible stories and community-focused programming.",
    "last_verified": "2025-11-15",
    "features": [
      "salon"
    ]
  },
  {
    "name": "Phantom Peak",
    "location": "Canada Water",
    "moods": [
      "mystical",
      "exploratory",
      "narrative"
    ],
    "genres": [
      "live-action puzzle trails",
      "interactive quests",
      "steampunk adventure"
    ],
    "url": "https://www.phantompeak.com/",
    "blurb": "Phantom Peak is a town that breathes. A steampunk dreamscape by the water, where app-led trails wind through carnival games, live actors, and mysteries that shift with the seasons. You are the protagonist here, solving puzzles at your own pace, sipping cocktails by a waterfall, meeting eccentric strangers who might be allies or tricksters. It's a real-life video game — collaborative, immersive, and utterly unlike anything else in London.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Phoenix Cinema",
    "location": "Finchley",
    "moods": [
      "sacred",
      "curious"
    ],
    "genres": [
      "art house",
      "independent"
    ],
    "url": "https://www.phoenixcinema.co.uk",
    "blurb": "One of the UK's oldest continuously operating picturehouses, a Grade II listed 1912 building with barrel-vaulted ceilings and Art Deco panels.",
    "last_verified": "2025-11-17"
  },
  {
    "name": "Phonox",
    "location": "Brixton",
    "moods": [
      "big night out",
      "ecstatic"
    ],
    "genres": [
      "electronic",
      "house",
      "techno"
    ],
    "url": "https://phonox.co.uk",
    "last_verified": "2025-11-17",
    "blurb": "Phonox doesn't do filler. Just one DJ, one room, and a Funktion-One sound system that'll shake loose whatever's clinging. Tucked just off Brixton Road, it's a temple for house heads and techno lovers who come for the long set, the clean mix, the ecstatic drop. Friday's a ritual. Saturday's a release."
  },
  {
    "name": "Pizza Express Jazz Club",
    "location": "Soho",
    "moods": [
      "candlelit",
      "folk"
    ],
    "genres": [
      "jazz"
    ],
    "url": "https://pizzaexpresslive.com/venues/soho-jazz-club",
    "blurb": "One of London's most iconic jazz venues since 1976, a basement where tables cluster around a small stage hosting world-renowned artists.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Pleasance Theatre",
    "location": "Islington",
    "moods": [
      "playful",
      "curious"
    ],
    "genres": [
      "theatre",
      "comedy",
      "performance"
    ],
    "url": "https://www.pleasance.co.uk",
    "blurb": "A leading arts charity championing innovation and emerging voices, hosting hundreds of productions while providing artist development and mentorship.",
    "last_verified": "2025-11-17"
  },
  {
    "name": "Poetry Café",
    "location": "Covent Garden",
    "moods": [
      "word",
      "thoughtful",
      "intimate"
    ],
    "genres": [
      "poetry readings",
      "workshops"
    ],
    "url": "https://poetrysociety.org.uk/venue/the-poetry-cafe/",
    "last_verified": "2025-11-17",
    "blurb": "Tucked down a quiet lane in Covent Garden, The Poetry Café is a hush with a heartbeat — home to open mics, quiet revolutions, and lines that linger. Run by The Poetry Society, it hosts readings, workshops, and the kind of conversations that unfold like verse. The tea is hot, the lights are low, and the words are waiting."
  },
  {
    "name": "Pole Mission Dance Studio",
    "location": "Soho",
    "moods": [
      "inclusive",
      "confidence-building",
      "fun"
    ],
    "genres": [
      "pole dance",
      "exotic pole",
      "aerial hoop"
    ],
    "url": "https://www.polemission.london",
    "blurb": "Tucked above Dean Street, Pole Mission pulses with rhythm and rebellion. Exotic spins, aerial swoops, laughter echoing from mirrored walls. Here, strength meets seduction - unapologetic and alive. Whatever your story, there's room on the pole for it, wrapped in community, expression, and the shimmer of self-trust.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Poplar Union",
    "location": "Poplar",
    "moods": [
      "earthy",
      "tender"
    ],
    "genres": [
      "community arts",
      "workshops"
    ],
    "url": "https://poplarunion.com",
    "blurb": "A grassroots community arts centre making creativity accessible to everyone, focusing on health, wellbeing, and social connection.",
    "last_verified": "2025-11-17"
  },
  {
    "name": "Print Club London",
    "location": "Hackney",
    "moods": [
      "craft & making",
      "vibrant"
    ],
    "genres": [
      "beginners screen-printing",
      "CMYK printing",
      "deluxe multi-day courses",
      "life-drawing & screen-printing"
    ],
    "url": "https://printclublondon.com",
    "blurb": "Beneath the corrugated canopy of Hackney's creative veins, Print Club London thrums with layered colour and communal ink. Here, CMYK dreams emerge from halftone haze, and beginners learn to pull their very first print - a delicate chaos of light, shadow and screen. Life-drawing mingles with emulsion; art breathes.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Questors Theatre",
    "location": "Ealing",
    "moods": [
      "family-friendly",
      "thoughtful"
    ],
    "genres": [
      "amateur theatre",
      "touring companies"
    ],
    "url": "https://questors.org.uk",
    "blurb": "One of the UK's leading amateur theatres, staging 15-20 professional-quality productions yearly across two performance spaces.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Rich Mix",
    "location": "Shoreditch",
    "moods": [
      "earthy",
      "ecstatic"
    ],
    "genres": [
      "music",
      "spoken word",
      "theatre",
      "dance",
      "film"
    ],
    "url": "https://richmix.org.uk",
    "blurb": "East London's home for culture and creativity, a charity presenting eclectic programming and reinvesting profits into community work.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Rick Nodine Contact Improvisation Classes & Jam",
    "location": "Tufnell Park",
    "moods": [
      "playful",
      "tactile",
      "communicative",
      "exploratory"
    ],
    "genres": [
      "contact improvisation",
      "partner dance",
      "embodiment"
    ],
    "url": "https://www.ricknodine.com/london-classes",
    "blurb": "In this open-floor playground, bodies lean, spiral, and fall into shared rhythm. Rick Nodine's classes explore trust through touch - how to give weight, take space, respond. There's no choreography, only curiosity. It's not about how you move, but how you listen with skin, muscle, breath.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Rio Cinema",
    "location": "Dalston",
    "moods": [
      "rebellious",
      "curious"
    ],
    "genres": [
      "art house",
      "premieres"
    ],
    "url": "https://riocinema.org.uk",
    "blurb": "Dalston's crown jewel, an art-deco picture palace with activist roots hosting premieres, Q&As, and radical programming since the Rock Against Racism days.",
    "last_verified": "2025-11-17"
  },
  {
    "name": "Rogues Quarter",
    "location": "Kentish Town",
    "moods": [
      "rustic",
      "strategy-heavy",
      "casual"
    ],
    "genres": [
      "Magic the Gathering",
      "Warhammer",
      "miniatures",
      "board games"
    ],
    "url": "https://www.roguesquarter.com/",
    "blurb": "In Kentish Town's quieter streets, Rogues Quarter brews Ethiopian coffee and summons wargaming legends. Six-by-four tables sprawl with modular terrain, Magic the Gathering prereleases draw the devoted, and Kickstarter exclusives line the shelves like secrets. The vibe is coffeehouse meets battlefield: sustainable, laid-back, and open to all who seek the slow satisfaction of strategy.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Rose Theatre",
    "location": "Kingston",
    "moods": [
      "voice",
      "wonder"
    ],
    "genres": [
      "theatre",
      "jazz",
      "pantomime"
    ],
    "url": "https://www.rosetheatre.org/",
    "last_verified": "2025-11-17",
    "blurb": "Inspired by the original Elizabethan playhouse, Rose Theatre brings a sense of quiet majesty to Kingston's riverside. Its wide wooden stage holds everything from jazz nights to pantomime sparkle, but it's in the spoken word that it truly shines — echoing with voices that carry wonder. Big stories, intimate setting, always a seat close to the heart."
  },
  {
    "name": "Roundhouse",
    "location": "Camden",
    "moods": [
      "rebellious",
      "ecstatic"
    ],
    "genres": [
      "music",
      "theatre",
      "circus"
    ],
    "url": "https://www.roundhouse.org.uk/",
    "blurb": "An iconic iron-roofed performing arts venue with industrial heritage, empowering young creatives through cutting-edge programming.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Royal Docks Swim Series (RDSS) Evening Swim",
    "location": "Love Open Water London Royal Docks, Dock Road, E16 1AH",
    "moods": [
      "wild",
      "adventurous",
      "urban explorer"
    ],
    "genres": [
      "open-water swimming"
    ],
    "url": "https://www.royaldocks.london/whats-on/royal-docks-swim-series-rdss-2025",
    "blurb": "At dusk, the docks shimmer with invitation. Swimmers slip into open water as the city retreats behind them - kayaks watchful, cap snug, heart racing. The Royal Docks Swim Series is more than a race: it's a ritual of courage in a place where history met tide, and now welcomes breath.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Rule Zero",
    "location": "Stratford",
    "moods": [
      "immersive",
      "geeky",
      "welcoming"
    ],
    "genres": [
      "tabletop games",
      "Magic: The Gathering",
      "roleplay",
      "events"
    ],
    "url": "https://www.rulezero.co.uk/",
    "blurb": "A multi-storey spellbook of games and geekery — Rule Zero draws campaigns from its woodgrain tables like legends from lore, and welcomes all who seek the thrill of shared invention.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Sacred Geometry & Alchemy with Golden Light",
    "location": "The Light Centre, Moorgate, London EC2Y 5EB",
    "moods": [
      "esoteric",
      "symbolic",
      "meditative"
    ],
    "genres": [
      "sacred geometry",
      "alchemy",
      "spiritual philosophy"
    ],
    "url": "https://www.goldenlight.love/events",
    "blurb": "Inside the Light Centre, forms and frequencies take on sacred shape. These workshops sketch the divine in golden ratios and unfold the ancient tongue of alchemy. More than visual - it's a felt sense, a soul-geometry that lingers in the body long after the compass closes.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Sadler's Wells",
    "location": "Islington",
    "moods": [
      "movement",
      "awe",
      "ritual"
    ],
    "genres": [
      "contemporary dance",
      "ballet"
    ],
    "url": "https://www.sadlerswells.com/",
    "last_verified": "2025-11-17",
    "blurb": "Sadler's Wells is where the body becomes myth. From world-class ballet to boundary-breaking contemporary works, its stage is a sanctuary for movement in all its forms — precise, primal, transcendent. Whether you're drawn by ritual, rhythm, or sheer awe, this Islington landmark offers dance that speaks beyond words."
  },
  {
    "name": "Sanctuary Singing Circle",
    "location": "King's Cross, London",
    "moods": [
      "soulful",
      "uplifting"
    ],
    "genres": [
      "community singing",
      "harmony",
      "improvisation"
    ],
    "url": "https://www.eventbrite.co.uk/e/sanctuary-singing-circle-kings-cross-every-saturday-tickets-1777492611249",
    "blurb": "Held in the hush of a city church or soft-lit studio, this circle invites you into resonance. Simple songs, deep breath, shared stillness — all shaped for nervous system restoration. The space is queer-honouring, neurodivergent-friendly, and gently radical in its insistence that your voice belongs.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Sandrine Bettinelli - 'Embrace the Journey' Tantra Workshop",
    "location": "Peckham",
    "moods": [
      "intimate",
      "healing",
      "nourishing",
      "exploratory"
    ],
    "genres": [
      "tantra",
      "breathwork",
      "meditation",
      "caressing meditation"
    ],
    "url": "https://www.sandrinebettinelli.com/london-tantra-workshops",
    "blurb": "Held in the hush of Anatomie Studio, this full-day initiation invites you into the softest layers of self. Breath, gaze, and touch become prayers - not of seduction, but of presence. Sandrine holds a field of radical acceptance, where tenderness leads and every boundary becomes sacred.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Scala",
    "location": "King's Cross",
    "moods": [
      "big night out",
      "rebellious"
    ],
    "genres": [
      "club nights",
      "live music"
    ],
    "url": "https://scala.co.uk/",
    "blurb": "A four-floor entertainment venue hosting pounding club nights and gritty live gigs, where big names and rebellious energy collide.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Sebright Arms",
    "location": "Hackney",
    "moods": [
      "rebellious",
      "ecstatic"
    ],
    "genres": [
      "indie",
      "punk",
      "alternative"
    ],
    "url": "https://sebrightarms.com",
    "blurb": "A dishevelled Hackney boozer with a faithful crowd and basement gigs almost every night, where gritty east end energy pulses.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "She's Lost Control - Ritual & Spiritual Workshops",
    "location": "42 Valentine Road, London E9 7AD",
    "moods": [
      "ritual",
      "ethereal",
      "feminine",
      "transformative"
    ],
    "genres": [
      "moon rituals",
      "sound healing",
      "crystal work",
      "plant spirit connection"
    ],
    "url": "https://sheslostcontrol.co.uk/pages/events",
    "blurb": "Incense curls through the high-ceilinged space in Hackney, where crystals hum and the new moon is honoured in soft ceremony. She's Lost Control blends ancient ritual with modern energy - a haven for seekers, soul-sifters, and those who speak with the unseen.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Shoreditch Town Hall",
    "location": "Shoreditch",
    "moods": [
      "curious",
      "playful"
    ],
    "genres": [
      "theatre",
      "music",
      "dance",
      "circus"
    ],
    "url": "https://shoreditchtownhall.com",
    "blurb": "A Grade II listed cultural hub presenting progressive theatre, music, dance, and circus while supporting artists through residencies.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Siobhan Davies Studios",
    "location": "Bermondsey",
    "moods": [
      "movement",
      "awe",
      "ritual"
    ],
    "genres": [
      "dance classes",
      "workshops"
    ],
    "url": "https://www.siobhandavies.com",
    "last_verified": "2025-11-17",
    "blurb": "A hidden haven in Bermondsey, Siobhan Davies Studios offers dance not as spectacle, but as inquiry — a practice, a presence, a return to the body. Light floods the converted schoolhouse, now home to classes, workshops, and somatic explorations that move from the cellular to the sacred. Come here not to perform, but to remember."
  },
  {
    "name": "Sir Colin Campbell",
    "location": "Kilburn",
    "moods": [
      "folk",
      "queer"
    ],
    "genres": [
      "Irish music",
      "folk"
    ],
    "url": "https://sircc.pub",
    "blurb": "An LGBTQI+-friendly modern Irish pub offering traditional live Irish music every weekend and warm Irish hospitality to all.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Social Pottery - Hand-Build & Decorate Ceramics Workshop",
    "location": "Camden",
    "moods": [
      "playful",
      "social"
    ],
    "genres": [
      "coil",
      "slab and pinch hand-building",
      "underglaze decoration"
    ],
    "url": "https://socialpottery.com",
    "blurb": "Weekends in Camden bloom with glaze and laughter at Social Pottery. Mugs and bowls are coaxed into being with joyful fingers, then adorned in colour and story. Here, perfection is beside the point - this is about texture, expression, and the giddy pleasure of shaping earth into joy.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Soho Theatre",
    "location": "Soho",
    "moods": [
      "comic",
      "cabaret"
    ],
    "genres": [
      "comedy",
      "cabaret",
      "new theatre"
    ],
    "url": "https://sohotheatre.com",
    "blurb": "London's most vibrant producer of new theatre, comedy, and cabaret, championing voices outside the mainstream.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Sole2Soul – Open Floor Movement & Embodied Voice",
    "location": "Various London venues (Creating Connexions)",
    "moods": [
      "expressive",
      "rooted"
    ],
    "genres": [
      "open floor",
      "embodied voice",
      "somatic"
    ],
    "url": "https://bookwhen.com/sole2soulvoiceandmovement",
    "blurb": "Here, the floor receives you and the voice returns. These workshops blend improvised movement with the subtle music of your own sound. No choreography, no scripts — only what your body offers, and what it asks. You'll dance, hum, cry, breathe. It is liberation, gently held.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Sonsoles Print Studio",
    "location": "Peckham",
    "moods": [
      "craft & making",
      "energetic"
    ],
    "genres": [
      "screen-printing",
      "stencil making",
      "colour layering"
    ],
    "url": "https://sonsolesprintstudio.co.uk",
    "blurb": "In the heart of Peckham's artistic sprawl, Sonsoles Print Studio pulses with pigment and play. The ink sings in layers, a chorus of colour pulled across silkscreen mesh. Here, screens are exposed, water-based inks are swirled like spells, and each print becomes a bright, noisy bloom. It's all hands, all heart.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "South London Gallery",
    "location": "Peckham",
    "moods": [
      "community",
      "thoughtful",
      "curious"
    ],
    "genres": [
      "contemporary art",
      "workshops"
    ],
    "url": "https://www.southlondongallery.org",
    "last_verified": "2025-11-17",
    "blurb": "Rooted in Peckham since 1891, South London Gallery is more than a space for contemporary art — it's a conversation across time, place, and people. The exhibitions here are thoughtful and often bold, but there's room too for making, questioning, gathering. With workshops, community dinners, and a firelit garden, it's a gallery that listens as much as it shows."
  },
  {
    "name": "Southwark Park Galleries (Lake Gallery & Dilston Gallery)",
    "location": "Bermondsey (Southwark)",
    "moods": [
      "democratic",
      "contemplative"
    ],
    "genres": [
      "painting",
      "sculpture",
      "sound art",
      "community exhibitions"
    ],
    "url": "southwarkparkgalleries.org",
    "blurb": "Two galleries bloom inside a London park: one beside the lake, the other inside a deconsecrated church. Southwark Park Galleries hold space for all — the seasoned painter, the first-time sculptor, the curious wanderer with a dog on a lead. Each show feels like a ritual of presence, a moment of quiet democracy framed in brushstroke and stone.",
    "last_verified": "2025-11-23",
    "features": [
      "open-air"
    ]
  },
  {
    "name": "Spiritland",
    "location": "King's Cross",
    "moods": [
      "nostalgic",
      "ecstatic"
    ],
    "genres": [
      "listening bar",
      "DJs",
      "talks"
    ],
    "url": "https://spiritland.com/",
    "last_verified": "2025-11-17",
    "blurb": "At Spiritland, music isn't background — it's ritual. This King's Cross listening bar is built around one of the best sound systems in London, hosting vinyl-deep DJ sets, intimate talks, and nights that hum with nostalgia and new discovery. Expect everything from cosmic disco to jazz rarities, all spun with reverence. Come for the hi-fi. Stay for the feeling."
  },
  {
    "name": "St Martin-in-the-Fields",
    "location": "Trafalgar Square",
    "moods": [
      "sacred",
      "candlelit"
    ],
    "genres": [
      "classical",
      "choral"
    ],
    "url": "https://www.stmartin-in-the-fields.org",
    "blurb": "An active church on Trafalgar Square offering candlelit concerts, lunchtime recitals, and music in the crypt.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Standpoint Gallery",
    "location": "Hoxton (Hackney)",
    "moods": [
      "raw",
      "critical",
      "collaborative"
    ],
    "genres": [
      "contemporary visual art",
      "emerging artists",
      "installations"
    ],
    "url": "https://standpointlondon.co.uk",
    "blurb": "Behind a modest Hoxton doorway, Standpoint hums with the urgency of new work. The walls here do not sell — they speak. Raw, defiant, and alive with intent, this artist-run sanctuary invites you into its process: the paint still drying, the idea mid-bloom. Come not to consume, but to witness. The air carries critique and care in equal measure.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Stanley Arts",
    "location": "South Norwood",
    "moods": [
      "activist",
      "queer"
    ],
    "genres": [
      "dance",
      "theatre",
      "community events"
    ],
    "url": "https://stanleyarts.org/",
    "last_verified": "2025-11-17",
    "blurb": "Housed in a grand old hall in South Norwood, Stanley Arts is a home for boundary-pushers and local dreamers alike. Its programme celebrates queer voices, activist spirit, and community-led creation — from dance battles to heritage walks, cabaret to care circles. A space where art meets action, and everyone is invited in."
  },
  {
    "name": "Stress Project – Therapeutic Gardening",
    "location": "Holloway, Islington",
    "moods": [
      "nurturing",
      "mindful"
    ],
    "genres": [
      "therapeutic horticulture",
      "community gardening"
    ],
    "url": "https://www.stressproject.org.uk/therapeutic-gardening.html",
    "blurb": "n a hidden North London garden, hands sink into soil. The Stress Project offers not advice, but calendula and compost, mint and mulch. This is healing through tending — of land, of self, of quiet community. Growth here is measured in roots, not results.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Studio Kühü",
    "location": "East London",
    "moods": [
      "gentle",
      "botanical"
    ],
    "genres": [
      "bundle dyeing",
      "botanical printing",
      "shibori",
      "ice dyeing",
      "ink making"
    ],
    "url": "https://studiokuhu.com",
    "blurb": "In a hush of East London, Studio Kühü gathers petals and silence to teach the delicate art of botanical print. Dyes made of ice and flower, silk steeped in pigment dreams - here, the palette is alive. Each cloth becomes a pressed poem, each workshop a breath of blooming stillness.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Studio Pottery London - Hand-Building Pottery Course",
    "location": "Victoria",
    "moods": [
      "mindful",
      "tactile"
    ],
    "genres": [
      "pinching",
      "coiling",
      "slab building",
      "surface decoration"
    ],
    "url": "https://www.studio-pottery-london.com",
    "blurb": "In the still evenings of Victoria, Studio Pottery London offers clay not just as material but as meditation. Fingers pinch, coil, and smooth earth into form, guided by RCA-trained hands. Each session is an invitation to shape stillness - and leave with a vessel born of your own breath.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Tabard Pub & Theatre",
    "location": "Chiswick",
    "moods": [
      "comic",
      "intimate"
    ],
    "genres": [
      "pub theatre",
      "comedy"
    ],
    "url": "https://tabard.org.uk",
    "blurb": "London Pub Theatre of the Year 2025, a cosy theatre above a historic pub presenting intimate comedy and new work.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Tara Theatre",
    "location": "Earlsfield",
    "moods": [
      "ritual",
      "voice",
      "activist"
    ],
    "genres": [
      "South Asian theatre",
      "political theatre"
    ],
    "url": "https://taratheatre.com",
    "last_verified": "2025-11-17",
    "blurb": "A small stage with mighty roots, Tara Theatre centres South Asian voices with clarity, craft, and conviction. From political dramas to poetic rituals, its work speaks across continents and generations — often fierce, often tender, always necessary. Based in Earlsfield, it's a space where diasporic stories take the lead and the mic stays warm."
  },
  {
    "name": "Tea & Tasseomancy - Divination by the Cup",
    "location": "Rotating venues (often East London cafes)",
    "moods": [
      "witchy",
      "intimate",
      "mystical"
    ],
    "genres": [
      "tea leaf reading",
      "divination",
      "folk magic"
    ],
    "url": "https://www.instagram.com/teaandtasseomancy/",
    "blurb": "A swirl in the bottom of a china cup, a shadow of future or feeling. Tea & Tasseomancy hosts cosy gatherings where stories rise in steam and leaves speak in riddles. Folk divination at its most intimate - half reading, half reverie.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "The Albany",
    "location": "Deptford",
    "moods": [
      "curious",
      "tender",
      "punchy",
      "sacred"
    ],
    "genres": [
      "theatre",
      "spoken word",
      "jazz",
      "cross-cultural"
    ],
    "url": "https://www.thealbany.org.uk",
    "blurb": "South East London's beating cultural heart, platforming local artists and driving creative participation rooted in social justice and community care.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "The Arcanist's Tavern",
    "location": "Shoreditch",
    "moods": [
      "magical",
      "theatrical",
      "story-rich",
      "cosy"
    ],
    "genres": [
      "tabletop RPGs",
      "D&D",
      "Blades in the Dark",
      "board games",
      "miniature wargames"
    ],
    "url": "https://arcaniststavern.uk/",
    "blurb": "Behind a candlelit doorway in Shoreditch, the threshold shimmers. Step through and you've crossed into a realm of potions, quests, and dice-carved fate. The Arcanist's Tavern weaves fantasy into every corner: The Apothecary shelves groan with indie games and craft brews, The Guild Hall's wargaming tables bloom with painted terrain, and The Archives offer sound-dampened sanctuaries for deep roleplay. This is D&D made flesh, where every roll matters and every stranger might be your party.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "The Betsey Trotwood",
    "location": "Clerkenwell",
    "moods": [
      "poetic",
      "folk",
      "intimate"
    ],
    "genres": [
      "folk",
      "poetry",
      "comedy"
    ],
    "url": "https://www.thebetsey.com/",
    "last_verified": "2025-11-17",
    "blurb": "A Clerkenwell pub with a poet's soul, The Betsey Trotwood is a lantern for London's folk and word scenes. Downstairs, gigs glow with candlelit intimacy — singer-songwriters, poets, comedians, all held close in the hush. Upstairs, the beer flows and the stories get louder. Come for the ballad, stay for the belonging."
  },
  {
    "name": "The Bhavan",
    "location": "West Kensington",
    "moods": [
      "sacred",
      "global"
    ],
    "genres": [
      "Indian classical",
      "dance",
      "sitar"
    ],
    "url": "https://www.bhavan.net/",
    "blurb": "The UK's premier Indian arts centre, celebrating over 50 years of cultural legacy through classical dance, sitar concerts, and sacred philosophy.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "The Bill Murray (Angel Comedy)",
    "location": "Islington (Barnsbury)",
    "moods": [
      "irreverent",
      "playful",
      "community-driven"
    ],
    "genres": [
      "stand-up",
      "improv",
      "podcasts",
      "work-in-progress shows"
    ],
    "url": "angelcomedy.co.uk/bill‑murray",
    "blurb": "A beloved misfit of the Islington comedy scene, The Bill Murray is part pub, part playground for the sharp, the strange, and the up-too-late. Run by Angel Comedy, it hosts everything from chaotic work-in-progress nights to polished stand-up with cult favourites. Expect sweat, snorts, and the occasional existential crisis with your pint. For the petal who likes their laughter with a side of weird.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "The Camden Club",
    "location": "Chalk Farm (Camden)",
    "moods": [
      "relaxed",
      "neighbourhood-feel"
    ],
    "genres": [
      "blues",
      "rock",
      "acoustic",
      "jazz"
    ],
    "url": "thecamdenclub.co.uk/whats‑on/open‑music‑jam",
    "blurb": "In the hush before the first chord, Camden Club waits — polished, low-lit, and warm with promise. Here, guitarists trade licks like old stories, and the mic is always open to the brave. Blues, jazz, and rock wind through the air like cigarette smoke from another era. Pull up a cocktail, settle into the sound, and let the night unfold.",
    "last_verified": "2025-11-23",
    "features": [
      "jam-friendly"
    ]
  },
  {
    "name": "The College of Psychic Studies - Esoteric Courses",
    "location": "Kensington",
    "moods": [
      "mystical",
      "curious",
      "gentle"
    ],
    "genres": [
      "tarot",
      "divination",
      "astrology",
      "psychic development"
    ],
    "url": "https://www.collegeofpsychicstudies.co.uk/",
    "blurb": "Established in 1884, this Victorian townhouse carries a hush of otherworldliness. The College's courses unfold through tarot, astrology, mediumship - paths both gentle and uncanny. For those who feel the veil thin and wish to step through with reverence, this is a doorway long-held open.",
    "last_verified": "2025-11-23",
    "features": [
      "historic"
    ]
  },
  {
    "name": "The Fermentarium (Festive Lactic Fermentation Workshop)",
    "location": "Walthamstow",
    "moods": [
      "adult play",
      "craft & making",
      "curious"
    ],
    "genres": [
      "fermentation",
      "pickling"
    ],
    "url": "https://www.thefermentarium.org.uk/event/lactic-fermentation-festive-special",
    "blurb": "In the warm belly of Walthamstow, beneath winter's hush, the Hornbeam Café hosts a ritual of bubbling jars and spiced roots. Anna, keeper of brines, invites curious hands to conjure chutney and mulled ferments by candlelight. It is both kitchen and altar - the clink of spoons, the scent of cloves, the promise of transformation sealed in glass. A seasonal spell for the curious of palate and heart.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "The Fermentarium (Kimchi Masterclass)",
    "location": "Walthamstow",
    "moods": [
      "craft & making",
      "curious",
      "earthy"
    ],
    "genres": [
      "fermentation",
      "Korean food"
    ],
    "url": "https://www.thefermentarium.org.uk/event/kimchi-masterclass",
    "blurb": "At the Fermentarium's hearth, the spirit of Seoul simmers. Cabbage weeps, garlic sings, and gochugaru flares red as winter embers. This kimchi masterclass is fermentation as firelight - not factory, but family. Fingers mix memory, spice marks skin, and every jar is a pact between land and longing.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "The Garden Cinema",
    "location": "Covent Garden",
    "moods": [
      "tender",
      "curious"
    ],
    "genres": [
      "art house",
      "foreign language"
    ],
    "url": "https://www.thegardencinema.co.uk",
    "blurb": "An independent cinema opened in 2022 with art-deco features, emphasizing art-house foreign-language films that deserve to be seen.",
    "last_verified": "2025-11-17"
  },
  {
    "name": "The Ginger Pig - Sausage Making Class",
    "location": "Borough Market (SE1)",
    "moods": [
      "craft & making",
      "epicurean"
    ],
    "genres": [
      "sausage/charcuterie"
    ],
    "url": "https://thegingerpig.co.uk/events/sausage-making-class-saturday-22nd-november-2025/",
    "blurb": "Borough Market glows golden as dusk falls, and within it, The Ginger Pig sharpens its knives. In this carnivore's chapel, Josie teaches the art of sausage-making: pork, herbs, stuffing, and tying - all by hand. There's apricot and thyme, laughter and lard, and a feast to close the night. You'll leave with kilos of your own making - and the memory of meat transformed by care.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "The Harrison",
    "location": "King's Cross",
    "moods": [
      "folk",
      "curious"
    ],
    "genres": [
      "folk",
      "psych-folk",
      "jazz",
      "electronica"
    ],
    "url": "https://harrisonvenuelondon.com",
    "blurb": "An intimate venue famous for all-day folk festivals since 2011, hosting emerging and established artists alongside free Brazilian and Irish sessions.",
    "last_verified": "2025-11-17"
  },
  {
    "name": "The Ivy House",
    "location": "Nunhead",
    "moods": [
      "earthy",
      "playful"
    ],
    "genres": [
      "punk",
      "poetry",
      "jazz"
    ],
    "url": "https://www.ivyhousenunhead.com",
    "blurb": "London's first community-owned pub, a Grade II-listed treasure offering everything from punk to poetry and Sunday jazz.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "The Jazz Café",
    "location": "Camden",
    "moods": [
      "ecstatic",
      "earthy"
    ],
    "genres": [
      "jazz",
      "soul",
      "reggae",
      "world music",
      "hip-hop"
    ],
    "url": "https://thejazzcafelondon.com/",
    "blurb": "A 450-capacity Camden institution hosting a broad spectrum from jazz and soul to reggae and hip-hop since 1990.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "The Last Tuesday Society - Scrying Workshop with Lucya Starza",
    "location": "Hackney",
    "moods": [
      "witchy",
      "mysterious",
      "Victorian"
    ],
    "genres": [
      "scrying",
      "divination",
      "traditional witchcraft"
    ],
    "url": "https://thelasttuesdaysociety.org/exhibition/scrying-workshop-with-lucya-starza-live-3/",
    "blurb": "Behind the crimson curtains of Viktor Wynd's Museum, mirrors darken and bowls shimmer. In this esoteric enclave, Lucya Starza leads a workshop on scrying - that ancient art of seeing by shadow. Smoke curls. Water stills. What emerges is not forecast but reflection, pulled from silver surface and ancestral dream. It is witchcraft as wonder: eccentric, reverent, and edged with the otherworld.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "The Last Tuesday Society - Wicked Wednesdays: Tarot Readings with Tobias",
    "location": "Hackney",
    "moods": [
      "decadent",
      "intimate",
      "occult"
    ],
    "genres": [
      "tarot divination"
    ],
    "url": "https://thelasttuesdaysociety.org/exhibition/wicked-wednesdays-tarot-reading-with-tobias-devils-botany-live-3/",
    "blurb": "Step into the green glow of the Absinthe Parlour, where velvet shadows gather and Tobias shuffles the deck with a devil's grin. These Wednesday readings are less fortune-telling, more flirtation with the fates - intimate, peculiar, laced with the Society's signature mischief. Tarot here is both performance and portal. Drink in hand, you may just leave with more questions than answers. Perfect.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "The Lexi Cinema",
    "location": "Kensal Rise",
    "moods": [
      "tender",
      "curious"
    ],
    "genres": [
      "independent film",
      "social purpose"
    ],
    "url": "https://thelexicinema.co.uk",
    "blurb": "London's only social-enterprise cinema, a volunteer-run boutique picturehouse championing films with social purpose and supporting international projects.",
    "last_verified": "2025-11-17"
  },
  {
    "name": "The Lexington",
    "location": "King's Cross",
    "moods": [
      "sweaty",
      "grassroots",
      "spirited"
    ],
    "genres": [
      "alternative rock",
      "pop-quizzes",
      "punk",
      "club nights"
    ],
    "url": "https://thelexington.co.uk",
    "blurb": "The Lexington hums like an old guitar amp warming to life — half bar, half shrine to sound. Upstairs, the wide stage draws in alt-rock apostles and pop-quiz pilgrims alike, bathed in amber light and bourbon spirit. There's no bad seat here — only a nearness, a nearness to something raw and real. Late nights linger like feedback, and the walls remember your name.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "The London Leather Workshop",
    "location": "Woolwich",
    "moods": [
      "tactile",
      "heritage"
    ],
    "genres": [
      "beginners leathercraft",
      "handbag design",
      "saddle stitching",
      "professional pattern making"
    ],
    "url": "https://www.thelondonleatherworkshop.com",
    "blurb": "Among the brickwork bones of Woolwich Dockyard, tradition is sewn into supple leather. The London Leather Workshop teaches with Italian precision and artisan soul - a place where hides become heirlooms and stitches follow ancient paths. Each cut speaks of care, each thread a tether to time.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "The London Loom",
    "location": "Hackney",
    "moods": [
      "playful",
      "nostalgic"
    ],
    "genres": [
      "freestyle weaving",
      "tapestry weaving",
      "backstrap weaving",
      "basket weaving"
    ],
    "url": "https://thelondonloom.com",
    "blurb": "Thread your way into the bright heart of Hackney, where The London Loom invites you to weave without rules. Floor looms beckon like giant toys, yarns spill across tables, and your fingers are free to dance. Here, pattern is a memory, not a master. Come play, come make, come tangle and delight.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "The Ludoquist",
    "location": "Croydon",
    "moods": [
      "cosy",
      "curious",
      "family-friendly",
      "strategic"
    ],
    "genres": [
      "board games",
      "Dungeons & Dragons",
      "Arkham Horror",
      "trading card games"
    ],
    "url": "https://www.theludoquist.com/",
    "blurb": "Croydon's warmest hoard of dice and dreams — where campaign nights drift past closing time, and the shelves hold a thousand stories waiting to be played.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "The Others",
    "location": "Stoke Newington (Hackney)",
    "moods": [
      "jammy",
      "bohemian",
      "communal"
    ],
    "genres": [
      "jam sessions",
      "spoken word",
      "multi-genre gigs",
      "cabaret"
    ],
    "url": "theothers.uk.com",
    "blurb": "Step through a nondescript door and up into a candlelit dream. The Others is a shifting hearth for souls who speak in rhythm and rhyme. Guitars pass hand to hand, verses catch fire, and the room blooms with spontaneous magic. It's part bohemian attic, part alchemist's den — the sort of place where anything might happen, and often does.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "The Phoenix Arts Club",
    "location": "Soho",
    "moods": [
      "cabaret",
      "queer"
    ],
    "genres": [
      "cabaret",
      "drag",
      "musical theatre",
      "burlesque"
    ],
    "url": "https://phoenixartsclub.com",
    "blurb": "London's legendary venue for cabaret and variety, presenting nightly drag, musical theatre, and burlesque shows to 100,000 cabaret lovers yearly.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "The Place",
    "location": "King's Cross",
    "moods": [
      "movement",
      "curious"
    ],
    "genres": [
      "contemporary dance"
    ],
    "url": "https://theplace.org.uk",
    "blurb": "A creative powerhouse for dance, home to London Contemporary Dance School and one of Europe's most innovative spaces for boundary-pushing work.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "The Poetry Café",
    "location": "Covent Garden (Camden)",
    "moods": [
      "cosy",
      "reflective",
      "open-minded"
    ],
    "genres": [
      "spoken word",
      "poetry readings",
      "open mic",
      "book launches"
    ],
    "url": "https://poetrysociety.org.uk/venue/poetry-cafe",
    "blurb": "Tucked down a quiet lane in Covent Garden, The Poetry Café is a hush with a heartbeat — home to open mics, quiet revolutions, and lines that linger. Run by The Poetry Society, it hosts readings, workshops, and the kind of conversations that unfold like verse. The tea is hot, the lights are low, and the words are waiting.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "The Slaughtered Lamb",
    "location": "Clerkenwell",
    "moods": [
      "folk",
      "intimate"
    ],
    "genres": [
      "folk",
      "Americana",
      "roots"
    ],
    "url": "https://www.urbanpubsandbars.com/venues/slaughtered-lamb",
    "blurb": "An acoustic haven in a Clerkenwell basement where audiences and performers mingle closely beneath low ceilings and a small corner stage.",
    "last_verified": "2025-11-17"
  },
  {
    "name": "The Social",
    "location": "Fitzrovia",
    "moods": [
      "playful",
      "rebellious"
    ],
    "genres": [
      "live music",
      "DJs"
    ],
    "url": "https://thesocial.com",
    "blurb": "A beloved bar designed by David Adjaye, somewhere between modern speakeasy and home-from-home local, hosting intimate gigs and frenetic DJ sets.",
    "last_verified": "2025-11-17"
  },
  {
    "name": "The Sound Lounge",
    "location": "Sutton",
    "moods": [
      "folk",
      "tender"
    ],
    "genres": [
      "blues",
      "Americana",
      "folk",
      "roots"
    ],
    "url": "https://thesoundlounge.org.uk",
    "blurb": "A carbon-neutral haven for roots music, where vinyl spins and voices rise gently over plant-based plates and communal warmth.",
    "notes": "Relocated from Tooting to Sutton High Street",
    "last_verified": "2025-11-15"
  },
  {
    "name": "The Space",
    "location": "Isle of Dogs",
    "moods": [
      "sacred",
      "intimate",
      "thoughtful"
    ],
    "genres": [
      "theatre",
      "workshops",
      "festivals"
    ],
    "url": "http://www.space.org.uk",
    "blurb": "A converted 19th-century church offering atmospheric performances and workshops, where stone walls hold echoes of both prayer and art.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "The Tabernacle",
    "location": "Notting Hill",
    "moods": [
      "sacred",
      "global"
    ],
    "genres": [
      "live music",
      "theatre",
      "world music"
    ],
    "url": "https://www.thetabernaclew11.com/",
    "blurb": "A Grade II-listed former church turned arts centre, still resonating with Caribbean Carnival roots and cross-cultural programming.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "The Viaduct",
    "location": "Hanwell",
    "moods": [
      "comic",
      "nostalgic"
    ],
    "genres": [
      "comedy"
    ],
    "url": "https://www.viaduct-hanwell.co.uk",
    "blurb": "A historic coaching inn from 1737, famous for its upstairs Bearcat Comedy Night and warm, family-friendly atmosphere.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Theatre Peckham",
    "location": "Peckham",
    "moods": [
      "voice",
      "curious"
    ],
    "genres": [
      "youth theatre",
      "spoken word"
    ],
    "url": "https://www.theatrepeckham.co.uk",
    "blurb": "A multi-award-winning venue championing artistic excellence and social change, amplifying young voices and platforming community experiences.",
    "last_verified": "2025-11-17"
  },
  {
    "name": "Therapeutic Yoga Community Group – Jane O'Rourke",
    "location": "Down to Earth Yoga, N19",
    "moods": [
      "gentle",
      "trauma-informed"
    ],
    "genres": [
      "restorative yoga",
      "mindfulness",
      "sound"
    ],
    "url": "https://janeorourke.com/what-i-do/theraputic-yoga/therapeutic-yoga-community-group/",
    "blurb": "In candlelight or soft morning sun, this yoga practice becomes a form of prayer. Trauma-informed, body-honouring, breath-led — Jane's sessions are less about poses and more about presence. Expect nervous system kindness, deep exhale, and the possibility of coming home to yourself.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Top Cuvée / Shop Cuvée - Natural Wine Masterclass",
    "location": "Shoreditch (E1)",
    "moods": [
      "epicurean",
      "curious",
      "adult play"
    ],
    "genres": [
      "natural wine tasting"
    ],
    "url": "https://www.shopcuvee.com/pages/natural-wine-masterclass",
    "blurb": "Shoreditch's wine den wears no airs - just candlelight, laughter, and glasses that breathe. In this tenderly unruly masterclass, five natural wines unfold like characters in a play, each with its wild edge and wounded grace. A host murmurs tales of soil and maker, grape and gut. Come curious, leave changed. This is not drinking - it's listening, glass to lips.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Tramshed",
    "location": "Woolwich",
    "moods": [
      "family-friendly",
      "curious"
    ],
    "genres": [
      "community theatre",
      "youth programming"
    ],
    "url": "https://tramshed.org",
    "blurb": "A community arts hub using performing arts to serve young people and adults with learning differences, fostering social cohesion through creativity.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Treadwell's Bookshop - Witchcraft Classes",
    "location": "Fitzrovia",
    "moods": [
      "witchy",
      "occult",
      "esoteric",
      "gothic"
    ],
    "genres": [
      "witchcraft",
      "practical magic",
      "ritual",
      "history"
    ],
    "url": "https://www.treadwells-london.com/",
    "blurb": "Behind the dusky glass and whispered shelves, Treadwell's gathers the curious and the initiated alike. Its witchcraft classes thread ritual with history, herbs with symbols. This is no marketplace of tricks - but a library of power, quietly lit, where magic is studied, respected, and made real.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "TT London - Whisky Tasting Experience",
    "location": "Studios in North London",
    "moods": [
      "craft & making",
      "adult play"
    ],
    "genres": [
      "whisky tasting"
    ],
    "url": "https://tt-london.co.uk/tastings/whisky-tasting-london/",
    "blurb": "In a North London studio, alchemy is sipped, not spilled. Seven whiskies - smoky, honeyed, brash and shy - are poured like myth into glass, each one a map of time and terrain. A cocktail to begin, and then a slow descent into the oak-aged depths. This is no frat boy fire - it's reverence in amber. For those who taste memory on the tongue.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Turner & George - Beef Butchery Class",
    "location": "Clerkenwell",
    "moods": [
      "craft & making",
      "epicurean"
    ],
    "genres": [
      "meat butchery"
    ],
    "url": "https://www.turnerandgeorge.co.uk/beef-class",
    "blurb": "When the butcher's lights dim, four aprons await. At Turner & George, this after-hours session slices straight into the primal - a whole fore-rib of beef, broken down by your hands and the master's blade. Each cut is explained with reverence. Then comes the feast: a steak dinner with wine, and parcels of meat to carry home like trophies. A carnivore's catechism, quietly taught in bone and flame.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Umbrella Workshop - Irish Whiskey Tasting",
    "location": "Shoreditch",
    "moods": [
      "adult play",
      "epicurean",
      "community"
    ],
    "genres": [
      "Irish whiskey",
      "PoitÃ­n"
    ],
    "url": "https://theumbrellaproject.co.uk/tastings/",
    "blurb": "Hidden behind Shoreditch's bustle, the Umbrella Workshop whispers warmth. Here, twelve souls gather in the hush of cut glass and cured meats, their lips kissed by Poitín and Irish malts. There is nothing rushed - only stories steeped in smoke, small pours poured with purpose, and a lingering that becomes its own devotion. The night folds in like a cloak. Let it.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Union Chapel",
    "location": "Islington",
    "moods": [
      "sacred",
      "wonder"
    ],
    "genres": [
      "concerts",
      "film",
      "comedy",
      "spoken word"
    ],
    "url": "https://unionchapel.org.uk/",
    "blurb": "A working church and not-for-profit performance space where gothic architecture and exceptional acoustics frame diverse programming.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Viktor Wynd Museum",
    "location": "Hackney",
    "moods": [
      "witchy",
      "haunted",
      "ritual"
    ],
    "genres": [
      "curiosities",
      "occult events",
      "talks"
    ],
    "url": "https://thelasttuesdaysociety.org/",
    "last_verified": "2025-11-17",
    "blurb": "Part cabinet of curiosities, part occult parlour, The Viktor Wynd Museum is Hackney's most deliciously haunted corner. Taxidermy, erotica, bones and bottled oddities — every inch whispers. Beneath it all, candlelit talks and ritual nights conjure the weird and the wondrous. Enter if you dare… and if you delight in the macabre."
  },
  {
    "name": "Village Underground",
    "location": "Shoreditch",
    "moods": [
      "rebellious",
      "ecstatic"
    ],
    "genres": [
      "electronic",
      "indie",
      "experimental"
    ],
    "url": "https://www.villageunderground.co.uk",
    "blurb": "A renovated Victorian warehouse topped with hollowed-out Jubilee line carriages, offering a blank canvas for independent arts and music.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Vortex Jazz Club",
    "location": "Dalston (Hackney)",
    "moods": [
      "soulful",
      "intimate",
      "improvisational"
    ],
    "genres": [
      "modern jazz",
      "world music",
      "jam sessions"
    ],
    "url": "vortexjazz.co.uk",
    "blurb": "The Vortex doesn't just host jazz — it breathes it. Inside this Dalston corner, melody and memory blur as horns wail and cymbals shiver. It's a space where strangers nod in time and improvisation leads the way. Sunday jams spill warmth like whisky, and every evening feels like a secret kept in plain sight.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "We Make Books",
    "location": "Stoke Newington",
    "moods": [
      "craft & making",
      "curious",
      "nostalgic"
    ],
    "genres": [
      "bookbinding",
      "zine-making",
      "Tetrapak printmaking"
    ],
    "url": "https://wemakebooks.co.uk",
    "blurb": "Tucked into the quiet curve of Belfast Road, We Make Books offers a sanctuary for the book-obsessed and curious of hand. Here, you'll stitch Belgian secrets, press Tetrapak prints, and conjure zines with quiet care. The ink smells of story; the folded paper holds memory. It's a space for slow making - deliberate, tactile, a hymn to the enduring spell of craft.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Wheel of Consent Weekend Workshop",
    "location": "Private studio in London (exact location shared with participants upon booking)",
    "moods": [
      "introspective",
      "empowering",
      "supportive"
    ],
    "genres": [
      "consent education",
      "somatic awareness",
      "sensuality"
    ],
    "url": "https://dandelion.events/e/n283o",
    "blurb": "Beneath every touch is a question: Is this for you, or for me? In this quiet, potent weekend, participants learn to name their desires, honour their boundaries, and listen with their whole being. The Wheel of Consent isn't just a framework - it's a doorway to deeper, kinder knowing.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Wild Food UK - Foraging Courses",
    "location": "Hampstead",
    "moods": [
      "wild",
      "earthy",
      "curious"
    ],
    "genres": [
      "foraging",
      "wild foods",
      "botany"
    ],
    "url": "https://www.wildfooduk.com/foraging-trips/london/",
    "blurb": "Among Hampstead's tangled roots and hedgerows, a different kind of wisdom grows. Led by Wild Food UK, these foraging walks trace edible stories across bark and bramble - mushrooms like hidden prayers, greens with ancient names. You'll never look at nettles the same again. This is London as larder, wild and whispering.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Wilton's Music Hall",
    "location": "Whitechapel",
    "moods": [
      "haunted",
      "candlelit"
    ],
    "genres": [
      "theatre",
      "music"
    ],
    "url": "https://wiltons.org.uk",
    "blurb": "The oldest surviving Grand Music Hall in the world, a Grade II* listed building staging extraordinary theatre and music in candlelit atmosphere.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "Wonders of the Dark Sky - Woodoaks Farm Stargazing",
    "location": "Woodoaks Farm, Maple Cross, Hertfordshire (north-west Greater London)",
    "moods": [
      "dark sky",
      "curious",
      "wild"
    ],
    "genres": [
      "stargazing",
      "astronomy walk"
    ],
    "url": "https://www.colnevalleypark.org.uk/event/wonders-of-the-dark-sky-2025/",
    "blurb": "At Woodoaks Farm, the stars return. Far from London's glare, telescopes are trained on Saturn's rings and galaxy light. It's a one-night reverence for the cosmos - where skywatchers gather by lantern and thermos, and the night stretches vast, ancient, and alight with possibility.",
    "last_verified": "2025-11-23"
  },
  {
    "name": "Woolwich Works",
    "location": "Woolwich",
    "moods": [
      "group energy",
      "ecstatic"
    ],
    "genres": [
      "contemporary music",
      "comedy",
      "theatre",
      "dance"
    ],
    "url": "https://www.woolwich.works",
    "blurb": "Time Out's 'best new culture spot,' a multi-disciplinary hub on the Royal Arsenal championing contemporary music, theatre, and dance.",
    "last_verified": "2025-11-15"
  },
  {
    "name": "FOLD",
    "location": "Canning Town",
    "url": "https://fold.london",
    "blurb": "A 600-capacity warehouse with a 6am licence and Funktion-One sound system, where the night stretches until dawn and techno pilgrims gather for marathon sets.",
    "moods": [
      "Big Night Out",
      "Late-Night Lark",
      "Rebellious"
    ],
    "genres": [
      "techno",
      "house",
      "electronic"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "Corsica Studios",
    "location": "Elephant & Castle",
    "url": "https://corsica-studios.com",
    "blurb": "Twin railway arches beneath Elephant & Castle, a non-profit sanctuary where underground electronic music echoes off brick walls until the early hours.",
    "moods": [
      "Late-Night Lark",
      "Curious Encounters",
      "Rebellious"
    ],
    "genres": [
      "electronic",
      "experimental",
      "techno"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "Venue MOT Unit 18",
    "location": "Barking",
    "url": "https://linktr.ee/venMOT",
    "blurb": "A grungy warehouse space in Barking where east London's underground gathers, sweat drips from industrial ceilings, and the music pounds until daybreak.",
    "moods": [
      "Big Night Out",
      "Late-Night Lark",
      "Wild Becoming"
    ],
    "genres": [
      "electronic",
      "house",
      "techno"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "Servant Jazz Quarters",
    "location": "Dalston",
    "url": "https://www.servantjazzquarters.com",
    "blurb": "A basement jazz club where smoke curls through low ceilings, intimate tables cluster around a tiny stage, and the music breathes past midnight.",
    "moods": [
      "Jazz & Contemplation",
      "Late-Night Lark",
      "Melancholic Beauty"
    ],
    "genres": [
      "jazz",
      "soul",
      "blues"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "The Old Blue Last",
    "location": "Shoreditch",
    "url": "https://theoldbluelast.com",
    "blurb": "A legendary Shoreditch pub where Vice Magazine once held court, now hosting gritty indie gigs and late-night DJ sets in sweat-soaked intimacy.",
    "moods": [
      "Late-Night Lark",
      "Rebellious",
      "Nostalgic / Vintage / Retro"
    ],
    "genres": [
      "indie",
      "punk",
      "alternative"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "The Victoria (JaguarShoes)",
    "location": "Dalston",
    "url": "https://www.jaguarshoes.com",
    "blurb": "A Dalston institution where the backroom transforms into a sweaty dance cave, and eclectic DJ sets stretch from dusk until the trains start running.",
    "moods": [
      "Late-Night Lark",
      "Big Night Out",
      "Playful & Weird"
    ],
    "genres": [
      "electronic",
      "indie",
      "DJ sets"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "The George Tavern",
    "location": "Stepney",
    "url": "https://www.thegeorgetavern.co.uk",
    "blurb": "A Grade II-listed East End institution where Victorian ghosts mingle with live music until late, the spirit of old London pulsing through wooden beams and worn floors.",
    "moods": [
      "Nostalgic / Vintage / Retro",
      "Late-Night Lark",
      "Folk & Intimate"
    ],
    "genres": [
      "live music",
      "folk",
      "indie"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "TOLA Peckham",
    "location": "Peckham",
    "url": "https://www.tolapeckham.com",
    "blurb": "An artist-led bar beneath railway arches where vinyl spins, natural wine flows, and the night unfolds in candlelit warmth until the small hours.",
    "moods": [
      "Late-Night Lark",
      "Folk & Intimate",
      "Curious Encounters"
    ],
    "genres": [
      "vinyl bar",
      "natural wine",
      "live music"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "Grow Hackney",
    "location": "Hackney Wick",
    "url": "https://growhackney.com",
    "blurb": "A canal-side haven where sustainability meets nightlife, solar-powered sound systems hum until dawn, and dancers gather beneath the stars.",
    "moods": [
      "Late-Night Lark",
      "Curious Encounters",
      "Wild Becoming"
    ],
    "genres": [
      "electronic",
      "house",
      "techno"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "Prince Charles Cinema",
    "location": "Leicester Square",
    "url": "https://princecharlescinema.com",
    "blurb": "Where cult classics and midnight marathons thrive, this independent cinema hosts all-night screenings for those who refuse to sleep when cinema beckons.",
    "moods": [
      "Late-Night Lark",
      "Nostalgic / Vintage / Retro",
      "Playful & Weird"
    ],
    "genres": [
      "cinema",
      "cult films",
      "marathons"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "TwickFolk at The Cabbage Patch",
    "location": "Twickenham",
    "url": "https://www.twickfolk.co.uk",
    "blurb": "A volunteer-run folk club thriving since 1983, where voices rise over acoustic guitars in a Twickenham pub, keeping the old songs alive.",
    "moods": [
      "Folk & Intimate",
      "Nostalgic / Vintage / Retro",
      "Community"
    ],
    "genres": [
      "folk",
      "acoustic",
      "traditional"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "Park Royal Design District",
    "location": "Park Royal",
    "url": "https://www.parkroyaldesigndistrict.co.uk",
    "blurb": "A creative quarter housing 250+ artist studios in converted industrial buildings, where open studios and exhibitions invite you into working creative minds.",
    "moods": [
      "Curious Encounters",
      "The Thoughtful Stage",
      "Community"
    ],
    "genres": [
      "visual arts",
      "studios",
      "exhibitions"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "Bollo Studios",
    "location": "Acton",
    "url": "https://www.bollobrook.com",
    "blurb": "Artist studios and gallery space in Acton where ceramicists, painters, and makers open their doors to visitors, creativity spilling into the street.",
    "moods": [
      "Curious Encounters",
      "Community",
      "The Thoughtful Stage"
    ],
    "genres": [
      "visual arts",
      "ceramics",
      "workshops"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "Foster Books",
    "location": "Chiswick",
    "url": "https://www.fosterbooks.net",
    "blurb": "An 18th-century Chiswick bookshop where rare volumes and literary events gather, the scent of old paper mixing with new ideas.",
    "moods": [
      "Nostalgic / Vintage / Retro",
      "The Thoughtful Stage",
      "Poetic"
    ],
    "genres": [
      "bookshop",
      "literary events",
      "readings"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "Lloyds of Kew",
    "location": "Kew",
    "url": "https://lloydskew.co.uk",
    "blurb": "A rare and antiquarian bookshop specializing in botanical and horticultural texts, where leather-bound gardens bloom on every shelf.",
    "moods": [
      "Nostalgic / Vintage / Retro",
      "Curious Encounters",
      "The Thoughtful Stage"
    ],
    "genres": [
      "bookshop",
      "antiquarian",
      "botanical"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "The Open Book",
    "location": "Richmond",
    "url": "https://www.theopenbookrichmond.co.uk",
    "blurb": "A Richmond bookshop and café where literary discussions unfold over coffee, author events draw local crowds, and books become conversation.",
    "moods": [
      "The Thoughtful Stage",
      "Community",
      "Poetic"
    ],
    "genres": [
      "bookshop",
      "café",
      "literary events"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "Pitshanger Bookshop",
    "location": "Ealing",
    "url": "https://www.pitshangerbooks.co.uk",
    "blurb": "An Ealing bookshop hosting readings, book clubs, and writing workshops, where words gather communities and stories find their people.",
    "moods": [
      "The Thoughtful Stage",
      "Poetic",
      "Community"
    ],
    "genres": [
      "bookshop",
      "book clubs",
      "workshops"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "The Sheen Bookshop",
    "location": "East Sheen",
    "url": "https://www.thesheenbookshop.co.uk",
    "blurb": "A cosy East Sheen bookshop with storytelling sessions, author talks, and community warmth radiating from every carefully curated shelf.",
    "moods": [
      "Community",
      "The Thoughtful Stage",
      "Wonder & Awe"
    ],
    "genres": [
      "bookshop",
      "storytelling",
      "author events"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "All Good Bookshop",
    "location": "Wood Green",
    "url": "https://www.allgoodbookshop.co.uk",
    "blurb": "A worker co-operative bookshop in Wood Green hosting open mics, zine fairs, and radical readings, where community ownership means genuine care.",
    "moods": [
      "Punchy / Protest",
      "Community",
      "Poetic"
    ],
    "genres": [
      "bookshop",
      "open mic",
      "zines"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "OPEN Ealing",
    "location": "Ealing",
    "url": "https://www.openealing.com",
    "blurb": "A multi-arts venue in central Ealing presenting theatre, music, comedy, and film, where creativity meets accessibility in West London.",
    "moods": [
      "Curious Encounters",
      "The Thoughtful Stage",
      "Comic Relief"
    ],
    "genres": [
      "theatre",
      "music",
      "comedy"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "Kiln Theatre",
    "location": "Kilburn",
    "url": "https://kilntheatre.com",
    "blurb": "Formerly Tricycle Theatre, now Kiln, where stories from around the world take centre stage in a Kilburn venue committed to diverse voices and bold narratives.",
    "moods": [
      "The Thoughtful Stage",
      "Global Rhythms",
      "Curious Encounters"
    ],
    "genres": [
      "theatre",
      "new writing",
      "international"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "Studio Crumb",
    "location": "Deptford",
    "url": "https://www.dazeddigital.com/music/article/68108/1/dazed-guide-best-london-club-nights-in-2025-opia-fold-techno-latinx-reggaeton",
    "blurb": "A monthly vinyl-only party in The Bunker where DJ Haseeb Iqbal treats the dancefloor like a theatre, guiding dancers through spiritual deep-cuts and sonic histories.",
    "moods": [
      "Spiritual / Sacred / Mystical",
      "Folk & Intimate",
      "Nostalgic / Vintage / Retro"
    ],
    "genres": [
      "vinyl",
      "house",
      "jazz"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "Club Are",
    "location": "East London",
    "url": "https://www.clubare.co",
    "blurb": "A queer-founded multidisciplinary platform where sound, visual art, fashion, and community blur, each edition concept-driven and centring queer, trans, and non-binary voices.",
    "moods": [
      "Queer Revelry",
      "Curious Encounters",
      "Wild Becoming"
    ],
    "genres": [
      "progressive house",
      "techno",
      "performance art"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "Club Stamina",
    "location": "Various London",
    "url": "https://www.instagram.com/clubstamina",
    "blurb": "DJ Mina Galán's night championing femme and trans talent through reggaeton, baile funk, and perreo, an antidote to techno-heavy exclusionary scenes.",
    "moods": [
      "Queer Revelry",
      "Big Night Out",
      "Global Rhythms"
    ],
    "genres": [
      "reggaeton",
      "baile funk",
      "Latin club"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "MAS ARTS",
    "location": "Pop-up locations",
    "url": "https://www.instagram.com/masartslondon",
    "blurb": "A mobile sound system delivering pop-up raves to unexpected places, working with youth clubs and community organisations to bring music to the people.",
    "moods": [
      "Community",
      "Big Night Out",
      "Playful & Weird"
    ],
    "genres": [
      "hip-hop",
      "grime",
      "electronic"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "2C Perrea",
    "location": "East/South London",
    "url": "https://www.instagram.com/2cperrea",
    "blurb": "Queer-friendly reggaeton founded by Latinx migrants craving community, a safe space to reconnect with music from home and push Latin club boundaries.",
    "moods": [
      "Queer Revelry",
      "Global Rhythms",
      "Big Night Out"
    ],
    "genres": [
      "reggaeton",
      "Latin techno",
      "cumbia"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "Eastern Margins",
    "location": "Pop-up venues",
    "url": "https://easternmargins.com",
    "blurb": "Record label and events collective celebrating alternative music from East and Southeast Asia, where bootleg aesthetics and DIY rave meet physical communion.",
    "moods": [
      "Curious Encounters",
      "Big Night Out",
      "Global Rhythms"
    ],
    "genres": [
      "DIY rave",
      "East Asian club",
      "electronic"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "Tech Couture LDN",
    "location": "Canning Town",
    "url": "https://www.instagram.com/techcoutureLDN",
    "blurb": "Colourful techno party bringing self-expression and playful energy back to the dancefloor, platforming rising and established DJs with inclusive sweaty joy.",
    "moods": [
      "Big Night Out",
      "Playful & Weird",
      "Wild Becoming"
    ],
    "genres": [
      "techno",
      "house",
      "electro"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "Opia",
    "location": "East London",
    "url": "https://www.instagram.com/opia.London",
    "blurb": "Club night-turned cultural movement where glamour, fashion photography, and performance blur with rave, celebrating chaotic beauty and chosen family.",
    "moods": [
      "Cabaret & Glitter",
      "Wild Becoming",
      "Playful & Weird"
    ],
    "genres": [
      "fashion-rave",
      "cabaret",
      "performance"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "Queer House Party",
    "location": "Hackney",
    "url": "https://www.instagram.com/queerhouseparty",
    "blurb": "DIY collective merging safer accessible spaces with high-energy club nights, bringing politics back to the dancefloor and building global queer community.",
    "moods": [
      "Queer Revelry",
      "Punchy / Protest",
      "Big Night Out"
    ],
    "genres": [
      "house",
      "techno",
      "drag"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "Ceilidh Liberation Front",
    "location": "Grand Junction & various",
    "url": "https://thenestcollective.co.uk/projects/ceilidhs",
    "blurb": "The Nest Collective transforms traditional ceilidh into radical sweat-busting party, breathing vigour into folk dance while honouring its roots.",
    "moods": [
      "Folk & Intimate",
      "Big Night Out",
      "Playful & Weird"
    ],
    "genres": [
      "ceilidh",
      "folk",
      "traditional"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "Bootylicious",
    "location": "Union & Scala",
    "url": "https://bootyldn.com",
    "blurb": "Long-running LGBTQ+ club night serving Amapiano, Dancehall, Afrobeat, and RnB across multiple floors, a rave for queer people who love a good boogie.",
    "moods": [
      "Queer Revelry",
      "Big Night Out",
      "Global Rhythms"
    ],
    "genres": [
      "Amapiano",
      "Afrobeat",
      "Dancehall"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "Slimelight",
    "location": "Islington",
    "url": "https://www.slimelight.com",
    "blurb": "World-renowned dark scene club with three floors: industrial/EBM techno, goth/post-punk, and indie dance/dark disco, open until 6am with mandatory creative dress.",
    "moods": [
      "Witchy & Wild",
      "Big Night Out",
      "Rebellious"
    ],
    "genres": [
      "industrial",
      "EBM",
      "goth"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "Dark Scene London",
    "location": "Omeara, London Bridge",
    "url": "https://omearalondon.com",
    "blurb": "Summer soiree bringing together the dark music community across three floors: futurepop, darkwave, industrial, dark techno, and EBM until 5am.",
    "moods": [
      "Witchy & Wild",
      "Big Night Out",
      "Curious Encounters"
    ],
    "genres": [
      "darkwave",
      "industrial",
      "dark techno"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "Sanura Dance",
    "location": "Studio 68 & The Castle",
    "url": "https://www.sanuradance.com",
    "blurb": "Queer-run dance school where FLINTA and LGBTQ+ people learn to lead and follow in salsa and bachata, breaking traditional norms with weekly classes and monthly socials.",
    "moods": [
      "Queer Revelry",
      "Body-Based / Movement-Led",
      "Playful & Weird"
    ],
    "genres": [
      "salsa",
      "bachata",
      "Latin dance"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "DTMF! (Don't Touch My Fro!)",
    "location": "MOT Unit",
    "url": "https://www.instagram.com/dtmflondon",
    "blurb": "Underground collective playing afro-centric forward-facing grooves monthly, moving from house and acid to boogie and funk with healing soulful vibes.",
    "moods": [
      "Global Rhythms",
      "Big Night Out",
      "Body-Based / Movement-Led"
    ],
    "genres": [
      "house",
      "funk",
      "acid"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "Boudica",
    "location": "Canning Town",
    "url": "https://www.instagram.com/boudicaLDN",
    "blurb": "Queer-led platform blending dark techno, acid, and trance with protest energy, turning bodily autonomy into defiant celebration with chosen-family atmosphere.",
    "moods": [
      "Queer Revelry",
      "Punchy / Protest",
      "Wild Becoming"
    ],
    "genres": [
      "techno",
      "acid",
      "trance"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "Playbody Warehouse",
    "location": "Hackney Wick",
    "url": "https://www.instagram.com/playbody.LDN",
    "blurb": "Creative collective transforms warehouse into immersive celebration with installations, ambient sets, and live performances as ode to human connection.",
    "moods": [
      "Curious Encounters",
      "Community",
      "Playful & Weird"
    ],
    "genres": [
      "ambient",
      "experimental",
      "performance"
    ],
    "last_verified": "2025-11-24"
  },
  {
    "name": "Pink Singers",
    "location": "Central London",
    "moods": [
      "Group Energy",
      "Queer Revelry",
      "Word & Voice"
    ],
    "genres": [
      "LGBT+ community choir",
      "choral concerts"
    ],
    "url": "https://www.pinksingers.co.uk/",
    "blurb": "London's longest-running LGBT+ choir gathers like a small storm of harmony, shoulders touching, scores rustling, hearts very much awake. The Pink Singers keep queer history humming in real time: protest songs, pop choruses, tender arrangements that can leave you blinking back tears in the interval. If you want to feel your voice woven into a bigger, brighter rope of sound, this is one for the brave petal with a choir-shaped ache.",
    "last_verified": "2025-11-24"
  },
  {
    "name": "London Sacred Harp",
    "location": "Hampstead",
    "moods": [
      "Group Energy",
      "Spiritual / Sacred / Mystical",
      "Curious Encounters"
    ],
    "genres": [
      "Sacred Harp singing",
      "shape-note communal singing"
    ],
    "url": "https://londonsacredharp.org/",
    "blurb": "Sacred Harp is congregational singing in four parts, arranged in a square rather than a stage: everyone facing inward, everyone both audience and choir. There are no auditions and no performances to polish for, just songs called from a shared book and hurled joyfully into the air, a light-winged leap into wonder. Expect raw, shaking chords, a lark's clear call at dusk, and the odd miracle of strangers breathing as one.",
    "last_verified": "2025-11-24"
  },
  {
    "name": "Chickenshed Community Choir",
    "location": "Chickenshed Theatre and Christ the King",
    "moods": [
      "Group Energy",
      "Folk & Intimate",
      "Family-Friendly"
    ],
    "genres": [
      "community choir",
      "inclusive singing workshops"
    ],
    "url": "https://www.chickenshed.org.uk/workshops-and-classes",
    "blurb": "At Chickenshed, the choir feels like an extension of the theatre's beating heart: open doors, warm ushers, songs that make room for every kind of voice. Term-time sessions unfold in bright halls and church naves, notes that perch and stay even after people have gone home. If you're easing yourself back into singing after a long, quiet spell, this is a gentle place to test your wings.",
    "last_verified": "2025-11-24"
  },
  {
    "name": "South East London Queer Choir",
    "location": "Nunhead, South East London",
    "moods": [
      "Group Energy",
      "Queer Revelry",
      "Punchy / Protest"
    ],
    "genres": [
      "queer community choir",
      "street singing",
      "fundraiser performances"
    ],
    "url": "https://www.genevievedawson.com/community",
    "blurb": "In Nunhead, a queer choir gathers in borrowed rooms and spills out onto pavements for solidarity gigs, protests and a big winter street takeover. Books may be closed to new singers at times, but the sound still ripples through south-east London, borne aloft by quiet joy and a tailwind of mischief. For Larklings, this is one to follow, to stand beside, to hear what resistance sounds like when it's in four-part harmony.",
    "last_verified": "2025-11-24"
  },
  {
    "name": "Heart Song Collective CIC",
    "location": "South East London",
    "moods": [
      "Group Energy",
      "Grief & Grace",
      "Spiritual / Sacred / Mystical"
    ],
    "genres": [
      "singing for wellbeing",
      "queer-led choir circle"
    ],
    "url": "https://www.naturalvoice.net/choir/heart-song-collective-cic/",
    "blurb": "Heart Song Collective gathers queer and allied voices in a circle, not a line, held in a trauma-informed way and sung without gendered parts. Songs for co-regulation, breath, and soft presence; a hush shaped like birdsong more than a traditional choir practice. If your nervous system is tired of pushing through and needs somewhere to tremble and settle among friends, this is a nest of stories and string lights.",
    "last_verified": "2025-11-24"
  },
  {
    "name": "F*Choir",
    "location": "London (roaming across arts and community spaces)",
    "moods": [
      "Group Energy",
      "Queer Revelry",
      "Punchy / Protest"
    ],
    "genres": [
      "all-genders community choir",
      "queer liberation choir"
    ],
    "url": "https://fchoir.com/about/",
    "blurb": "F*Choir is less hymn book, more spell book: a 60-plus strong, all-genders choir singing about gender, sexuality, freedom and rage. Rehearsals are sweaty, laughing, political; performance nights feel like a gig crossed with a ritual, a cry soft as wingbeat and sometimes as loud as a siren. Ideal for the petal who wants their harmonies with teeth, their choruses circling closer to something true.",
    "last_verified": "2025-11-24"
  },
  {
    "name": "Sing For Freedom Choir",
    "location": "Central London",
    "moods": [
      "Group Energy",
      "Grief & Grace",
      "Global Rhythms"
    ],
    "genres": [
      "community choir",
      "refugee and allies choir"
    ],
    "url": "https://www.togetherproductions.co.uk/sff-public-page",
    "blurb": "A choir born from stories of exile and arrival, Sing For Freedom brings refugees, migrants and local Londoners into one shared sound. Concession schemes and subsidised spots keep the door propped open; songs travel from folk to contemporary, threads of sound spun midair between languages. Come if you need reminding that borders are human inventions and harmony is not.",
    "last_verified": "2025-11-24"
  },
  {
    "name": "London City Voices",
    "location": "Multiple locations across central London and online",
    "moods": [
      "Group Energy",
      "Big Night Out",
      "Word & Voice"
    ],
    "genres": [
      "non-audition community choir",
      "pop and rock repertoire"
    ],
    "url": "https://www.londoncityvoices.co.uk/",
    "blurb": "London City Voices is a big, bright sprawl of non-audition choirs meeting in hired halls after work, swapping laptops for lyric sheets. Expect upbeat pop, hands in the air, that flash of recognition when the person next to you also quietly knows every harmony. It's less hidden gem than friendly flock, but for some petals, this is exactly the soft landing they need.",
    "last_verified": "2025-11-24"
  },
  {
    "name": "Healing Choir",
    "location": "Kilburn, North West London",
    "moods": [
      "Group Energy",
      "Grief & Grace",
      "Poetic"
    ],
    "genres": [
      "community arts choir",
      "wellbeing-focused vocal circle"
    ],
    "url": "https://www.paprika.org.uk/healing-choir",
    "blurb": "In Kilburn, Healing Choir treats song as a kind of shared medicine: free to attend, open to all abilities, rooted in breath, movement and communal vocalisation. Sessions are more about how it feels in the body than how it sounds from the back row. If life has left you hoarse and you're looking for a room that will simply let you exhale and hum, this one waits with open arms.",
    "last_verified": "2025-11-24"
  },
  {
    "name": "Outer Circle Voice Circle",
    "location": "Peckham",
    "moods": [
      "Group Energy",
      "Playful & Weird",
      "Curious Encounters"
    ],
    "genres": [
      "experimental vocal workshop",
      "women and non-binary circle"
    ],
    "url": "https://setspace.uk/event/outer-circle-voice-circle-women-and-non-binary-vocal-workshop/",
    "blurb": "Outer Circle is an experimental vocal group for women and non-binary people, meeting monthly at SET Social Peckham to sing, breathe, shout and create together. It's explicitly not a choir: no auditions, no sheet music, just improvisation and a tailwind of surprise. Perfect if you want to explore what your voice can do beyond verses and choruses, gliding through alleys and arches of sound you didn't know you had.",
    "last_verified": "2025-11-24"
  },
  {
    "name": "Catford Community Choir",
    "location": "Catford",
    "moods": [
      "Group Energy",
      "Folk & Intimate",
      "Family-Friendly"
    ],
    "genres": [
      "local community choir",
      "library-based singing group"
    ],
    "url": "https://thevillagelondon.co.uk/service/catford-community-choir/",
    "blurb": "In a bright room at Corbett Community Library, neighbours gather between stacks and storybooks to sing their way through the week. Babies and toddlers are welcome to crawl, clatter and join in, turning rehearsal into a small domestic carnival. It's sheltered beneath the beams and warm as a robin's hollow: if you're looking for somewhere low-pressure and local to stretch your lungs, this is a gentle starting perch.",
    "last_verified": "2025-11-24"
  },
  {
    "name": "Theatre in the Pound",
    "location": "Marylebone (The Cockpit)",
    "moods": [
      "Group Energy",
      "Experimental / Avant-garde",
      "Curious Encounters"
    ],
    "genres": [
      "monthly scratch night",
      "new writing",
      "performance experiments"
    ],
    "url": "https://www.thecockpit.org.uk/article/theatre_in_the_pound",
    "blurb": "At The Cockpit, scratch is taken literally: theatre-makers rent the space for a pound a minute and fling 10–15 minute ideas into the dark, then listen as the room answers back. Theatre in the Pound is low-cost, not-for-profit and gloriously rough-feathered, a night where wild hunches and half-built scenes are carried on a breath of song. If you like the feeling of catching a show mid-moult, before it grows its final plumage, this is your roost, petal.",
    "last_verified": "2025-11-25"
  },
  {
    "name": "Big Bang Scratch Night",
    "location": "Camden (Camden People's Theatre)",
    "moods": [
      "Group Energy",
      "Playful & Weird",
      "Experimental / Avant-garde"
    ],
    "genres": [
      "regular scratch platform",
      "contemporary performance",
      "new writing"
    ],
    "url": "https://cptheatre.co.uk/whatson/Big-Bang-Scratch-Night-30-March-2025",
    "blurb": "Big Bang is Camden People's Theatre's ongoing experiment in controlled theatrical explosions: short bursts of brand-new work sharing a single orbit for one night only. Expect queer cabaret fragments, political performance, strange monologues and oddball dance-theatre, all fluttering toward the unfamiliar. It's the place to see tiny universes of theatre right at ignition, trembling with finchlight before they streak off elsewhere.",
    "last_verified": "2025-11-25"
  },
  {
    "name": "Scratch Renaissance",
    "location": "Mile End (Chisenhale Dance Space)",
    "moods": [
      "Group Energy",
      "Experimental / Avant-garde",
      "Body-Based / Movement-Led"
    ],
    "genres": [
      "dance and performance scratch",
      "artist-led",
      "marginalised voices"
    ],
    "url": "https://www.chisenhaledancespace.co.uk/scratch-renaissance/",
    "blurb": "At Chisenhale Dance Space, Scratch Renaissance is more than a one-off night: it's a year-long flock of evenings where emerging and marginalised artists test the edges of movement and performance. One month might hold queer dance rituals, the next a solo that drifts like a feather through evening, all shaped by an artist-led ethos and fair-pay agreements. Come if you like your work-in-progress sweaty, tender and willing to fall on its face in front of you, then rise with the thermals of curiosity.",
    "last_verified": "2025-11-25"
  },
  {
    "name": "Freshly Squeezed Scratch Night",
    "location": "Bethnal Green (St Margaret's House)",
    "moods": [
      "Group Energy",
      "Word & Voice",
      "Folk & Intimate"
    ],
    "genres": [
      "scripted new writing",
      "community arts scratch night"
    ],
    "url": "https://www.stmargaretshouse.org.uk/events/freshly-squeezed-scratch-night",
    "blurb": "St Margaret's House in Bethnal Green hosts Freshly Squeezed, a night of six bite-sized scripts from up-and-coming writers in a cosy, community-space setting. It's all bare stages and bright words: you sit among neighbours as scenes hatch and wobble into life, notes that perch and stay even after the lights come up. If you like championing brave first drafts and being part of gentle, generous feedback, this is a soft-lit corner made for you, petal.",
    "last_verified": "2025-11-25"
  },
  {
    "name": "Devise & Conquer – Scratch Night & Cabaret",
    "location": "Dalston",
    "moods": [
      "Group Energy",
      "Queer Revelry",
      "Playful & Weird"
    ],
    "genres": [
      "scratch cabaret",
      "drag and performance",
      "mixed bill"
    ],
    "url": "https://thedivine.co.uk/event/devise-conq-3-scratch/",
    "blurb": "At The Divine, Devise & Conquer turns scratch into a late-night variety spell: drag, comedy, theatre and poetry sharing a low-lit stage with glitter ground into the floorboards. The bill shifts each time but the ethos stays steady—emerging artists testing new work while a friendly crowd hoots, hollers and holds the gaps. It's a nest of stories and string lights for petals who like their experiments sequinned, messy and gloriously alive.",
    "last_verified": "2025-11-25"
  },
  {
    "name": "Freelance Royalty Scratch Nights",
    "location": "Stratford (Theatre Royal Stratford East Bar)",
    "moods": [
      "Group Energy",
      "Curious Encounters",
      "The Thoughtful Stage"
    ],
    "genres": [
      "informal scratch night",
      "freelancer-focused platform"
    ],
    "url": "https://www.stratfordeast.com/royalty-scheme/freelance-royalty/freelance-royalty-scratch-nights/",
    "blurb": "Stratford East's Freelance Royalty Scratch Nights happen not on a grand stage but in the theatre bar, where small performance spaces bloom between tables and glasses. Short works-in-progress share the evening with laughter, side chats and chance encounters with future collaborators. It's relaxed, low-stakes and welcoming—more murmuring roost than formal showcase—ideal for petals who want to test an idea without fanfare and meet others doing the same.",
    "last_verified": "2025-11-25"
  },
  {
    "name": "Belly Scratch",
    "location": "Soho (Underbelly Boulevard)",
    "moods": [
      "Group Energy",
      "Big Night Out",
      "Experimental / Avant-garde"
    ],
    "genres": [
      "theatre scratch night",
      "cabaret-style new work"
    ],
    "url": "https://underbellyboulevard.com/belly-scratch/",
    "blurb": "Belly Scratch at Underbelly Boulevard is a cabaret-style scratch night offering four artists up to twenty minutes each to bare the bones of a new show. You might see first scenes of a future fringe hit, a strange solo that refuses to behave, or a script read-through that suddenly takes flight. The room is built for risk and laughter, a cry soft as wingbeat in a velvet-clad basement, perfect for a petal who wants to feel the city's next ideas rumbling under their feet.",
    "last_verified": "2025-11-25"
  },
  {
    "name": "GrimFest Scratch Night",
    "location": "Islington (Old Red Lion Theatre)",
    "moods": [
      "Group Energy",
      "Witchy & Wild",
      "Playful & Weird"
    ],
    "genres": [
      "horror theatre scratch night",
      "storytelling",
      "cabaret fragments"
    ],
    "url": "https://www.oldredliontheatre.co.uk/grimfest-scratch-night.html",
    "blurb": "GrimFest's Scratch Night at the Old Red Lion is a lantern-lit gathering for lovers of horror and the deliciously uncanny. Extracts from new plays, snatches of cabaret, twisted storytelling and odd comedy line up like ravens on a wire, each testing how far the dark can stretch. If you like your work-in-progress tinged with blood-red light and nervous laughter, wing your way here and sit close to the aisle.",
    "last_verified": "2025-11-25"
  },
  {
    "name": "Taking Centre Stage: A Scratch Cabaret",
    "location": "Hammersmith (Riverside Studios – River Room)",
    "moods": [
      "Group Energy",
      "The Thoughtful Stage",
      "Curious Encounters"
    ],
    "genres": [
      "scratch cabaret",
      "spoken word",
      "live music"
    ],
    "url": "https://riversidestudios.co.uk/see-and-do/taking-centre-stage-a-scratch-cabaret-117843/",
    "blurb": "In the River Room at Riverside Studios, Stoke the Embers' Taking Centre Stage brings together short scenes, spoken word and live music from emerging and established artists. It's eclectic and sociable: come for the new work, stay to meet the people who made it, drifting like a feather through evening from one conversation to the next. This is where collaborations are born over interval drinks, a light-winged leap into wonder right beside the Thames.",
    "last_verified": "2025-11-25"
  },
  {
    "name": "Theatre Scratch Night",
    "location": "Holborn (The London Art Bar)",
    "moods": [
      "Group Energy",
      "Word & Voice",
      "Folk & Intimate"
    ],
    "genres": [
      "theatre scratch night",
      "new writing",
      "central London"
    ],
    "url": "https://www.londonartbar.com/calendar/theatre-scratch-night-nov-2025",
    "blurb": "The London Art Bar hosts a cosy theatre scratch night just off High Holborn, where brand-new pieces stand up in front of a supportive, wine-sipping crowd. Writers, directors and performers show work at its most vulnerable, then invite thoughts from the room; audience members become part of the creative process, not just observers. It's sheltered beneath the beams and warm as a robin's hollow, especially for petals curious about the making as much as the finished show.",
    "last_verified": "2025-11-25"
  },
  {
    "name": "GT Scratch",
    "location": "Greenwich (Greenwich Theatre)",
    "moods": [
      "Group Energy",
      "Curious Encounters",
      "Experimental / Avant-garde"
    ],
    "genres": [
      "scratch night",
      "emerging theatre-makers",
      "new ideas platform"
    ],
    "url": "https://greenwichtheatre.org.uk/events/gt-scratch/",
    "blurb": "GT Scratch at Greenwich Theatre frames itself simply: new ideas, raw talent, live feedback. On any given night you might catch early scenes from a touring show, a strange little gem that only exists for one performance, or a devised piece still figuring out its own wingspan. For petals in south-east London, it's a welcoming perch to see what tomorrow's theatre-makers are hatching right now.",
    "last_verified": "2025-11-25"
  },
  {
    "name": "The London Library",
    "location": "St James's",
    "moods": [
      "Romanticised London",
      "Word & Voice",
      "Poetic"
    ],
    "genres": [
      "independent library",
      "reading rooms",
      "writer's haven"
    ],
    "url": "https://www.londonlibrary.co.uk",
    "blurb": "A private members' library that feels like it's been quietly breathing for centuries. Metal stacks, spiralling staircases and desk lamps casting soft halos over readers deep in their own chapters. Some evenings the building stays open late, and once a month the lights burn longer still – a hush-filled refuge for those who write best after dark, padding between shelves as the city outside winds down.",
    "last_verified": "2025-11-25"
  },
  {
    "name": "British Library (Late Reading Rooms)",
    "location": "King's Cross",
    "moods": [
      "Poetic",
      "Word & Voice",
      "Romanticised London"
    ],
    "genres": [
      "national library",
      "study spaces",
      "exhibition hub"
    ],
    "url": "https://www.bl.uk/visit",
    "blurb": "The country's great red-brick ark of words keeps its doors and reading rooms open into the evening – most weekdays until 20:00 – so the after-work hours can stretch into a quiet second shift. Long desks, steady lamplight and the faint rustle of pages make it a gentle place to revise, research or simply read yourself back together, before the last soft call for closing time.",
    "last_verified": "2025-11-25"
  },
  {
    "name": "Barbican Foyers & Library Corners",
    "location": "Barbican, City of London",
    "moods": [
      "Curious Encounters",
      "Late-Night Lark",
      "Romanticised London"
    ],
    "genres": [
      "arts centre",
      "public foyers",
      "informal study spots"
    ],
    "url": "https://www.barbican.org.uk",
    "blurb": "By day, a concrete citadel; by night, a softly glowing warren of sofas, tables and power sockets open until around 23:00. You can tuck yourself into a corner with a laptop while orchestras warm up behind distant doors, or draft emails beneath hanging plants as filmgoers drift past. It's less shh-library, more nocturnal living room for the city's bookish night birds.",
    "last_verified": "2025-11-25"
  },
  {
    "name": "Morocco Bound Bookshop",
    "location": "Bermondsey, SE1",
    "moods": [
      "Curious Encounters",
      "Late-Night Lark",
      "Word & Voice"
    ],
    "genres": [
      "bookshop bar",
      "co-working",
      "intimate events"
    ],
    "url": "https://www.moroccobound.co.uk",
    "blurb": "Tucked down a side street near London Bridge, this tiny ship of a bookshop sails from quiet daytime co-working into a low-lit bar and event space at night. Shelves of global fiction, local beers from the Bermondsey Beer Mile and regular jazz, poetry and salon-style nights make it a perfect nest for those who like their studying punctuated by readings, music and a late pint with fellow word-dwellers.",
    "last_verified": "2025-11-25"
  },
  {
    "name": "London Review Bookshop & St. JOHN at the Bookshop",
    "location": "Bloomsbury, WC1",
    "moods": [
      "Poetic",
      "The Thoughtful Stage",
      "Word & Voice"
    ],
    "genres": [
      "independent bookshop",
      "café",
      "author events"
    ],
    "url": "https://www.londonreviewbookshop.co.uk",
    "blurb": "In Bloomsbury's literary heart, the London Review Bookshop and its St. JOHN café make a gentle evening bolthole: shelves dense with ideas, a hidden terrace, and wine or hot chocolate to keep you company until early evening closing. On events nights the shop reshapes itself into a miniature auditorium – a place to listen, take notes, and then slip back out into the dark with a new book under your arm and a head full of sentences.",
    "last_verified": "2025-11-25"
  },
  {
    "name": "Bàrd Books",
    "location": "Bow",
    "moods": [
      "Folk & Intimate",
      "The Thoughtful Stage",
      "Word & Voice"
    ],
    "genres": [
      "bookshop café",
      "wine bar",
      "work-friendly"
    ],
    "url": "https://www.wearebardbooks.co.uk",
    "blurb": "Part bookshop, part café, part low-key salon, Bàrd keeps the lights on into the evening – often until 20:00, with book clubs and events that drift later. You can work at the back on free wifi among art books and local exhibitions, then stay as the day softens into wine, snacks and softly chattering readers. On some nights there's comedy, quizzes or even a bookshop rave: a study nest that happily forgets to be serious after dark.",
    "last_verified": "2025-11-25"
  },
  {
    "name": "Second Home Spitalfields",
    "location": "Spitalfields, E1",
    "moods": [
      "Late-Night Lark",
      "Curious Encounters",
      "Poetic"
    ],
    "genres": [
      "co-working",
      "24/7 access (members)",
      "creative hub"
    ],
    "url": "https://secondhome.io/coworking-space-london/east-london",
    "blurb": "If you work best when everyone else is asleep, this greenhouse-like co-working space offers 24/7 access for members: curving desks wrapped in plants, long sight-lines of fellow night workers and quiet corners for deep focus. It's less a café and more a habitat – a place to bring big projects, late deadlines and the kind of slow-burning ideas that need the whole night to unfold, petal.",
    "last_verified": "2025-11-25"
  },
  {
    "name": "VQ Bloomsbury (24-Hour Café & Diner)",
    "location": "Bloomsbury, WC1",
    "moods": [
      "Late-Night Lark",
      "Folk & Intimate"
    ],
    "genres": [
      "24-hour café",
      "diner",
      "study-friendly"
    ],
    "url": "https://www.vqrestaurants.com",
    "blurb": "Not indie in the strictest sense, but a stalwart for students and shift-workers in need of a table at 3am. Open 24 hours, this Bloomsbury café-diner serves breakfast and comfort food around the clock, with free wifi and a steady churn of fellow night people. It's more fluorescent than fairy-lit, but when the deadline looms and every other door is closed, VQ becomes a surprisingly tender kind of nest.",
    "last_verified": "2025-11-25"
  },
  {
    "name": "Polo Bar – 24 Hour Great British Café & Bar",
    "location": "Opposite Liverpool Street Station",
    "moods": [
      "Late-Night Lark",
      "Curious Encounters"
    ],
    "genres": [
      "24-hour café bar",
      "people-watching",
      "casual study spot"
    ],
    "url": "https://www.polobar.co.uk",
    "blurb": "Across from Liverpool Street, Polo Bar has been pouring coffee and frying breakfasts through the small hours for decades. Open 24/7, it's not a quiet library – more a glowing window onto the city's insomniac life – but if you claim a booth, order tea and open your notebook, it becomes a strange, cinematic study spot: words flowing as taxis unload, club kids drift past, and the station clocks creep towards dawn.",
    "last_verified": "2025-11-25"
  },
  {
    "name": "Costa at St Pancras – Station Study Watchpost",
    "location": "King's Cross",
    "moods": [
      "Late-Night Lark",
      "Romanticised London"
    ],
    "genres": [
      "chain café",
      "late-night study",
      "railway liminal"
    ],
    "url": "https://stpancras-highspeed.com",
    "blurb": "Hardly a hidden indie gem, but legendary among students for one thing: after the last trains leave, the station falls almost silent, and the 24-hour coffee shop turns into a ghostly, fluorescent reading room. It's where essays get finished between departures and arrivals, where you can sit with your laptop, a refill and the feeling of being briefly nowhere – a temporary nest for those nights when you just can't go home yet.",
    "last_verified": "2025-11-25"
  },
  {
    "name": "Embracing Grief – London Grief Tending Circles",
    "location": "Hackney",
    "moods": [
      "Grief & Grace",
      "Spiritual / Sacred / Mystical",
      "Folk & Intimate"
    ],
    "genres": [
      "grief circles",
      "community ritual",
      "embodied grief tending"
    ],
    "url": "https://www.griefsupport.org.uk",
    "blurb": "Grief here is not a problem to fix but a weather to sit inside together. Embracing Grief host beautifully held circles and rituals in London, inviting you to lean into sorrow, rage, numbness and love with others who understand. Expect blankets, song, simple ritual and a steady facilitation team who know how to tend big feelings without rushing you, petal.",
    "last_verified": "2025-11-24"
  },
  {
    "name": "Old School Rooms @ Round Chapel – Communal Grief Rituals",
    "location": "Hackney",
    "moods": [
      "Grief & Grace",
      "Spiritual / Sacred / Mystical",
      "Group Energy"
    ],
    "genres": [
      "community ritual",
      "grief tending",
      "singing & drumming"
    ],
    "url": "https://www.roundchapel.org",
    "blurb": "The Old School Rooms at the Round Chapel become a kind of indoor clearing for the heart: drums, song and a circle of chairs under high Hackney rafters. On communal grief ritual days, dozens gather to cry, wail, breathe and be witnessed, with plenty of time for gentle landing afterwards. If you're longing to feel less alone in your loss, this is a rare, brave nest for collective mourning.",
    "last_verified": "2025-11-24"
  },
  {
    "name": "Bija Garden of Wellbeing – Grief Circles in the Garden",
    "location": "Ealing",
    "moods": [
      "Grief & Grace",
      "Spiritual / Sacred / Mystical",
      "Folk & Intimate"
    ],
    "genres": [
      "grief circle",
      "restorative yoga",
      "women's circles"
    ],
    "url": "https://bijagarden.com",
    "blurb": "Tucked behind a West Ealing terrace, Bija Garden is a tiny eco-studio of fairy lights, foliage and soft rugs on the floor. Alongside restorative yoga and women's circles, it occasionally hosts small grief circles and healing evenings—quiet, candlelit spaces where nine or so souls can rest their bones and speak what hurts. A good perch if you want grief held with herbal tea, gentle spirituality and a lot of cushions.",
    "last_verified": "2025-11-24"
  },
  {
    "name": "Bonnington Centre Death Café",
    "location": "Vauxhall (SW8)",
    "moods": [
      "Folk & Intimate",
      "The Thoughtful Stage",
      "Poetic"
    ],
    "genres": [
      "death café",
      "community gathering"
    ],
    "url": "https://deathcafe.com/c/bonningtoncentre/",
    "blurb": "In a scruffy, beloved community centre just off Vauxhall's main drag, the Bonnington Death Café gathers people around tables for cake, tea and talk of mortality. There's no agenda beyond honesty: you show up, you speak or listen, and death is allowed to be mentioned in the same breath as everyday life. Perfect if you want something low-key and kitchen-table real rather than formal therapy.",
    "last_verified": "2025-11-24"
  },
  {
    "name": "Rosslyn Hill Unitarian Chapel – Hampstead Death Café",
    "location": "Hampstead (NW3)",
    "moods": [
      "Grief & Grace",
      "Spiritual / Sacred / Mystical",
      "Poetic"
    ],
    "genres": [
      "death café",
      "spiritual conversation"
    ],
    "url": "https://www.rosslynhillchapel.org.uk",
    "blurb": "Rosslyn Hill Chapel is all steep steps, stone and stained glass—a Unitarian church that doubles as a haven for difficult conversations. Their Hampstead Death Café meets in this contemplative setting, welcoming anyone who wants to talk about death, grief and meaning without dogma or drama. Come for the candlelit calm and leave with that curious lightness that arrives when the unsayable has finally been said aloud.",
    "last_verified": "2025-11-24"
  },
  {
    "name": "Community Sauna Baths – Grief Sauna",
    "location": "Hackney Wick",
    "moods": [
      "Body-Based / Movement-Led",
      "Grief & Grace",
      "Folk & Intimate"
    ],
    "genres": [
      "grief sauna",
      "sauna ritual",
      "community wellbeing"
    ],
    "url": "https://community-sauna.co.uk",
    "blurb": "Community Sauna Baths turns old public baths in Hackney Wick and a Stratford garden plot into steamy, wood-fired sanctuaries. Among the usual sauna sessions are special 'grief saunas' and trans grief nights—ritual-inflected steams where you can sweat, plunge and breathe through heartache in company. Think fire, water, silence and a small flock of strangers softening together in the heat.",
    "last_verified": "2025-11-24"
  },
  {
    "name": "Release: Boxing Through Grief – London Community Boxing",
    "location": "Peckham (SE15)",
    "moods": [
      "Body-Based / Movement-Led",
      "Grief & Grace",
      "Punchy / Protest"
    ],
    "genres": [
      "boxing & movement",
      "grief programme"
    ],
    "url": "https://www.instagram.com/thelossproject1/",
    "blurb": "At London Community Boxing in Peckham, The Loss Project's 'Release: Boxing Through Grief' swaps talking cures for heavy bags and footwork. Guided by a coach and grief practitioners, you get to punch, move and breathe your way through loss in a held, low-cost space. Ideal if your grief feels restless or angry and you need somewhere you won't be told to sit still and be sensible.",
    "last_verified": "2025-11-24"
  },
  {
    "name": "Grief Rave & Grief Moves – The Fandangoe Discoteca x The Loss Project",
    "location": "Touring (often Southbank Centre, SE1)",
    "moods": [
      "Grief & Grace",
      "Ecstatic",
      "Playful & Weird"
    ],
    "genres": [
      "grief rave",
      "participatory dance",
      "mental health installation"
    ],
    "url": "https://www.thelossproject.com/thefandangoediscoteca",
    "blurb": "The Fandangoe Discoteca is a travelling pink mini-club that parks up at places like Southbank Centre and invites you to dance out your grief. Grief Raves and Grief Moves sessions mix DJ sets, joy-soaked visuals and mental health practitioners on hand, holding space for everything from bereavement to climate dread. It's loud, tender and gloriously strange—a tiny disco nest where tears and euphoria share the same dancefloor.",
    "last_verified": "2025-11-24"
  },
  {
    "name": "Galleria Objets – \"Your Grief Belongs To You, And Can Be So So Pretty\"",
    "location": "East London",
    "moods": [
      "Poetic",
      "The Thoughtful Stage",
      "Melancholic Beauty"
    ],
    "genres": [
      "contemporary art",
      "grief-themed exhibition"
    ],
    "url": "https://objetstrouves.co.uk",
    "blurb": "Galleria Objets is a small contemporary gallery in east London with a taste for work that sits in the liminal and the quietly intense. Recent shows like 'Your Grief Belongs To You, And Can Be So So Pretty' have treated loss as something to be looked at sideways: tender, aesthetic, a little unsettling, never mocked. If you'd like to wander with your feelings rather than unpack them in a circle, this is a soft-lit room to do it in.",
    "last_verified": "2025-11-24"
  }
]