[
  {
    "name": "CI@Goldsmiths Contact Improvisation Jam",
    "location": "New Cross",
    "moods": ["embodied", "movement", "somatic", "liberating"],
    "genres": ["contact improvisation", "dance jam", "movement practice"],
    "url": "https://www.gold.ac.uk/",
    "blurb": "In the studios of Goldsmiths, bodies meet and move in wordless conversation. This contact improvisation jam invites movers of all levels to explore weight-sharing, momentum and trust — a practice where falling becomes flying and strangers become brief dance partners in the space between intention and surrender.",
    "whisper": "Bodies meeting in wordless conversation, falling into flight",
    "arcana": "Body-Based / Movement-Led",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Flomotion Dance at Life by Margot",
    "location": "Crouch End",
    "moods": ["embodied", "movement", "liberating", "ecstatic"],
    "genres": ["conscious movement", "ecstatic dance", "wellness"],
    "url": "https://www.flomotiondance.com/",
    "blurb": "In a sunlit Crouch End studio, Flomotion invites you to move beyond choreography into pure expression. This conscious dance practice blends freeform movement with gentle guidance, letting the body find its own wisdom. No steps to learn, just breath, beat and the slow unfurling of whatever needs to move through you.",
    "whisper": "Freeform movement in a sunlit sanctuary",
    "arcana": "Body-Based / Movement-Led",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Luz Natural Dance – Women's Cacao & Movement Sessions",
    "location": "Crouch End",
    "moods": ["embodied", "sacred", "feminine", "ritualistic"],
    "genres": ["women's circle", "cacao ceremony", "conscious dance"],
    "url": "https://www.luznaturaldance.com/",
    "blurb": "Cacao opens the heart; movement lets it speak. These women's sessions in Crouch End weave ceremonial cacao with freeform dance, creating a container for feminine expression, release and connection. In the warmth of the circle, bodies soften and stories surface through gesture and breath.",
    "whisper": "Cacao-warmed hearts moving in sacred feminine circle",
    "arcana": "Body-Based / Movement-Led",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Movement Medicine & Ecstatic Dance at Colet House",
    "location": "West Kensington",
    "moods": ["embodied", "ecstatic", "transformative", "liberating"],
    "genres": ["movement medicine", "ecstatic dance", "conscious movement"],
    "url": "https://www.colethouse.com/",
    "blurb": "In the beautiful halls of Colet House, Movement Medicine offers a map for the dancing body — not steps, but territories of emotion, archetype and release. These sessions blend ecstatic dance with deeper somatic inquiry, inviting transformation through sweat, stillness and the wisdom held in muscle and bone.",
    "whisper": "Deep somatic journeys in a West Kensington sanctuary",
    "arcana": "Body-Based / Movement-Led",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Chisenhale Dance Space",
    "location": "Bow",
    "moods": ["embodied", "experimental", "creative", "movement"],
    "genres": ["contemporary dance", "workshops", "residencies"],
    "url": "https://www.chisenhaledancespace.co.uk/",
    "blurb": "Tucked away in Bow, Chisenhale has nurtured experimental dance since the 1980s. This artist-led space hosts workshops, jams and residencies where movement practitioners push boundaries and blur the lines between dance and life. The wooden floors have absorbed decades of daring — come add your footprints.",
    "whisper": "An artist-led haven where experimental bodies gather",
    "arcana": "Body-Based / Movement-Led",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Yaran Women's Club – Dance Therapy",
    "location": "Finchley",
    "moods": ["embodied", "healing", "feminine", "therapeutic"],
    "genres": ["dance therapy", "women's wellness", "movement therapy"],
    "url": "https://www.yaranwomensclub.com/",
    "blurb": "Yaran means 'friends' in Persian, and this Finchley women's club embodies that warmth. Dance therapy sessions create safe space for movement as medicine — processing, releasing, reconnecting. No performance, no judgement, just women moving through what words cannot hold.",
    "whisper": "Healing through movement in warm sisterhood",
    "arcana": "Body-Based / Movement-Led",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Ecstatic Dance Temple @ Round Chapel",
    "location": "Lower Clapton",
    "moods": ["ecstatic", "liberating", "sweaty", "sacred"],
    "genres": ["ecstatic dance", "conscious clubbing", "sober rave"],
    "url": "https://www.roundchapel.org.uk/",
    "blurb": "Beneath the vaulted ceiling of Round Chapel, a different kind of worship unfolds. Ecstatic Dance Temple transforms this sacred space into a sweat-soaked cathedral of movement — no alcohol, no talking on the dancefloor, just bodies surrendering to the DJ's journey from slow unfurling to peak release and gentle landing.",
    "whisper": "Sweat-soaked worship beneath Victorian vaults",
    "arcana": "Body-Based / Movement-Led",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Moving with Intimacy – Goodinge Community Centre",
    "location": "Holloway",
    "moods": ["embodied", "tender", "somatic", "connecting"],
    "genres": ["somatic movement", "intimacy practice", "partnered movement"],
    "url": "https://www.goodinge.com/",
    "blurb": "In the humble setting of Goodinge Community Centre, something tender unfolds. Moving with Intimacy explores touch, consent and connection through partnered movement practices. Learn to listen with your skin, to negotiate space with presence, to find the vulnerable courage in reaching toward another body.",
    "whisper": "Learning the language of consensual touch",
    "arcana": "Body-Based / Movement-Led",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Studio Ma – Authentic Movement",
    "location": "Bethnal Green",
    "moods": ["embodied", "meditative", "somatic", "introspective"],
    "genres": ["authentic movement", "somatic practice", "movement meditation"],
    "url": "https://www.studioma.co.uk/",
    "blurb": "Authentic Movement is meditation in motion — eyes closed, following the body's impulses while a witness holds space. At Studio Ma in Bethnal Green, this contemplative practice strips away performance to find the raw, honest movement that lives beneath our social masks. What moves when you stop trying to move?",
    "whisper": "Eyes closed, following the body's honest impulse",
    "arcana": "Body-Based / Movement-Led",
    "last_verified": "2025-01-18"
  },
  {
    "name": "5Rhythms T.W.C (Thursday Waves) at St Luke's Church",
    "location": "Holloway",
    "moods": ["ecstatic", "embodied", "liberating", "transformative"],
    "genres": ["5rhythms", "conscious dance", "movement meditation"],
    "url": "https://www.5rhythms.com/",
    "blurb": "Every Thursday, St Luke's Church becomes a temple of the 5Rhythms wave — Flowing, Staccato, Chaos, Lyrical, Stillness. This long-running session guides dancers through the full arc of the practice, from gentle awakening to wild release to quiet return. Come as you are; leave as something new.",
    "whisper": "Thursday waves of flow, chaos and stillness",
    "arcana": "Body-Based / Movement-Led",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Noble Rot Lamb's Conduit",
    "location": "Bloomsbury",
    "moods": ["melancholic", "intimate", "nostalgic", "literary"],
    "genres": ["wine bar", "restaurant", "natural wine"],
    "url": "https://www.noblerot.co.uk/",
    "blurb": "On a quiet Bloomsbury street, Noble Rot glows with the warmth of a well-kept secret. This wine bar and restaurant celebrates the beauty of aged bottles and slow evenings. Burgundy-coloured walls, shelves lined with rare vintages, and a menu that honours tradition — it feels like drinking in someone's beautifully curated memory.",
    "whisper": "Rare wines and quiet corners in literary Bloomsbury",
    "arcana": "Melancholic Beauty",
    "last_verified": "2025-01-18"
  },
  {
    "name": "The Candlelight Club",
    "location": "Secret London location",
    "moods": ["nostalgic", "vintage", "dreamy", "secretive"],
    "genres": ["speakeasy", "jazz", "popup"],
    "url": "https://www.thecandlelightclub.com/",
    "blurb": "Behind a cryptic email invite and a password lies a 1920s wonderland where a secretive pop-up bar flickers entirely by candlelight. Elegant cocktails pour as live jazz, swing bands and retro DJs spin tunes; guests dress in velvet and feathers, sinking into a world of Prohibition-era decadence. Time seems soft and blurred, like a sepia memory reborn for a single evening.",
    "whisper": "Jazz and cocktails by candlelight, lost in a secret 1920s dream",
    "arcana": "Nostalgic / Vintage / Retro",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Sessions Arts Club",
    "location": "Clerkenwell",
    "moods": ["melancholic", "beautiful", "artistic", "intimate"],
    "genres": ["members club", "restaurant", "arts venue"],
    "url": "https://www.sessionsartsclub.com/",
    "blurb": "In a former magistrates' court in Clerkenwell, Sessions Arts Club preserves the beautiful decay of its Georgian bones. Crumbling plaster and faded grandeur frame candlelit dinners and late-night conversations about art and beauty. It's a space that understands melancholy as aesthetic — the romance of things that were, held gently in what remains.",
    "whisper": "Georgian grandeur preserved in beautiful decay",
    "arcana": "Melancholic Beauty",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Abney Park Cemetery",
    "location": "Stoke Newington",
    "moods": ["melancholic", "wild", "contemplative", "overgrown"],
    "genres": ["cemetery", "nature reserve", "walking"],
    "url": "https://www.abneypark.org/",
    "blurb": "Where Victorian monuments surrender to ivy and the chapel stands roofless to the sky, Abney Park offers melancholy made verdant. This overgrown cemetery is part nature reserve, part outdoor museum of mortality — a place where foxes den among the graves and wildflowers bloom from crumbling stone. Death and life, tangled in green embrace.",
    "whisper": "Ivy-wrapped graves where wildness reclaims the Victorian dead",
    "arcana": "Melancholic Beauty",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Nightjar Shoreditch",
    "location": "Shoreditch",
    "moods": ["melancholic", "nostalgic", "intimate", "dreamy"],
    "genres": ["speakeasy", "jazz", "cocktail bar"],
    "url": "https://www.barnightjar.com/",
    "blurb": "On an unmarked corner near Old Street, descend into a candlelit basement where the roaring twenties live again. Nightjar suspends reality with art deco cabinets, live jazz and a cocktail list steeped in forgotten recipes. Guests emerge into the night as if from a dream — a whisper of feathers and brass still clinging to their minds.",
    "whisper": "A hidden cellar where time slows and jazz blooms in the dark",
    "arcana": "Melancholic Beauty",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Piano Bar Soho",
    "location": "Soho",
    "moods": ["melancholic", "intimate", "nostalgic", "romantic"],
    "genres": ["piano bar", "cocktail bar", "live music"],
    "url": "https://www.pianobarsoho.com/",
    "blurb": "Down a Soho staircase, Piano Bar keeps the flame of old-school sophistication burning. A baby grand anchors the room while cocktails flow and strangers become friends over shared requests. It's the kind of place where someone might play your heartbreak, and you'd thank them for it.",
    "whisper": "A basement baby grand playing the songs you forgot you needed",
    "arcana": "Melancholic Beauty",
    "last_verified": "2025-01-18"
  },
  {
    "name": "The Cinema Museum",
    "location": "Kennington",
    "moods": ["melancholic", "nostalgic", "curious", "forgotten"],
    "genres": ["museum", "cinema history", "archive"],
    "url": "https://www.cinemamuseum.org.uk/",
    "blurb": "In a former workhouse where Charlie Chaplin once stayed as a child, The Cinema Museum hoards the dreams of a century. Projectors, posters, velvet seats rescued from demolished picture palaces — it's a labyrinth of cinema's material memory. Ronald Grant's collection feels less like a museum than a love letter to the flickering dark.",
    "whisper": "A labyrinth of projectors and picture-palace ghosts",
    "arcana": "Melancholic Beauty",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Planetarium GO! at Battersea Power Station",
    "location": "Battersea",
    "moods": ["wonder", "awe", "cosmic", "immersive"],
    "genres": ["planetarium", "immersive experience", "science"],
    "url": "https://www.batterseapowerstation.co.uk/",
    "blurb": "Inside the industrial cathedral of Battersea Power Station, a portable planetarium inflates with possibility. Lie back as the dome fills with stars, nebulae and the wheeling cosmos — a pocket universe offering wonder between the old turbine halls. The juxtaposition of industrial heritage and infinite space creates its own kind of sublime.",
    "whisper": "A pocket cosmos inflating inside industrial cathedral walls",
    "arcana": "Wonder & Awe",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Frameless",
    "location": "Marble Arch",
    "moods": ["wonder", "immersive", "dreamy", "artistic"],
    "genres": ["immersive art", "digital experience", "gallery"],
    "url": "https://www.frameless.com/",
    "blurb": "Four vast galleries transform masterpieces into environments you can walk through. At Frameless, Klimt's gold becomes a shimmering cave, Kandinsky's shapes pulse with sound, and you stand inside the colour fields that once hung flat on gallery walls. It's art as atmosphere, painting as weather system.",
    "whisper": "Step inside the masterpieces — art as atmosphere",
    "arcana": "Wonder & Awe",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Outernet London",
    "location": "Tottenham Court Road",
    "moods": ["wonder", "futuristic", "immersive", "overwhelming"],
    "genres": ["immersive venue", "digital art", "entertainment district"],
    "url": "https://www.outernetglobal.com/",
    "blurb": "Wrapped in the largest LED screens in Europe, Outernet transforms a corner of Tottenham Court Road into a portal between realities. The Now Building's four-storey display envelops visitors in digital art, concerts and branded hallucinations. It's sensory overload as urban spectacle — the future bleeding into the everyday.",
    "whisper": "Four storeys of LED dreams bleeding into the street",
    "arcana": "Wonder & Awe",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Natural History Museum – Space: Could Life Exist Beyond Earth?",
    "location": "South Kensington",
    "moods": ["wonder", "cosmic", "curious", "awe"],
    "genres": ["exhibition", "science", "museum"],
    "url": "https://www.nhm.ac.uk/",
    "blurb": "Beyond the dinosaurs and dioramas, the Natural History Museum poses the biggest question of all. This exhibition journeys from extremophiles in Earth's harshest corners to the methane seas of Titan, asking what life might look like where we'd least expect it. Wonder as scientific method.",
    "whisper": "Asking the biggest question beneath Victorian vaults",
    "arcana": "Wonder & Awe",
    "last_verified": "2025-01-18"
  },
  {
    "name": "UCL Observatory Public Tours",
    "location": "Mill Hill",
    "moods": ["wonder", "cosmic", "peaceful", "curious"],
    "genres": ["observatory", "stargazing", "astronomy"],
    "url": "https://www.ucl.ac.uk/ucl-observatory",
    "blurb": "On clear nights, the domes of Mill Hill open to the public and the universe gets a little closer. UCL Observatory's historic telescopes offer glimpses of craters, rings and distant galaxies, guided by astronomers who remember that wonder is the beginning of science. Dark skies and infinite questions.",
    "whisper": "Historic domes opening onto infinite dark",
    "arcana": "Wonder & Awe",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Lightroom – The Moonwalkers: A Journey with Tom Hanks",
    "location": "King's Cross",
    "moods": ["wonder", "awe", "immersive", "historic"],
    "genres": ["immersive experience", "documentary", "space"],
    "url": "https://www.lightroom.uk/",
    "blurb": "Lightroom's vast walls become windows into the Apollo missions, surrounding you with the Earth as the astronauts saw it — small, blue, impossibly fragile. Tom Hanks narrates humanity's greatest journey as you stand where the lunar module stood, dust and starlight all around. Awe as architecture.",
    "whisper": "Standing where the lunar module stood, Earth rising behind you",
    "arcana": "Wonder & Awe",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Luke Jerram's Gaia at Southwark Cathedral",
    "location": "Southwark",
    "moods": ["wonder", "cosmic", "contemplative", "awe"],
    "genres": ["art installation", "sculpture", "cathedral"],
    "url": "https://www.southwarkcathedral.org.uk/",
    "blurb": "A seven-metre Earth hangs in the nave of Southwark Cathedral, slowly rotating beneath Gothic stone. Luke Jerram's Gaia uses NASA imagery to render our planet in impossible intimacy — continents and clouds suspended where prayers rise. The Overview Effect, delivered in an ancient sacred space.",
    "whisper": "Our blue planet turning slowly beneath Gothic arches",
    "arcana": "Wonder & Awe",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Candlelight Concerts at St Mary le Strand",
    "location": "The Strand",
    "moods": ["wonder", "intimate", "beautiful", "atmospheric"],
    "genres": ["classical music", "candlelit concert", "church venue"],
    "url": "https://feverup.com/london/candlelight",
    "blurb": "Hundreds of candles transform St Mary le Strand into a glowing vessel for string quartets and piano. These intimate concerts wrap familiar music in flickering warmth — Vivaldi, film scores, even tributes to modern artists — creating an atmosphere where listening becomes meditation and beauty feels almost overwhelming.",
    "whisper": "Strings and candleflame in a glowing Strand sanctuary",
    "arcana": "Wonder & Awe",
    "last_verified": "2025-01-18"
  },
  {
    "name": "St Paul's Cathedral – Whispering & Golden Galleries",
    "location": "City of London",
    "moods": ["wonder", "awe", "majestic", "historic"],
    "genres": ["cathedral", "architecture", "historic site"],
    "url": "https://www.stpauls.co.uk/",
    "blurb": "Climb 528 steps and London unfolds like a map made of light. The Whispering Gallery demonstrates sound's strange travels around Wren's dome, while the Golden Gallery offers 360-degree views from the cathedral's crown. The ascent itself is the pilgrimage — stone spirals leading to sky.",
    "whisper": "528 steps to where whispers travel and London spreads below",
    "arcana": "Wonder & Awe",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Illuminated River",
    "location": "Central London",
    "moods": ["wonder", "dreamy", "beautiful", "nocturnal"],
    "genres": ["public art", "light installation", "walking"],
    "url": "https://illuminatedriver.london/",
    "blurb": "Fifteen bridges across the Thames glow with the world's longest public art installation. Each night, Illuminated River paints the crossings in shifting colours — some responding to tides, others to data, all transforming the everyday infrastructure into ribbons of light connecting north and south. The river becomes a gallery.",
    "whisper": "Fifteen bridges glowing, the Thames wrapped in light",
    "arcana": "Wonder & Awe",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Painted Hall at Old Royal Naval College",
    "location": "Greenwich",
    "moods": ["wonder", "awe", "majestic", "historic"],
    "genres": ["baroque art", "historic site", "architecture"],
    "url": "https://www.ornc.org/painted-hall",
    "blurb": "Called 'the finest dining hall in Europe' by UNESCO, the Painted Hall took James Thornhill 19 years to complete. Every surface swirls with allegory — monarchs, virtues, the cosmos itself rendered in baroque grandeur. Lie on the 'perspective bench' and let the ceiling swallow you whole.",
    "whisper": "Nineteen years of painting, one overwhelming ceiling",
    "arcana": "Wonder & Awe",
    "last_verified": "2025-01-18"
  },
  {
    "name": "BAPS Shri Swaminarayan Mandir – Neasden Temple",
    "location": "Neasden",
    "moods": ["wonder", "sacred", "awe", "peaceful"],
    "genres": ["temple", "architecture", "spiritual site"],
    "url": "https://www.neasdentemple.org/",
    "blurb": "Rising improbably from suburban Neasden, this Hindu temple is Europe's first traditional stone mandir. 5,000 tonnes of Bulgarian limestone and Italian marble, carved in India by 1,500 artisans, assembled without structural steel. Inside, the intricacy overwhelms — every surface a prayer in stone. Sacred wonder made manifest.",
    "whisper": "5,000 tonnes of carved marble risen in suburban miracle",
    "arcana": "Wonder & Awe",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Ryoji Ikeda: Data-Cosm at 180 Studios",
    "location": "Strand / Temple",
    "moods": ["wonder", "overwhelming", "futuristic", "immersive"],
    "genres": ["digital art", "audiovisual installation", "contemporary art"],
    "url": "https://180studios.com/",
    "blurb": "Ryoji Ikeda transforms data into sublime experience. At 180 Studios, his installations flood vast spaces with light and sound derived from mathematical datasets — the human genome, cosmic radiation, quantum fluctuations made visible. It's information as aesthetic overwhelm, numbers becoming awe.",
    "whisper": "Data becoming light, numbers becoming awe",
    "arcana": "Wonder & Awe",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Barts",
    "location": "Chelsea",
    "moods": ["nostalgic", "vintage", "retro", "secretive"],
    "genres": ["speakeasy", "cocktail bar"],
    "url": "https://barts-london.com/",
    "blurb": "Hidden behind a nondescript door in Chelsea, this disguised apartment transports guests back to 1929. It's one of London's first speakeasy bars, a Chicago gangster's hideout filled with eccentric antiques and potent cocktails served by 'Shady Associates'. Step through the wardrobe and the modern world dissolves into a hushed world of bootleg glamour.",
    "whisper": "Through a secret door, Prohibition lives on in velvet shadows",
    "arcana": "Nostalgic / Vintage / Retro",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Do Not Disturb (DND) at Vintry & Mercer",
    "location": "City of London",
    "moods": ["nostalgic", "vintage", "retro", "intimate"],
    "genres": ["speakeasy", "hotel bar"],
    "url": "https://vintryandmercer.com/food-drink/do-not-disturb-bar/",
    "blurb": "Down a discreet staircase in Vintry & Mercer, an underground speakeasy whispers of New York's clandestine bars. Beaded portraits of the Ziegfeld Follies adorn velvet booths while barrel-aged cocktails and rare spirits line the dimly lit shelves. The mood is indulgent and timeless, as if the roaring twenties never ended.",
    "whisper": "A velvet hideaway for hushed conversations and aged libations",
    "arcana": "Nostalgic / Vintage / Retro",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Cahoots",
    "location": "Soho",
    "moods": ["nostalgic", "vintage", "retro", "playful"],
    "genres": ["speakeasy", "swing dance", "cocktail bar"],
    "url": "https://cahoots-london.com/",
    "blurb": "Deep beneath Kingly Court, an abandoned air-raid shelter has been transformed into a 1940s underground station. Mismatched crockery, swing music and bootleg cocktails evoke post-war London; the resident 'scoundrels' serve drinks in tin mugs as live bands strike up at swing parties. It feels like stepping into a sepia-toned film reel, where rationing and revelry dance together.",
    "whisper": "A wartime platform alive with swing, ration books and secret gin",
    "arcana": "Nostalgic / Vintage / Retro",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Bar Américain at Brasserie Zédel",
    "location": "Piccadilly",
    "moods": ["nostalgic", "vintage", "classic", "elegant"],
    "genres": ["art deco bar", "cocktail bar"],
    "url": "https://www.brasseriezedel.com/bar-americain/",
    "blurb": "Tucked beneath Piccadilly Circus, Bar Américain glows with polished wood and gleaming marble. This classical American bar, nestled within Brasserie Zédel, is renowned for its opulent Art Deco surroundings and decadent cocktails. Bronze light shimmers across leather booths, conjuring the glamour of a bygone jazz age.",
    "whisper": "Gilded Art Deco elegance where cocktails whisper of old New York",
    "arcana": "Nostalgic / Vintage / Retro",
    "last_verified": "2025-01-18"
  },
  {
    "name": "St James Bar at Sofitel St James",
    "location": "St James's",
    "moods": ["nostalgic", "vintage", "elegant", "intimate"],
    "genres": ["art deco bar", "hotel bar", "cocktail bar"],
    "url": "https://www.sofitelstjames.com/en/bar.html",
    "blurb": "Within a former 1923 bank, St James Bar combines roaring-twenties glamour with contemporary sophistication. Deep emerald velvet, mirrored accents and low lighting evoke a chic speakeasy atmosphere. Above the bar a whimsical ceiling painting of a cockerel in military dress watches over plush booths and cocktail artistry, transporting patrons to a dream of Parisian decadence.",
    "whisper": "Emerald velvet and whispered glamour beneath a painted ceiling",
    "arcana": "Nostalgic / Vintage / Retro",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Electric Cinema Portobello",
    "location": "Notting Hill",
    "moods": ["nostalgic", "vintage", "romantic", "timeless"],
    "genres": ["vintage cinema", "independent cinema"],
    "url": "https://www.electriccinema.co.uk/portobello/",
    "blurb": "One of the UK's oldest working cinemas, the Electric first opened in 1911 and still preserves its ornate proscenium arch and Edwardian details. Plush leather armchairs with footstools and a fully stocked bar inside the auditorium make film-going a luxurious ritual. Watching a classic on its giant screen feels like inhabiting early-20th-century movie magic.",
    "whisper": "Leather armchairs and velvet curtains frame a century of cinema",
    "arcana": "Nostalgic / Vintage / Retro",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Rivoli Ballroom",
    "location": "Brockley",
    "moods": ["nostalgic", "vintage", "romantic", "dreamy"],
    "genres": ["ballroom", "swing dance", "live music venue"],
    "url": "https://www.rivoliballroom.com/",
    "blurb": "Step into one of London's last intact 1950s ballrooms and find a world of crimson drapes, chandeliers and a sprung maple dance floor. Originally opened in 1913 and redesigned in the 1950s with lavish interiors, the Rivoli hosts jive and swing nights under its glittering ceiling. It's a time machine set to the rhythm of rock 'n' roll.",
    "whisper": "Crimson drapes and jive nights under glittering chandeliers",
    "arcana": "Nostalgic / Vintage / Retro",
    "last_verified": "2025-01-18"
  },
  {
    "name": "The George Inn",
    "location": "Southwark",
    "moods": ["nostalgic", "heritage", "timeless", "literary"],
    "genres": ["heritage pub", "historic site"],
    "url": "https://www.nationaltrust.org.uk/visit/london/south-east-london/the-george-inn",
    "blurb": "Just off Borough High Street stands London's last remaining galleried coaching inn. The George dates to the 17th century and was rebuilt after the Great Fire, retaining timber galleries overlooking a cobbled courtyard. Sitting by the fireplace with a pint, one feels the footsteps of Dickensian characters and weary travellers beneath the creaking beams.",
    "whisper": "A timber-galleried inn echoing with centuries of stories",
    "arcana": "Nostalgic / Vintage / Retro",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Cittie of Yorke",
    "location": "Holborn",
    "moods": ["nostalgic", "heritage", "atmospheric", "classic"],
    "genres": ["heritage pub", "historic site"],
    "url": "https://www.samuel-smiths.co.uk/pubs/cittie-of-yorke/",
    "blurb": "Behind its Tudor-style timber façade, this Grade II-listed tavern houses soaring hammer-beam rafters, deep booths and a roaring fire. A pub has stood on the site since the 15th century, though the current interior dates from 1924 and retains a Tudor feel. Order a pint drawn from oak casks and soak up the atmosphere of centuries past.",
    "whisper": "Vaulted rafters and oak casks conjure a Tudor tavern's warmth",
    "arcana": "Nostalgic / Vintage / Retro",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Fat Boy's Diner",
    "location": "Trinity Buoy Wharf",
    "moods": ["nostalgic", "vintage", "retro", "quirky"],
    "genres": ["retro diner", "americana"],
    "url": "https://the-line.org/pins/fat-boys-diner/",
    "blurb": "Parked beside the Thames, this chrome-clad trailer is an authentic all-American diner transplanted to London. Decked out with Formica booths, malted shakes and plenty of chrome, it invites visitors to eat in 1950s style. Burgers sizzle on the griddle as neon lights reflect in the river — a nostalgic slice of Americana at Trinity Buoy Wharf.",
    "whisper": "Chrome, milkshakes and jukebox tunes by the river's edge",
    "arcana": "Nostalgic / Vintage / Retro",
    "last_verified": "2025-01-18"
  },
  {
    "name": "The Comedy Store",
    "location": "West End",
    "moods": ["joyful", "funny", "warm", "uplifting"],
    "genres": ["improv", "stand-up", "comedy club"],
    "url": "https://london.thecomedystore.co.uk/",
    "blurb": "London's legendary basement brings improv masters and stand-ups together every night. The Comedy Store Players turn audience suggestions into hilarious scenes, while top comics hone fresh material on the main stage. Expect raucous laughter and the feeling you've entered comedy's beating heart.",
    "whisper": "Legendary laughs beneath the West End lights",
    "arcana": "Comic Relief",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Hoopla Impro at The Miller",
    "location": "London Bridge",
    "moods": ["funny", "playful", "joyful", "warm"],
    "genres": ["improv", "musical improv", "sketch"],
    "url": "https://www.hooplaimpro.com/improv-comedy-club-london-bridge.html",
    "blurb": "The UK's first improv theatre fills a cosy pub near London Bridge with creative chaos. Hoopla showcases a revolving roster of short-form games, improvised plays, films and even improv-musicals. Grab a drink, shout out suggestions and watch spontaneous comedy bloom.",
    "whisper": "Off-the-cuff antics in a snug pub cellar",
    "arcana": "Comic Relief",
    "last_verified": "2025-01-18"
  },
  {
    "name": "The Free Association",
    "location": "Southwark",
    "moods": ["funny", "joyful", "playful", "creative"],
    "genres": ["improv", "sketch", "alternative comedy"],
    "url": "https://www.thefreeassociation.co.uk/fa-shows",
    "blurb": "Occupying railway arches in Southwark, this permanent home for The Free Association offers London's finest long-form improv. Their monthly programme mixes seasoned pros, experimental shows and up-and-coming talent, turning gossip or confessions into side-splitting scenes. It's a community hub where imagination runs free.",
    "whisper": "Confessional tales become improv gold",
    "arcana": "Comic Relief",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Top Secret Comedy Club",
    "location": "Covent Garden",
    "moods": ["hilarious", "joyful", "uplifting", "intimate"],
    "genres": ["stand-up", "comedy club"],
    "url": "https://thetopsecretcomedyclub.co.uk/",
    "blurb": "Hidden down a Drury Lane staircase, this intimate basement club promises top-quality stand-up every night of the week. Top Secret's team curate varied line-ups and keep ticket prices low, creating an atmospheric space loved by audiences and touring comics alike. Celebrity drop-ins and a cheap bar make it feel like London's best kept secret.",
    "whisper": "A basement bursting with secret smiles",
    "arcana": "Comic Relief",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Backyard Comedy Club",
    "location": "Bethnal Green",
    "moods": ["funny", "warm", "joyful", "relaxed"],
    "genres": ["stand-up", "variety", "cabaret"],
    "url": "https://backyardcomedyclub.co.uk/",
    "blurb": "Founded by Lee Hurst in 1998, this purpose-built east-London hub reopened in 2013 with a state-of-the-art venue. Now a major comedy club with a laid-back atmosphere, it mixes West End-quality stand-up with variety shows, cabaret and swing dancing. Pop in for pizza, pool and plenty of belly laughs.",
    "whisper": "East-end laughs in a purpose-built playground",
    "arcana": "Comic Relief",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Boat Show Comedy Club (Tattershall Castle)",
    "location": "Victoria Embankment",
    "moods": ["joyful", "hilarious", "uplifting", "unique"],
    "genres": ["stand-up", "cabaret", "boat venue"],
    "url": "https://www.boatshowcomedy.co.uk/",
    "blurb": "For more than 25 years this floating comedy club moored on the River Thames has delivered unforgettable nights of laughter. Set aboard the Tattershall Castle paddle steamer with views of Big Ben and the London Eye, it features household names and rising stars, plus an after-show nightclub. Celebrate birthdays, anniversaries or just pure fun while the city lights twinkle outside.",
    "whisper": "Laughs on a boat beneath the city's glow",
    "arcana": "Comic Relief",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Banana Cabaret at The Bedford",
    "location": "Balham",
    "moods": ["funny", "warm", "uplifting", "classic"],
    "genres": ["stand-up", "cabaret", "comedy club"],
    "url": "https://www.bananacabaret.co.uk/",
    "blurb": "This long-running south-London institution takes over a grand Victorian music hall every weekend. Catch the brightest and best comedians at one of the UK's longest-running premiere comedy clubs. A friendly crowd, candlelit tables and a legendary Balham vibe make it a perfect spot for proper belly laughs.",
    "whisper": "A south-London stage glowing with weekend wit",
    "arcana": "Comic Relief",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Downstairs at the King's Head",
    "location": "Crouch End",
    "moods": ["warm", "joyful", "intimate", "classic"],
    "genres": ["stand-up", "spoken word", "cabaret"],
    "url": "https://www.downstairsatthekingshead.com/",
    "blurb": "Established in 1981, this 100-seat basement is one of Britain's oldest comedy clubs. It prides itself on a friendly, intimate atmosphere with shows throughout the week championing new comedy, music, spoken word and magic. Nearly every top comic has passed through its doors on their way up.",
    "whisper": "A cosy den where stars cut their teeth",
    "arcana": "Comic Relief",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Camden Comedy Club (Above the Camden Head)",
    "location": "Camden Town",
    "moods": ["hilarious", "playful", "joyful", "warm"],
    "genres": ["stand-up", "improv", "storytelling"],
    "url": "https://camdencomedyclub.com/",
    "blurb": "Tucked above the historic Camden Head pub, this award-winning room delivers comedy seven nights a week. Time Out rates it among London's top 20 comedy clubs, with recent guests including Stephen Merchant, Aisling Bea and Nish Kumar. From mixed-bill gigs to improv and storytelling nights, there's always a reason to laugh.",
    "whisper": "A pub attic alive with nightly mirth",
    "arcana": "Comic Relief",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Big Belly Comedy Club",
    "location": "South Bank",
    "moods": ["funny", "joyful", "uplifting", "lively"],
    "genres": ["stand-up", "mixed-bill", "comedy club"],
    "url": "https://bigbellycomedy.club/",
    "blurb": "Reinvented from its Vauxhall roots, Big Belly has become a comedy hub on the South Bank. Each weekend it brings you comedy stars of today as well as the stars of tomorrow, with comics who regularly appear on Taskmaster, Mock the Week and Live at the Apollo. Expect lively mixed-bill shows and a party atmosphere.",
    "whisper": "South Bank nights bursting with belly laughs",
    "arcana": "Comic Relief",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Museum of Comedy",
    "location": "Bloomsbury",
    "moods": ["warm", "joyful", "curious", "quirky"],
    "genres": ["stand-up", "sketch", "museum", "comedy club"],
    "url": "https://www.museumofcomedy.com/",
    "blurb": "Hidden beneath St George's Church, this eccentric venue combines a treasure trove of comedy memorabilia with nightly shows. Founded on April Fool's Day 2014, it has become a favourite spot for discovering the next big names, hosting rising-star nights and competitions like 'Sketch Off'. Established comics also road-test brand new material in its intimate crypt.",
    "whisper": "A crypt where history and gags collide",
    "arcana": "Comic Relief",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Up the Creek Comedy Club",
    "location": "Greenwich",
    "moods": ["hilarious", "warm", "unpredictable", "legendary"],
    "genres": ["stand-up", "mixed-bill", "comedy club"],
    "url": "https://up-the-creek.com/",
    "blurb": "This legendary Greenwich venue — once home to Malcolm Hardee — promises unpredictable nights of laughter. Time Out calls it 'one of the best places to see live comedy'. Regular shows mix household names with rising stars, and the Blackout brings new talent face-to-face with a lively crowd.",
    "whisper": "A Greenwich institution where anything can happen",
    "arcana": "Comic Relief",
    "last_verified": "2025-01-18"
  },
  {
    "name": "Comedy Cabin (Hoxton Cabin)",
    "location": "Hoxton",
    "moods": ["playful", "funny", "inclusive", "intimate"],
    "genres": ["stand-up", "alternative comedy", "cabaret"],
    "url": "https://www.comedycabin.club/",
    "blurb": "East London's favourite underground comedy club fills Hoxton Cabin with laughter every night. Regular shows range from fresh-comedy Mondays where newcomers share the stage with established acts, to themed and alternative Wednesdays that celebrate culture and experimental performance. Expect inclusive, intimate nights where you might catch the next big thing.",
    "whisper": "Hoxton's hidden haven for future stars",
    "arcana": "Comic Relief",
    "last_verified": "2025-01-18"
  }
]
