[
  {
    "name": "Embracing Grief – London Grief Tending Circles",
    "location": "Hackney (E5) / various London venues",
    "moods": ["Grief & Grace", "Spiritual / Sacred / Mystical", "Folk & Intimate"],
    "genres": ["grief circles", "community ritual", "embodied grief tending"],
    "url": "https://www.griefsupport.org.uk",
    "blurb": "Grief here is not a problem to fix but a weather to sit inside together. Embracing Grief host beautifully held circles and rituals in London, inviting you to lean into sorrow, rage, numbness and love with others who understand. Expect blankets, song, simple ritual and a steady facilitation team who know how to tend big feelings without rushing you, petal.",
    "last_verified": "2025-11-24"
  },
  {
    "name": "Old School Rooms @ Round Chapel – Communal Grief Rituals",
    "location": "Clapton / Hackney (E5)",
    "moods": ["Grief & Grace", "Spiritual / Sacred / Mystical", "Group Energy"],
    "genres": ["community ritual", "grief tending", "singing & drumming"],
    "url": "https://www.roundchapel.org",
    "blurb": "The Old School Rooms at the Round Chapel become a kind of indoor clearing for the heart: drums, song and a circle of chairs under high Hackney rafters. On communal grief ritual days, dozens gather to cry, wail, breathe and be witnessed, with plenty of time for gentle landing afterwards. If you're longing to feel less alone in your loss, this is a rare, brave nest for collective mourning.",
    "last_verified": "2025-11-24"
  },
  {
    "name": "Bija Garden of Wellbeing – Grief Circles in the Garden",
    "location": "West Ealing (W13)",
    "moods": ["Grief & Grace", "Spiritual / Sacred / Mystical", "Folk & Intimate"],
    "genres": ["grief circle", "restorative yoga", "women's circles"],
    "url": "https://bijagarden.com",
    "blurb": "Tucked behind a West Ealing terrace, Bija Garden is a tiny eco-studio of fairy lights, foliage and soft rugs on the floor. Alongside restorative yoga and women's circles, it occasionally hosts small grief circles and healing evenings—quiet, candlelit spaces where nine or so souls can rest their bones and speak what hurts. A good perch if you want grief held with herbal tea, gentle spirituality and a lot of cushions.",
    "last_verified": "2025-11-24"
  },
  {
    "name": "Bonnington Centre Death Café",
    "location": "Vauxhall (SW8)",
    "moods": ["Folk & Intimate", "The Thoughtful Stage", "Poetic"],
    "genres": ["death café", "community gathering"],
    "url": "https://deathcafe.com/c/bonningtoncentre/",
    "blurb": "In a scruffy, beloved community centre just off Vauxhall's main drag, the Bonnington Death Café gathers people around tables for cake, tea and talk of mortality. There's no agenda beyond honesty: you show up, you speak or listen, and death is allowed to be mentioned in the same breath as everyday life. Perfect if you want something low-key and kitchen-table real rather than formal therapy.",
    "last_verified": "2025-11-24"
  },
  {
    "name": "Rosslyn Hill Unitarian Chapel – Hampstead Death Café",
    "location": "Hampstead (NW3)",
    "moods": ["Grief & Grace", "Spiritual / Sacred / Mystical", "Poetic"],
    "genres": ["death café", "spiritual conversation"],
    "url": "https://www.rosslynhillchapel.org.uk",
    "blurb": "Rosslyn Hill Chapel is all steep steps, stone and stained glass—a Unitarian church that doubles as a haven for difficult conversations. Their Hampstead Death Café meets in this contemplative setting, welcoming anyone who wants to talk about death, grief and meaning without dogma or drama. Come for the candlelit calm and leave with that curious lightness that arrives when the unsayable has finally been said aloud.",
    "last_verified": "2025-11-24"
  },
  {
    "name": "Community Sauna Baths – Grief Sauna",
    "location": "Hackney Wick & Stratford (E9 / E20)",
    "moods": ["Body-Based / Movement-Led", "Grief & Grace", "Folk & Intimate"],
    "genres": ["grief sauna", "sauna ritual", "community wellbeing"],
    "url": "https://community-sauna.co.uk",
    "blurb": "Community Sauna Baths turns old public baths in Hackney Wick and a Stratford garden plot into steamy, wood-fired sanctuaries. Among the usual sauna sessions are special 'grief saunas' and trans grief nights—ritual-inflected steams where you can sweat, plunge and breathe through heartache in company. Think fire, water, silence and a small flock of strangers softening together in the heat.",
    "last_verified": "2025-11-24"
  },
  {
    "name": "Release: Boxing Through Grief – London Community Boxing",
    "location": "Peckham (SE15)",
    "moods": ["Body-Based / Movement-Led", "Grief & Grace", "Punchy / Protest"],
    "genres": ["boxing & movement", "grief programme"],
    "url": "https://www.instagram.com/thelossproject1/",
    "blurb": "At London Community Boxing in Peckham, The Loss Project's 'Release: Boxing Through Grief' swaps talking cures for heavy bags and footwork. Guided by a coach and grief practitioners, you get to punch, move and breathe your way through loss in a held, low-cost space. Ideal if your grief feels restless or angry and you need somewhere you won't be told to sit still and be sensible.",
    "last_verified": "2025-11-24"
  },
  {
    "name": "Grief Rave & Grief Moves – The Fandangoe Discoteca x The Loss Project",
    "location": "Touring (often Southbank Centre, SE1)",
    "moods": ["Grief & Grace", "Ecstatic", "Playful & Weird"],
    "genres": ["grief rave", "participatory dance", "mental health installation"],
    "url": "https://www.thelossproject.com/thefandangoediscoteca",
    "blurb": "The Fandangoe Discoteca is a travelling pink mini-club that parks up at places like Southbank Centre and invites you to dance out your grief. Grief Raves and Grief Moves sessions mix DJ sets, joy-soaked visuals and mental health practitioners on hand, holding space for everything from bereavement to climate dread. It's loud, tender and gloriously strange—a tiny disco nest where tears and euphoria share the same dancefloor.",
    "last_verified": "2025-11-24"
  },
  {
    "name": "Galleria Objets – \"Your Grief Belongs To You, And Can Be So So Pretty\"",
    "location": "East London (E1)",
    "moods": ["Poetic", "The Thoughtful Stage", "Melancholic Beauty"],
    "genres": ["contemporary art", "grief-themed exhibition"],
    "url": "https://objetstrouves.co.uk",
    "blurb": "Galleria Objets is a small contemporary gallery in east London with a taste for work that sits in the liminal and the quietly intense. Recent shows like 'Your Grief Belongs To You, And Can Be So So Pretty' have treated loss as something to be looked at sideways: tender, aesthetic, a little unsettling, never mocked. If you'd like to wander with your feelings rather than unpack them in a circle, this is a soft-lit room to do it in.",
    "last_verified": "2025-11-24"
  }
]
